;*================================================================*
;*                 P R I M E   I N F O R M A T I C A              *
;*----------------------------------------------------------------*
;*    PROGRAMA....:  ARQUIVO CLIPE COBOL PSPAD                    *
;*    PROGRAMADOR.:  PEDRO BLANCO                      -  PRIME   *
;*    DATA........:  22/02/2010                                   *
;*----------------------------------------------------------------*
;*    OBJETIVO....:  CATALOGAR TODOS COMANDOS COBOL E SUAS ESTRU- *
;*                   TURAS PARA FACILITAR CODIFICAÇÃO             *
;*----------------------------------------------------------------*
;
;*================================================================*
;*                        A L T E R A C A O                       *
;*----------------------------------------------------------------*
;*    PROGRAMADOR.:  LEONARDO QUESADA                  -  PRIME   *
;*    DATA........:  24/02/2010                                   *
;*----------------------------------------------------------------*
;*    OBJETIVO....:  INCLUSAO DE COMANDOS CICS                    *
;*----------------------------------------------------------------*
;
;*================================================================*
;*                        A L T E R A C A O                       *
;*----------------------------------------------------------------*
;*    PROGRAMADOR.:  PEDRO BLANCO                      -  PRIME   *
;*    DATA........:  26/02/2010                                   *
;*----------------------------------------------------------------*
;*    OBJETIVO....:  INCLUSAO DE BRADS E MODELOS DE PROGRAMAS     *
;*----------------------------------------------------------------*
;
;*================================================================*
;*                        A L T E R A C A O                       *
;*----------------------------------------------------------------*
;*    PROGRAMADOR.:  PEDRO BLANCO                      -  PRIME   *
;*    DATA........:  08/03/2010                                   *
;*----------------------------------------------------------------*
;*    OBJETIVO....:  INCLUSAO DE BRADS E MODELO DE RELATORIO      *
;*----------------------------------------------------------------*
;
;*================================================================*
;*                        A L T E R A C A O                       *
;*----------------------------------------------------------------*
;*    PROGRAMADOR.:  ADONILIO JUNQUEIRA                -  PRIME   *
;*    DATA........:  08/03/2010                                   *
;*----------------------------------------------------------------*
;*    OBJETIVO....:  INCLUSAO DE OUTRAS FORMAS DE COMANDOS        *
;*----------------------------------------------------------------*
;
;*================================================================*
;*                        A L T E R A C A O                       *
;*----------------------------------------------------------------*
;*    PROGRAMADOR.:  PEDRO BLANCO                      -  PRIME   *
;*    DATA........:  17/03/2010                                   *
;*----------------------------------------------------------------*
;*    OBJETIVO....:  INCLUSAO DE COMANDOS PARA TEMPORARY STORAGE  *
;*                   CORRECAO DE ALGUNS EIBRESPS                  *
;*                   INCLUSAO DE COMANDOS CURRENT TIMESTAMP,   -  *
;*                   CURRENT DATE, INCLUDE                        *
;*----------------------------------------------------------------*
;
;*================================================================*
;*                        A L T E R A C A O                       *
;*----------------------------------------------------------------*
;*    PROGRAMADOR.:  PEDRO BLANCO                      -  PRIME   *
;*    DATA........:  17/03/2010                                   *
;*----------------------------------------------------------------*
;*    OBJETIVO....:  INCLUSAO DB2 - DECLARE CURSOR...FOR DELETE   *
;*----------------------------------------------------------------*
;
;*================================================================*
;*                        A L T E R A C A O                       *
;*----------------------------------------------------------------*
;*    PROGRAMADOR.:  PEDRO BLANCO                      -  PRIME   *
;*    DATA........:  27/08/2010                                   *
;*----------------------------------------------------------------*
;*    OBJETIVO....:  INCLUSAO DELETE VSAM NO CICS                 *
;*----------------------------------------------------------------*
;
;*================================================================*
;*                        A L T E R A C A O                       *
;*----------------------------------------------------------------*
;*    PROGRAMADOR.:  PEDRO BLANCO                      -  PRIME   *
;*    DATA........:  11/11/2010                                   *
;*----------------------------------------------------------------*
;*    OBJETIVO....:  IMPLEMENTACAO DO CLIP INTERATIVO COM USO DE  *
;*                    VARIAVEIS                                   *
;*----------------------------------------------------------------*
;*================================================================*
;*                        A L T E R A C A O                       *
;*----------------------------------------------------------------*
;*    PROGRAMADOR.:  PEDRO BLANCO                      -  PRIME   *
;*    DATA........:  13/04/2011                                   *
;*----------------------------------------------------------------*
;*    OBJETIVO....:  CRIACAO DOS MODELOS PROGRAMAS TI Melhorias   *
;*----------------------------------------------------------------*
;

[MACRO DEFINITION]

;*----------------------------------------------------------------*
; ** ÁREA DE DECLARAÇÃO DE VARIÁVEIS PARA MONTAGEM DE COMANDOS **
;*----------------------------------------------------------------*

;EXEMPLO:
;%CONTROL%=@X CAPTION,TEXT,DEFAULT,OPTIONS,DELIMITER,DIALOG_TYPE

;*----------------------------------------------------------------*
; ** VARIÁVEIS PARA CLIP - VAR                               **

%Var1TamanhoPic%=@E "Tamanho Picture :",,09

;*----------------------------------------------------------------*


;*----------------------------------------------------------------*
; ** VARIÁVEIS PARA CLIP - DB2                               **

%Var1Db2Dclgen%=@E "DCLGEN :",,DCLGENXX
%Var2Db2Tabela%=@E "Tabela :",,TTBL_XXXXX_XXX

;*----------------------------------------------------------------*


;*----------------------------------------------------------------*
; ** VARIÁVEIS PARA CLIP - CICS                              **

%Var0CicsPrograma%=@E "Programa :",,PROGRAMA
%Var1CicsArquivo%=@E "Arquivo :",,ARQUIVO
%Var1CicsTran%=@E "Transação :",,TRAN
%Var2CicsAreaArquivo%=@E "Área do Arquivo :",,WRK-AREA-ARQUIVO
%Var2CicsCommarea%=@E "Área de Comunicação :",,WRK-COMMAREA-PROGRAMA
%Var3CicsChave%=@E "Campo Chave :",,WRK-CHAVE
%Var4CicsStart%=@C "Condição (GREATER EQUAL/EQUAL) :",,"GTEQ","GTEQ";"EQUAL",
%Var5CicsMapa%=@E "Mapa :",,MAPA
%Var6CicsMapset%=@E "Mapset :",,MAPSET

;*----------------------------------------------------------------*


;*----------------------------------------------------------------*
; ** VARIÁVEIS PARA CLIP - MODELO - BALANCE LINE 2 ARQUIVOS  **

%VAR0MODELOMAPA%=@E "Mapa :",,MAPA999
%VAR1MODELOPROGRAMA%=@E "Programa :",,PROG9999
%VAR2MODELODATA%=@D "Data :",,,,,
%VAR3MODELOARQENT1%=@E "Arquivo de Entrada Principal :",,ARQUIVO1
%VAR4MODELOARQENT2%=@E "Arquivo de Entrada Secundário :",,ARQUIVO2
%VAR5MODELOARQSAI1%=@E "Arquivo de Saída :",,ARQUIVO3

;*----------------------------------------------------------------*
; ** VARIÁVEIS PARA CLIP - MODELO - TI Melhorias **

%Var0TIMelhoriasSistema%=@E "Centro de Custo (Sistema):",,CCCC
%Var1TIMelhoriasPrograma%=@E "Programa :",,PROG9999
%Var2TIMelhoriasData%=@D "Data :",,,,,
%Var3TIMelhoriasBookEntrada%=@E "Book Entrada :",,CCCCW001
%Var4TIMelhoriasBookSaida%=@E "Book Saida :",,CCCCW002
%Var5TIMelhoriasBookFuncional%=@E "Book Funcional :",,CCCCW003
%Var6TIMelhoriasBookPaginacao%=@E "Book Paginação (GAM) :",,CCCCW004
%Var7TIMelhoriasProgramaFuncional%=@E "Programa Funcional :",,PROG0001

;*----------------------------------------------------------------*


;*----------------------------------------------------------------*
; ** VARIÁVEIS PARA CLIP - PADRAO - SECTION                  **

%Var1NumSection%=@E "Número (4 Dígitos)....: ",,,,,
%Var2NomeSection%=@E "Nome (Máx. 30 Dígito): ",,,,,

%Var1PadraoPrograma%=@E "Programa : ",,PROG9999,,,
%Var2PadraoData%=@D "Data :",,,,,
%Var3PadraoRemark%=@E "Remark : ",,PR0001,,,

;*----------------------------------------------------------------*

;*----------------------------------------------------------------*
; ** VARIÁVEIS PARA CLIP - PADRAO - FILE DESCRIPTION         **

%Var1FileNomeArquivo%=@E "Arquivo : ",,EARQUIVO,,,
%Var2FileTamArquivo%=@E "Lenght Record : ",,0999,,,
%Var3FileEntradaSaida%=@C "Entrada/Saída :",,"INPUT ","INPUT ";"OUTPUT",

;*----------------------------------------------------------------*




;*----------------------------------------------------------------*
;      *** AREA DE COMANDOS COBOL EM ORDEM ALFABÉTICA ***
;*----------------------------------------------------------------*

[DATE]

%DATE1%

;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA A
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[ACCEPT | ]
ACCEPT
;
[ADD | ]
ADD
;
[ADD...TO | ]
ADD 1                       TO   VARIAVEL
;
[ADVANCING | ]
ADVANCING
;
[AFTER | ]
AFTER
;
[ALL | ]
ALL
;
[AND | ]
AND
;
[ASCENDING | ]
ASCENDING
;
[ASSIGN | ]
ASSIGN
;
[AT | ]
AT
;
[AUTHOR | ]
AUTHOR
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA B
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[BEFORE | ]
BEFORE
;
[BLOCK | ]
BLOCK
;
[BY | ]
BY
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA C
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[CALL | ]
CALL
;
[CHAIN | ]
CHAIN
;
[CONSOLE | ]
CONSOLE
;
[COMMA | ]
COMMA
;
[COMP | ]
COMP
;
[COMP-3 | ]
COMP-3
;
[COMP-4 | ]
COMP-4
;
[COMPUTE | ]
COMPUTE
;
[CONFIGURATION | SECTION]
CONFIGURATION
;
[CONTAINS | ]
CONTAINS
;
[CONTINUE | ]
CONTINUE
;
[COUNT | ]
COUNT
;
[COPY | ]
COPY
;
[CLOSE | ]
CLOSE
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA D
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[DATA | DIVISION]
DATA
;
[DECIMAL-POINT | ]
DECIMAL-POINT
;
[DELETE | ]
DELETE
;
[DELIMITED | ]
DELIMITED
;
[DEPENDING | ]
DEPENDING
;
[DESCENDING | ]
DESCENDING
;
[DIVISION | ]
DIVISION
;
[DISPLAY | ]
DISPLAY
;
[DIVIDE | ]
DIVIDE
;
[DIVIDE...BY...GIVING...REMAINDER | ]
DIVIDE |(DIVIDENDO)          BY   (DIVISOR)
                            GIVING    (QUOCIENTE)
                            REMAINDER (RESTO)
;
[DOWN | ]
DOWN
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA E
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[EJECT | ]
EJECT
;
[ELSE | ]
ELSE
;
[END | ]
END
;
[ENVIRONMENT | DIVISION ]
ENVIRONMENT
;
[EQUAL | ]
EQUAL
;
[EVALUATE | ]
EVALUATE
;
[EVALUATE...VARIAVEL | ]
EVALUATE (VARIAVEL)
   WHEN 1
      XXXXXX
   WHEN 2
      XXXXXXX
   WHEN 3
   WHEN 4
      XXXXXX
   WHEN OTHER
      CONTINUE
END-EVALUATE.
;
[EVALUATE...TRUE | ]
EVALUATE TRUE

    WHEN XX EQUAL 1

    WHEN OTHER
        CONTINUE

END-EVALUATE.
;
[EXTEND | ]
EXTEND
;
[EXIT | ]
EXIT
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA F
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[FALSE | ]
FALSE
;
[FILE | SECTION ]
FILE
;
[FILE-CONTROL | ]
FILE-CONTROL
;
[FILLER | ]
FILLER
;
[FIRST | ]
FIRST
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA G
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[GIVING | ]
GIVING
;
[GOBACK | ]
GOBACK
;
[GO TO | ]
GO TO
;
[GREATER | ]
GREATER
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA H
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[HIGH-VALUES | ]
HIGH-VALUES
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA I
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[IDENTIFICATION | DIVISION]
IDENTIFICATION
;
[IF | ]
IF
;
[IF...END-IF | ]
IF (CONDICAO)
    |
ELSE

END-IF
;
[INDEXED | ]
INDEXED
;
[INITIALIZE | ]
INITIALIZE
;
[INPUT | ]
INPUT
;
[INPUT-OUTPUT | SECTION ]
INPUT-OUTPUT
;
[INTO | ]
INTO
;
[I-O | ]
I-O
;
[INSPECT | ]
INSPECT
;
[INSPECT...REPLACING | ]
INSPECT |(VARIAVEL)          REPLACING ALL '/' BY '.'
;
[INSPECT...TALLYING | ]
INSPECT WRK-VARIAVEL-INTEIRA TALLYING TALLY FOR ALL 'TESTE'.

IF TALLY GREATER ZEROS
   DISPLAY 'ENCONTROU'
ELSE
   DISPLAY 'NÃO ENCONTROU'
END-IF.
;
[IS | ]
IS
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA K
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[KEY | ]
KEY
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA L
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[LABEL | ]
LABEL
;
[LEADING | ]
LEADING
;
[LENGTH | ]
LENGTH
;
[LESS | ]
LESS
;
[LINE | ]
LINE
;
[LINES | ]
LINES
;
[LINKAGE | ]
LINKAGE
;
[LOW-VALUES | ]
LOW-VALUES
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA M
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[MODE | ]
MODE
;
[MOVE | ]
MOVE
;
[MOVE...TO | ]
MOVE |(VARIAVEL1)            TO   (VARIAVEL2)
;
[MULTIPLY | ]
MULTIPLY
;
[MULTIPLY...GIVING | ]
MULTIPLY |(VARIAVEL)         BY   2    GIVING    (RESULTADO)
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA N
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[NEGATIVE | ]
NEGATIVE
;
[NEXT | ]
NEXT
;
[NEXT SENTENCE | ]
NEXT SENTENCE
;
[NO | ]
NO
;
[NOT | ]
NOT
;
[NUMERIC | ]
NUMERIC
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA O
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[OCCURS | ]
OCCURS
;
[OF | ]
OF
;
[ON | ]
ON
;
[OPEN | ]
OPEN
;
[OR | ]
OR
;
[ORGANIZATION | ]
ORGANIZATION
;
[OTHER | ]
OTHER
;
[OUTPUT | ]
OUTPUT
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA P
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[PAGE | ]
PAGE
;
[PERFORM | ]
PERFORM
;
[PERFORM...END-PERFORM | ]
PERFORM
    |
END-PERFORM
;
[PERFORM...VARYING | ]
PERFORM VARYING  IND-1      FROM      01  BY  01
          UNTIL (IND-1      GREATER   10)
   |
END-PERFORM
;
[PIC | ]
PIC
;
[PICTURE | ]
PICTURE
;
[POINTER | ]
POINTER
;
[POSITIVE | ]
POSITIVE
;
[PREVIOUS | ]
PREVIOUS
;
[PROCEDURE | ]
PROCEDURE
;
[PROGRAM-ID | ]
PROGRAM-ID
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA R
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[READ | ]
READ
;
[READ...INTO | ]
READ ARQVIVO                INTO VARIAVEL
;
[READ...NEXT | ]
READ ARQVIVO NEXT           INTO VARIAVEL
;
[READ...PREVIOUS | ]
READ ARQVIVO PREVIOUS       INTO VARIAVEL
;
[RECORD | ]
RECORD
;
[RECORDING | ]
RECORDING
;
[RECORDS | ]
RECORDS
;
[REDEFINES | ]
REDEFINES
;
[RELEASE | ]
RELEASE
;
[REMAINDER | ]
REMAINDER
;
[RETURN-CODE | ]
RETURN-CODE
;
[REWRITE | ]
REWRITE
;
[RUN | ]
RUN
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA S
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[SEARCH | ]
SEARCH
;
[SEARCH...END-SEARCH | ]
       01  WRK-TB-MENSAGEM.
           05 FILLER                   PIC  X(060)         VALUE
           '00OK SEM ERRO'.
           05 FILLER                   PIC  X(060)         VALUE
           '01CAMPO DEVE SER NUMERICO'.
           05 FILLER                   PIC  X(060)         VALUE
           '02CAMPO NAO PODE ESTAR EM BRANCO'.

       01  FILLER                      REDEFINES WRK-TB-MENSAGEM.
           05 WRK-TABELA-INTERNA       OCCURS 03 TIMES
                                       INDEXED   BY  IN-INDEX.
              10 TB-COD-MSG            PIC  9(002).
              10 TB-DESC-MSG           PIC  X(058).

       01  WRK-FLAG-INCONS             PIC  9(002)         VALUE ZEROS.
       01  WRK-VARIAVEL                PIC  X(050)         VALUE SPACES.

SEARCH WRK-TABELA-INTERNA
  AT END
     MOVE '* CODIGO NAO ENCONTRADO *'  TO   WRK-VARIAVEL
  WHEN WRK-FLAG-INCONS                 EQUAL     TB-COD-MSG(IN-INDEX)
     MOVE TB-DESC-MSG(IN-INDEX)        TO   WRK-VARIAVEL
END-SEARCH.
;
[SECTION | ]
SECTION
;
[SEQUENTIAL | ]
SEQUENTIAL
;
[SELECT | ]
SELECT
;
[SET | ]
SET
;
[SET...TO | ]
SET |VARIAVEL                          TO   TRUE
;
[SQLCODE | ]
SQLCODE
;
[SORT | ]
SORT
;
[SORT...INPUT...OUTPUT | ]
SORT |(ARQUIVO)
   ASCENDING                (VARIAVEL)
   INPUT PROCEDURE          (PROCEDIMENTOS ENTRADA)
   OUTPUT PROCEDURE         (PROCEDIMENTOS SAIDA)
;
[SORT...USING...GIVING | ]
SORT |(ARQUIVO)
   ASCENDING                (VARIAVEL)
   USING                    (ARQUIVO ENTRADA)
   GIVING                   (ARQUIVO SAIDA)
;
[SPACES | ]
SPACES
;
[STANDARD | ]
STANDARD
;
[STATUS | ]
STATUS
;
[START | ]
START
;
[START...KEY | ]
START |ARQUIVO     (KEY      NOT LESS VARIAVEL)
;
[STRING | ]
STRING
;
[STRING...END-STRING | ]
STRING |'TEXTO 1'
       'TEXTO 2'
   DELIMITED BY SIZE        INTO VARIAVEL
END-STRING
;
[STRING...DATA | ]
STRING WRK-ANO-DB2
       WRK-MES-DB2
       WRK-DIA-DB2
  DELIMITED BY SIZE         INTO WRK-DATA-AUX
END-STRING.
;
[STRING...DATA / | ]
STRING WRK-DIA-AUX '/'
       WRK-MES-AUX '/'
       WRK-ANO-AUX
  DELIMITED BY SIZE         INTO WRK-DATA-X10
END-STRING.
;
[STRING...DATA DB2 | ]
STRING WRK-DATA-DD '.'
       WRK-DATA-MM '.'
       WRK-DATA-AAAA
  DELIMITED BY SIZE         INTO WRK-DATA-DB2
END-STRING.
;
[STOP | ]
STOP
;
[STOP RUN | ]
STOP RUN
;
[SUBTRACT | ]
SUBTRACT
;
[SUBTRACT...FROM | ]
SUBTRACT |1                  FROM VARIAVEL
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA T
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[TALLY | ]
TALLY
;
[THRU | ]
THRU
;
[TIMES | ]
TIMES
;
[TO | ]
TO
;
[TRUE | ]
TRUE
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA U
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[UNTIL | ]
UNTIL
;
[UP | ]
UP
;
[USING | ]
USING
;
[USAGE | ]
USAGE
;
[UNSTRING | ]
UNSTRING
;
[UNSTRING...END-UNSTRING | ]
UNSTRING |VARIAVEL
    INTO VAR1
         VAR2
END-UNSTRING
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA V
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[VALUE | ]
VALUE
;
[VALUES | ]
VALUES
;
[VARYING | ]
VARYING
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA W
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[WHEN | ]
WHEN
;
[WITH | ]
WITH
;
[WORKING-STORAGE | ]
WORKING-STORAGE
;
[WRITE | ]
WRITE
;
[WRITE...FROM | ]
WRITE |FD-VARIAVEL           FROM  WRK-VARIAVEL
;
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;     LETRA Z
;*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
[ZERO | ]
ZERO
;
[ZEROS | ]
ZEROS
;
[ZEROES | ]
ZEROES
;
;*----------------------------------------------------------------*
; *** AREA DE DECLARACAO DE VARIAVEIS GENERICAS               ***
;*----------------------------------------------------------------*
[VAR REMOVER SINAL | PIC S9(9)...PIC 9(9)]
       01  WRK-AUX-S9-%Var1TamanhoPic%               PIC +9(0%Var1TamanhoPic%)         VALUE ZEROS.
       01  FILLER                      REDEFINES WRK-AUX-S9-%Var1TamanhoPic%.
           05 FILLER                   PIC  X(001).
           05 WRK-AUX-9-%Var1TamanhoPic%             PIC  9(0%Var1TamanhoPic%).
;
[VAR NULIDADE | ]
05 WRK-VAR-NULL             PIC S9(004) COMP    VALUE ZEROS.
;
[VAR DATE NULO | ]
       01  WRK-DATE-NULL               PIC  X(010)         VALUE
           '01.01.0001'.
;
[VAR TIMESTAMP NULO | ]
       01  WRK-TIMESTAMP-NULL          PIC  X(026)         VALUE
           '0001-01-01-00.00.00.000000'.
;
;*----------------------------------------------------------------*
; *** AREA DE COMANDOS DB2 PADRONIZADOS COM TESTE DE SQL CODE ***
;*----------------------------------------------------------------*
[DB2 INCLUDE | ]
           EXEC SQL
                INCLUDE %Var1Db2Dclgen%
           END-EXEC.
;
[DB2 IDENTITY_VAL_LOCAL | ]
           EXEC SQL
                SET  :%Var1Db2Dclgen%.COL1  =  IDENTITY_VAL_LOCAL()
           END-EXEC.
;
[DB2 CURRENT TIMESTAMP | ]
       01  WRK-TIMESTAMP               PIC  X(026)         VALUE ZEROS.
       01  FILLER                      REDEFINES WRK-TIMESTAMP.
           05 WRK-TIMESTAMP-ANO        PIC  9(004).
           05 FILLER                   PIC  X(001).
           05 WRK-TIMESTAMP-MES        PIC  9(002).
           05 FILLER                   PIC  X(001).
           05 WRK-TIMESTAMP-DIA        PIC  9(002).
           05 FILLER                   PIC  X(001).
           05 WRK-TIMESTAMP-HOR        PIC  9(002).
           05 FILLER                   PIC  X(001).
           05 WRK-TIMESTAMP-MIN        PIC  9(002).
           05 FILLER                   PIC  X(001).
           05 WRK-TIMESTAMP-SEG        PIC  9(002).
           05 FILLER                   PIC  X(001).
           05 WRK-TIMESTAMP-MIL        PIC  9(006).

           EXEC SQL
                SET :WRK-TIMESTAMP     =    CURRENT TIMESTAMP
           END-EXEC.
;
[DB2 CURRENT DATE | ]
       01  WRK-CURRENT-DATE            PIC  X(010)         VALUE SPACES.
           05 WRK-CURRENT-DATE-DIA     PIC  9(002).
           05 FILLER                   PIC  X(001).
           05 WRK-CURRENT-DATE-MES     PIC  9(002).
           05 FILLER                   PIC  X(001).
           05 WRK-CURRENT-DATE-ANO     PIC  9(004).

           EXEC SQL
                SET :WRK-CURRENT-DATE  =    CURRENT DATE
           END-EXEC.
;
[DB2 DECLARE CURSOR | ]
           EXEC SQL
                DECLARE  CSR01-%Var1Db2Dclgen% CURSOR FOR
                 SELECT  COL1
                        ,COL2
                   FROM  DB2PRD.%Var2Db2Tabela%
                  WHERE  COL3  =  :%Var1Db2Dclgen%.COL3
                    AND  COL4  =  :%Var1Db2Dclgen%.COL4
               ORDER BY  COL1
                        ,COL2
           END-EXEC.
;
[DB2 DECLARE CURSOR...WITH HOLD | MANTÉM CURSOR ABERTO APÓS COMMIT]
           EXEC SQL
                DECLARE  CSR01-%Var1Db2Dclgen% CURSOR WITH HOLD FOR
                 SELECT  COL1
                   FROM  DB2PRD.%Var2Db2Tabela%
                  WHERE  COL3  =  :%Var1Db2Dclgen%.COL3
                    AND  COL4  =  :%Var1Db2Dclgen%.COL4
           END-EXEC.
;
[DB2 DECLARE CURSOR...WITH HOLD...FOR UPDATE | ]
           EXEC SQL
                DECLARE  CSR01-%Var1Db2Dclgen% CURSOR WITH HOLD FOR
                 SELECT  COL1
                   FROM  DB2PRD.%Var2Db2Tabela%
                  WHERE  COL3  =  :%Var1Db2Dclgen%.COL3
                    AND  COL4  =  :%Var1Db2Dclgen%.COL4
           FOR UPDATE OF COL1,
                         COL2
           END-EXEC.
;
[DB2 DELETE...CURRENT OF CURSOR | ]
           EXEC SQL
                DELETE
                  FROM  DB2PRD.%Var2Db2Tabela%
                 WHERE  CURRENT OF CSR01-%Var1Db2Dclgen%
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS)  OR
              (SQLWARN0                EQUAL     'W')
               MOVE 'DB2'              TO   ERR-TIPO-ACESSO
               MOVE '%Var2Db2Tabela%'   TO   ERR-DBD-TAB
               MOVE 'DELETE'           TO   ERR-FUN-COMANDO
               MOVE  SQLCODE           TO   ERR-SQL-CODE
               MOVE '0010'             TO   ERR-LOCAL
               MOVE  SPACES            TO   ERR-SEGM
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[DB2 UPDATE...CURRENT OF CURSOR | ]
           EXEC SQL
                UPDATE  DB2PRD.%Var2Db2Tabela%
                   SET  COL1  =  :%Var1Db2Dclgen%.COL1
                       ,COL2  =  :%Var1Db2Dclgen%.COL2
                 WHERE  CURRENT OF CSR01-%Var1Db2Dclgen%
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS) OR
              (SQLWARN0                EQUAL     'W')
               MOVE 'DB2'              TO   ERR-TIPO-ACESSO
               MOVE '%Var2Db2Tabela%'   TO   ERR-DBD-TAB
               MOVE 'UPDATE'           TO   ERR-FUN-COMANDO
               MOVE  SQLCODE           TO   ERR-SQL-CODE
               MOVE '0010'             TO   ERR-LOCAL
               MOVE  SPACES            TO   ERR-SEGM
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[DB2 OPEN CURSOR | ]
           EXEC SQL
                OPEN  CSR01-%Var1Db2Dclgen%
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS) OR
              (SQLWARN0                EQUAL     'W')
               MOVE 'DB2'              TO   ERR-TIPO-ACESSO
               MOVE '%Var2Db2Tabela%'   TO   ERR-DBD-TAB
               MOVE 'OPEN'             TO   ERR-FUN-COMANDO
               MOVE  SQLCODE           TO   ERR-SQL-CODE
               MOVE '0010'             TO   ERR-LOCAL
               MOVE  SPACES            TO   ERR-SEGM
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[DB2 FETCH CURSOR | ]
           EXEC SQL
                FETCH  CSR01-%Var1Db2Dclgen%
                 INTO :%Var1Db2Dclgen%.COL1
                     ,:%Var1Db2Dclgen%.COL2
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS AND +100) OR
              (SQLWARN0                EQUAL     'W')
               MOVE 'DB2'              TO   ERR-TIPO-ACESSO
               MOVE '%Var2Db2Tabela%'   TO   ERR-DBD-TAB
               MOVE 'FETCH'            TO   ERR-FUN-COMANDO
               MOVE  SQLCODE           TO   ERR-SQL-CODE
               MOVE '0010'             TO   ERR-LOCAL
               MOVE  SPACES            TO   ERR-SEGM
               PERFORM 9999-TRATAR-ERRO
           ELSE
               IF (SQLCODE             EQUAL     +100)
                   MOVE 'S'            TO WRK-FIM-CURSOR-%Var1Db2Dclgen%
              ELSE
                   ADD 1               TO ACU-LIDOS-%Var1Db2Dclgen%
              END-IF
           END-IF.
;
[DB2 CLOSE CURSOR | ]
           EXEC SQL
                CLOSE  CSR01-%Var1Db2Dclgen%
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS) OR
              (SQLWARN0                EQUAL     'W')
               MOVE 'DB2'              TO   ERR-TIPO-ACESSO
               MOVE '%Var2Db2Tabela%'   TO   ERR-DBD-TAB
               MOVE 'CLOSE'            TO   ERR-FUN-COMANDO
               MOVE  SQLCODE           TO   ERR-SQL-CODE
               MOVE '0010'             TO   ERR-LOCAL
               MOVE  SPACES            TO   ERR-SEGM
              PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[DB2 INSERT | ]
           EXEC SQL
                INSERT INTO DB2PRD.%Var2Db2Tabela%
                          ( COL1
                           ,COL2
                           ,COL3 )
                VALUES   ( :%Var1Db2Dclgen%.COL1
                          ,:%Var1Db2Dclgen%.COL2
                          ,:%Var1Db2Dclgen%.COL3 )
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS) OR
              (SQLWARN0                EQUAL     'W')
               MOVE 'DB2'              TO   ERR-TIPO-ACESSO
               MOVE '%Var2Db2Tabela%'   TO   ERR-DBD-TAB
               MOVE 'INSERT'           TO   ERR-FUN-COMANDO
               MOVE  SQLCODE           TO   ERR-SQL-CODE
               MOVE '0010'             TO   ERR-LOCAL
               MOVE  SPACES            TO   ERR-SEGM
               PERFORM 9999-TRATAR-ERRO
           ELSE
               ADD 1                   TO   ACU-GRAVS-%Var1Db2Dclgen%
           END-IF.
;
[DB2 SELECT | ]
           EXEC SQL
                SELECT  COL1
                       ,COL2
                  INTO :%Var1Db2Dclgen%.COL1
                      ,:%Var1Db2Dclgen%.COL2
                  FROM  DB2PRD.%Var2Db2Tabela%
                 WHERE  COL4  =  :%Var1Db2Dclgen%.COL4
                   AND  COL5  <  :%Var1Db2Dclgen%.COL5
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS AND +100) OR
              (SQLWARN0                EQUAL     'W')
               MOVE 'DB2'              TO   ERR-TIPO-ACESSO
               MOVE '%Var2Db2Tabela%'   TO   ERR-DBD-TAB
               MOVE 'SELECT'           TO   ERR-FUN-COMANDO
               MOVE  SQLCODE           TO   ERR-SQL-CODE
               MOVE '0010'             TO   ERR-LOCAL
               MOVE  SPACES            TO   ERR-SEGM
              PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[DB2 DELETE | ]
           EXEC SQL
                DELETE
                  FROM  DB2PRD.%Var2Db2Tabela%
                 WHERE  COL1  =  :%Var1Db2Dclgen%.COL1
                   AND  COL2  =  :%Var1Db2Dclgen%.COL2
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS) OR
              (SQLWARN0                EQUAL     'W')
               MOVE 'DB2'              TO   ERR-TIPO-ACESSO
               MOVE '%Var2Db2Tabela%'   TO   ERR-DBD-TAB
               MOVE 'DELETE'           TO   ERR-FUN-COMANDO
               MOVE  SQLCODE           TO   ERR-SQL-CODE
               MOVE '0010'             TO   ERR-LOCAL
               MOVE  SPACES            TO   ERR-SEGM
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[DB2 UPDATE | ]
           EXEC SQL
                UPDATE  DB2PRD.%Var2Db2Tabela%
                   SET  COL1  =  :%Var1Db2Dclgen%.COL1
                       ,COL2  =  :%Var1Db2Dclgen%.COL2
                 WHERE  COL2  =  :%Var1Db2Dclgen%.COL2
                   AND  COL3  =  :%Var1Db2Dclgen%.COL3
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS) OR
              (SQLWARN0                EQUAL     'W')
               MOVE 'DB2'              TO   ERR-TIPO-ACESSO
               MOVE 'TABELA'           TO   ERR-DBD-TAB
               MOVE '%Var2Db2Tabela%'           TO   ERR-FUN-COMANDO
               MOVE  SQLCODE           TO   ERR-SQL-CODE
               MOVE '0010'             TO   ERR-LOCAL
               MOVE  SPACES            TO   ERR-SEGM
               PERFORM 9999-TRATAR-ERRO
           ELSE
               ADD 1                   TO   ACU-ATULZ-%Var1Db2Dclgen%
           END-IF.
;
[DB2 SELECT...COUNT | ]
       01  WRK-COUNT                   PIC S9(009) COMP    VALUE ZEROS.

           EXEC SQL
                SELECT  COUNT(*)
                  INTO :WRK-COUNT
                  FROM  DB2PRD.%Var2Db2Tabela%
                 WHERE  COL1  =  :%Var1Db2Dclgen%.COL1
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS) OR
              (SQLWARN0                EQUAL     'W')
               MOVE 'DB2'              TO   ERR-TIPO-ACESSO
               MOVE '%Var2Db2Tabela%'   TO   ERR-DBD-TAB
               MOVE 'SELECT'           TO   ERR-FUN-COMANDO
               MOVE  SQLCODE           TO   ERR-SQL-CODE
               MOVE '0010'             TO   ERR-LOCAL
               MOVE  SPACES            TO   ERR-SEGM
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[DB2 SELECT...1 LINHA | ]
           EXEC SQL
                SELECT  COL1
                       ,COL2
                  INTO :%Var1Db2Dclgen%.COL1
                      ,:%Var1Db2Dclgen%.COL2
                  FROM  DB2PRD.%Var2Db2Tabela%
                 WHERE  COL4  =  :%Var1Db2Dclgen%.COL4
                   AND  COL5  =  :%Var1Db2Dclgen%.COL5
                 FETCH  FIRST ROW ONLY
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS AND +100) OR
              (SQLWARN0                EQUAL     'W')
               MOVE 'DB2'              TO   ERR-TIPO-ACESSO
               MOVE '%Var2Db2Tabela%'   TO   ERR-DBD-TAB
               MOVE 'SELECT'           TO   ERR-FUN-COMANDO
               MOVE  SQLCODE           TO   ERR-SQL-CODE
               MOVE '0010'             TO   ERR-LOCAL
               MOVE  SPACES            TO   ERR-SEGM
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[DB2 SELECT...DISTINCT | ]
           EXEC SQL
                SELECT  DISTINCT COL1
                  FROM  DB2PRD.%Var2Db2Tabela%
                 WHERE  COL2  =  :%Var1Db2Dclgen%.COL2
                   AND  COL3  =  :%Var1Db2Dclgen%.COL3
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS AND +100) OR
              (SQLWARN0                EQUAL     'W')
               MOVE 'DB2'              TO   ERR-TIPO-ACESSO
               MOVE '%Var2Db2Tabela%'   TO   ERR-DBD-TAB
               MOVE 'SELECT'           TO   ERR-FUN-COMANDO
               MOVE  SQLCODE           TO   ERR-SQL-CODE
               MOVE '0010'             TO   ERR-LOCAL
               MOVE  SPACES            TO   ERR-SEGM
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[DB2 SELECT...SUM | ]
       01  WRK-SUM                     PIC S9(009) COMP    VALUE ZEROS.

           EXEC SQL
                SELECT  VALUE (SUM(COL1), 0)
                  INTO :WRK-SUM
                  FROM  DB2PRD.%Var2Db2Tabela%
                 WHERE  COL1  =  :%Var1Db2Dclgen%.COL1
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS AND -305) OR
              (SQLWARN0                EQUAL     'W')
               MOVE 'DB2'              TO   ERR-TIPO-ACESSO
               MOVE '%Var2Db2Tabela%'   TO   ERR-DBD-TAB
               MOVE 'SELECT'           TO   ERR-FUN-COMANDO
               MOVE  SQLCODE           TO   ERR-SQL-CODE
               MOVE '0010'             TO   ERR-LOCAL
               MOVE  SPACES            TO   ERR-SEGM
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[DB2 SELECT...MAX | ]
           EXEC SQL
                SELECT  MAX(COL1)
                  INTO :%Var1Db2Dclgen%.COL1
                  FROM  DB2PRD.%Var2Db2Tabela%
                 WHERE  COL1  =  :%Var1Db2Dclgen%.COL1
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS AND -305) OR
              (SQLWARN0                EQUAL     'W')
               MOVE 'DB2'              TO   ERR-TIPO-ACESSO
               MOVE '%Var2Db2Tabela%'   TO   ERR-DBD-TAB
               MOVE 'SELECT'           TO   ERR-FUN-COMANDO
               MOVE  SQLCODE           TO   ERR-SQL-CODE
               MOVE '0010'             TO   ERR-LOCAL
               MOVE  SPACES            TO   ERR-SEGM
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[DB2 SELECT...MAX +1 | ]
           EXEC SQL
                SELECT  MAX(COL1) + 1
                  INTO :%Var1Db2Dclgen%.COL1
                  FROM  DB2PRD.%Var2Db2Tabela%
                 WHERE  COL1  =  :%Var1Db2Dclgen%.COL1
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS AND -305) OR
              (SQLWARN0                EQUAL     'W')
               MOVE 'DB2'              TO   ERR-TIPO-ACESSO
               MOVE '%Var2Db2Tabela%'   TO   ERR-DBD-TAB
               MOVE 'SELECT'           TO   ERR-FUN-COMANDO
               MOVE  SQLCODE           TO   ERR-SQL-CODE
               MOVE '0010'             TO   ERR-LOCAL
               MOVE  SPACES            TO   ERR-SEGM
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[DB2 SELECT...MIN | ]
           EXEC SQL
                SELECT  MIN(COL1)
                  INTO :%Var1Db2Dclgen%.COL1
                  FROM  DB2PRD.%Var2Db2Tabela%
                 WHERE  COL1  =  :%Var1Db2Dclgen%.COL1
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS AND -305) OR
              (SQLWARN0                EQUAL     'W')
               MOVE 'DB2'              TO   ERR-TIPO-ACESSO
               MOVE '%Var2Db2Tabela%'   TO   ERR-DBD-TAB
               MOVE 'SELECT'           TO   ERR-FUN-COMANDO
               MOVE  SQLCODE           TO   ERR-SQL-CODE
               MOVE '0010'             TO   ERR-LOCAL
               MOVE  SPACES            TO   ERR-SEGM
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
;*----------------------------------------------------------------*
;            *** AREA DE COMANDOS CICS  ******
;*----------------------------------------------------------------*

[CICS STARTBR | ]
           EXEC CICS
                STARTBR
                FILE   ('%Var1CicsArquivo%')
                RIDFLD (%Var3CicsChave%)
                %Var4CicsStart%
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL) AND
              (EIBRESP                 NOT EQUAL DFHRESP(NOTFND)
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS READNEXT | ]
;
           EXEC CICS
                READNEXT
                FILE    ('%Var1CicsArquivo%')
                INTO    (%Var2CicsAreaArquivo%)
                RIDFLD  (%Var3CicsChave%)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))  AND
              (EIBRESP                 NOT EQUAL DFHRESP(ENDFILE))
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS READPREV | ]
;
           EXEC CICS
                READPREV
                FILE    ('%Var1CicsArquivo%')
                INTO    (%Var2CicsAreaArquivo%)
                RIDFLD  (%Var3CicsChave%)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))  AND
              (EIBRESP                 NOT EQUAL DFHRESP(ENDFILE))
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS ENDBR | ]
;
           EXEC CICS
                ENDBR
                FILE    ('%Var1CicsArquivo%')
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS READ | ]
;
           EXEC CICS
                READ
                FILE    ('%Var1CicsArquivo%')
                INTO    (%Var2CicsAreaArquivo%)
                RIDFLD  (%Var3CicsChave%)
                LENGTH  (LENGTH OF %Var2CicsAreaArquivo%)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))  AND
              (EIBRESP                 NOT EQUAL DFHRESP(NOTFND))
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS READ...UPDATE | ]
;
           EXEC CICS
                READ
                FILE    ('%Var1CicsArquivo%')
                INTO    (%Var2CicsAreaArquivo%)
                RIDFLD  (%Var3CicsChave%)
                LENGTH  (LENGTH OF %Var2CicsAreaArquivo%)
                UPDATE
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))  AND
              (EIBRESP                 NOT EQUAL DFHRESP(NOTFND))
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS WRITE | ]
;
           EXEC CICS
                WRITE
                FILE    ('%Var1CicsArquivo%')
                FROM    (%Var2CicsAreaArquivo%)
                RIDFLD  (%Var3CicsChave%)
                NOHANDLE
           END-EXEC

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS REWRITE | ]
;
      * DEVE SER PRECEDIDO POR 'READ' COM CLAUSULA 'UPDATE'

           EXEC CICS
                REWRITE
                FILE    ('%Var1CicsArquivo%')
                FROM    (%Var2CicsAreaArquivo%)
                LENGTH  (LENGTH OF %Var2CicsAreaArquivo%)
                NOHANDLE
           END-EXEC

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS DELETE | ]
;
           EXEC CICS
                DELETE
                FILE      ('%Var1CicsArquivo%')
                RIDFLD    (%Var3CicsChave%)
                KEYLENGTH (LENGTH OF %Var3CicsChave%)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS LINK | ]
           EXEC CICS
                LINK
                PROGRAM   ('%Var0CicsPrograma%')
                COMMAREA  (%Var2CicsCommarea%)
                LENGTH    (LENGTH OF %Var2CicsCommarea%)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS XCTL | ]
           EXEC CICS
                XCTL
                PROGRAM   ('%Var0CicsPrograma%')
                COMMAREA  (%Var2CicsCommarea%)
                LENGTH    (LENGTH OF %Var2CicsCommarea%)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS RECEIVE MAP | ]
           EXEC CICS
                RECEIVE
                MAP      ('%Var5CicsMapa%')
                MAPSET   ('%Var6CicsMapset%')
                INTO     (%Var5CicsMapa%I)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL) AND
              (EIBRESP                 NOT EQUAL DFHRESP(MAPFAIL)
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS SEND MAP | ]
           EXEC CICS
                SEND
                MAP     ('%Var5CicsMapa%')
                MAPSET  ('%Var6CicsMapset%')
                FROM    (%Var5CicsMapa%O)
                CURSOR
                FREEKB
                ERASE
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))  AND
              (EIBRESP                 NOT EQUAL DFHRESP(MAPFAIL))
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS RETRIEVE | ]
           EXEC CICS
                RETRIEVE
                INTO     (%Var2CicsCommarea%)
                LENGTH   (LENGTH OF %Var2CicsCommarea%)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS START TRANSID| ]
           EXEC CICS
                START
                TRANSID  ('%Var1CicsTran%')
                FROM     (%Var2CicsCommarea%)
                LENGTH   (LENGTH OF %Var2CicsCommarea%)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS RETURN TRANSID | ]
           EXEC CICS
                RETURN
                TRANSID  ('%Var1CicsTran%')
                COMMAREA (%Var2CicsCommarea%)
                LENGTH   (LENGTH OF %Var2CicsCommarea%)
           END-EXEC.
;
[CICS RETURN | ]
           EXEC CICS
                RETURN
           END-EXEC.
;
[CICS ASKTIME | ]
       77  WRK-ABS                     PIC S9(015) COMP-3  VALUE ZEROS.

           EXEC CICS
                ASKTIME
                ABSTIME   (WRK-ABS)
                NOHANDLE
           END-EXEC.
;
[CICS FORMATTIME | ]
       77  WRK-ABS                     PIC S9(015) COMP-3  VALUE ZEROS.
       77  WRK-DATA                    PIC  X(010)         VALUE SPACES.
       77  WRK-HORA                    PIC  X(008)         VALUE SPACES.

           EXEC CICS
                FORMATTIME
                ABSTIME   (WRK-ABS)
                DATESEP
                DDMMYYYY  (WRK-DATA)
                TIMESEP
                TIME      (WRK-HORA)
                NOHANDLE
           END-EXEC.
;
[CICS ASSIGN | ]
       77  WRK-STARTCODE               PIC  X(002)         VALUE SPACES.
       77  WRK-APPLID                  PIC  X(008)         VALUE SPACES.

           EXEC CICS
                ASSIGN
                STARTCODE (WRK-STARTCODE)
                APPLID    (WRK-APPLID)
           END-EXEC.
;
[CICS BIF DEEDIT | ]
           EXEC CICS
                BIF DEEDIT
                FIELD    (WRK-CAMPO-X)
                LENGTH   (LENGTH OF WRK-CAMPO-X)
           END-EXEC.
;
[CICS DELETEQ TS | ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA TS                                 ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-NOME-TS.
           05 WRK-TRAN                 PIC  X(004)         VALUE SPACES.
           05 WRK-TERM                 PIC  X(004)         VALUE SPACES.

      *----NOME DA TS EH FORMADO PELO NOME DA TRANSACAO E TERMINAL   *
           MOVE 'TRAN'                 TO   WRK-TRAN.
           MOVE EIBTRMID               TO   WRK-TERM.

           EXEC CICS
                DELETEQ TS
                QUEUE     (WRK-NOME-TS)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL) AND
              (EIBRESP                 NOT EQUAL DFHRESP(QIDERR)
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS READQ TS | ]
;
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA TS                                 ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  IND-1                       PIC S9(004) COMP    VALUE ZEROS.

       01  WRK-NOME-TS.
           05 WRK-TRAN                 PIC  X(004)         VALUE SPACES.
           05 WRK-TERM                 PIC  X(004)         VALUE SPACES.

      *----NOME DA TS EH FORMADO PELO NOME DA TRANSACAO E TERMINAL   *
           MOVE 'TRAN'                 TO   WRK-TRAN.
           MOVE EIBTRMID               TO   WRK-TERM.

           EXEC CICS
                READQ TS
                QUEUE   (WRK-NOME-TS)
                INTO    (WRK-AREA-TS)
                LENGTH  (LENGTH OF WRK-AREA-TS)
                ITEM    (IND-1)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL) AND
              (EIBRESP                 NOT EQUAL DFHRESP(ITEMERR)
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS WRITEQ TS | ]
;
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA TS                                 ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  IND-1                       PIC S9(004) COMP    VALUE ZEROS.

       01  WRK-NOME-TS.
           05 WRK-TRAN                 PIC  X(004)         VALUE SPACES.
           05 WRK-TERM                 PIC  X(004)         VALUE SPACES.

      *----NOME DA TS EH FORMADO PELO NOME DA TRANSACAO E TERMINAL   *
           MOVE 'TRAN'                 TO   WRK-TRAN.
           MOVE EIBTRMID               TO   WRK-TERM.

           EXEC CICS
                WRITEQ TS
                QUEUE    (WRK-NOME-TS)
                FROM     (WRK-AREA-TS)
                LENGTH   (LENGTH OF WRK-AREA-TS)
                ITEM     (IND-1)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))
               PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[CICS SYNCPOINT ROLLBACK | ]
           EXEC CICS
                SYNCPOINT ROLLBACK
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))
               CONTINUE
           END-IF.
;
;*----------------------------------------------------------------*
;                *** AREA DE MODULOS CORPORATIVOS ***
;*----------------------------------------------------------------*
[BRAD0015 | CALCULA A DIFERENÇA ENTRE DUAS DATAS (COM SÉCULO) ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD0015                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *----DATAS FORMATO DDMMAAAA
       01  WRK-BRAD0015.
           05 WRK-0015-DATA-INFERIOR   PIC  9(008)         VALUE ZEROS.
           05 WRK-0015-DATA-SUPERIOR   PIC  9(008)         VALUE ZEROS.
           05 WRK-0015-DIAS            PIC S9(005) COMP-3  VALUE ZEROS.

           CALL 'BRAD0015'             USING     WRK-0015-DATA-INFERIOR
                                                 WRK-0015-DATA-SUPERIOR
                                                 WRK-0015-DIAS.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD0015'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE 'ERRO BRAD0015'    TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD0025 | SOMA OU SUBTRAI DIAS EM UMA DATA (COM SÉCULO) ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD0025                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *----DATAS FORMATO TANTO DDMMAAAA QUANTO AAAAMMDD
       01  WRK-BRAD0025.
           05 WRK-0025-DATA-ABERTURA   PIC  9(008)         VALUE ZEROS.
           05 WRK-0025-PRAZO           PIC S9(005)         VALUE ZEROS.
           05 WRK-0025-DATA-VENCIMENTO PIC  9(008)         VALUE ZEROS.

           CALL 'BRAD0025'             USING WRK-0025-DATA-ABERTURA
                                             WRK-0025-PRAZO
                                             WRK-0025-DATA-VENCIMENTO.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD0025'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE 'ERRO BRAD0025'    TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD0070 | TRANSFORMA VALORES NUMÉRICOS EM VALORES POR EXTENSO ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD0070                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD0070.
           05 WRK-NUMERICO             PIC  9(009)V99      VALUE ZEROS.
           05 WRK-NUMERICO-TAM         PIC  9(005) COMP-3  VALUE 11.
           05 WRK-EXTENSO              PIC  X(180)         VALUE SPACES.
           05 WRK-EXTENSO-TAM          PIC  9(005) COMP-3  VALUE 180.

           CALL 'BRAD0070'             USING     WRK-NUMERICO
                                                 WRK-NUMERICO-TAM
                                                 WRK-EXTENSO
                                                 WRK-EXTENSO-TAM.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD0070'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE 'ERRO BRAD0070'    TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD0110 | CALCULA O CONTROLE DO CPF/CNPJ ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD0110                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD0110.
           05 WRK-0110-CPF-CNPJ.
              10 WRK-0110-NUMERO       PIC  9(009)         VALUE ZEROS.
              10 WRK-0110-FILIAL       PIC  9(005)         VALUE ZEROS.
           05 WRK-0110-CONTROLE        PIC  X(002)         VALUE SPACES.

           CALL 'BRAD0110'             USING     WRK-0110-CPF-CNPJ
                                                 WRK-0110-CONTROLE.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD0110'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE 'ERRO BRAD0110'    TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD0175 | FORNECE "DSNAME", "JOBNAME" E "STEPNAME"  ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA BRAD0175                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD0175.
           05 WRK-0175-DDNAME          PIC  X(008)         VALUE
              'MESTRE'.
           05 WRK-0175-DSNAME          PIC  X(044)         VALUE SPACES.
           05 WRK-0175-JOBNAME         PIC  X(008)         VALUE SPACES.
           05 WRK-0175-STEPNAME        PIC  X(008)         VALUE SPACES.
           05 WRK-0175-MSG             PIC  X(040)         VALUE SPACES.

           CALL 'BRAD0175'             USING     WRK-0175-DDNAME
                                                 WRK-0175-DSNAME
                                                 WRK-0175-JOBNAME
                                                 WRK-0175-STEPNAME
                                                 WRK-0175-MSG.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD0175'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE 'WRK-0175-MSG'     TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD0430 | CALCULAR DÍGITO DE CONTA USANDO O MÓDULO 11 (ATÉ 15) ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA BRAD0430                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD0430.
           05 WRK-0430-AGENCIA         PIC  9(015)         VALUE ZEROS.
           05 WRK-0430-DIGITO          PIC  X(001)         VALUE SPACES.

           CALL 'BRAD0430'             USING     WRK-0430-AGENCIA
                                                 WRK-0430-DIGITO.

           IF RETURN-CODE              NOT EQUAL ZEROS
              MOVE 'APL'               TO   ERR-TIPO-ACESSO
              MOVE 'BRAD0430'          TO   ERR-SEGM
              MOVE RETURN-CODE         TO   ERR-STA-CODE
              MOVE 'ERRO BRAD0430'     TO   ERR-TEXTO
      *       PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD0431 | CALCULAR DÍGITO USANDO O MÓDULO 11 (ATÉ 30) ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA BRAD0431                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD0431.
           05 WRK-0431-VALOR           PIC  X(030)         VALUE SPACES.
           05 WRK-0431-DIGITO          PIC  X(001)         VALUE SPACES.
           05 WRK-0431-TAMANHO         PIC  9(002)         VALUE ZEROS.

           CALL 'BRAD0431'             USING     WRK-0431-VALOR
                                                 WRK-0431-DIGITO
                                                 WRK-0431-TAMANHO.

           IF WRK-0431-DIGITO          EQUAL     '.'
              MOVE 'APL'               TO   ERR-TIPO-ACESSO
              MOVE 'BRAD0431'          TO   ERR-SEGM
              MOVE RETURN-CODE         TO   ERR-STA-CODE
              MOVE 'ERRO BRAD0431'     TO   ERR-TEXTO
      *       PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD0432 | CALCULA O DÍGITO USANDO O MODULO 10 ATÉ(15) ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA BRAD0432                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD0432.
           05 WRK-0432-CONTA           PIC  X(015)         VALUE SPACES.
           05 WRK-0432-DIGITO          PIC  X(001)         VALUE SPACES.
           05 WRK-0432-TAMANHO         PIC  9(002)         VALUE ZEROS.

           CALL 'BRAD0432'             USING     WRK-0432-CONTA
                                                 WRK-0432-DIGITO
                                                 WRK-0432-TAMANHO.

           IF WRK-0432-DIGITO          EQUAL     '.'
              MOVE 'APL'               TO   ERR-TIPO-ACESSO
              MOVE 'BRAD0432'          TO   ERR-SEGM
              MOVE RETURN-CODE         TO   ERR-STA-CODE
              MOVE 'ERRO BRAD0432'     TO   ERR-TEXTO
      *       PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD0433 | CALCULA O DÍGITO USANDO O MODULO 11(CÓDIGO DE BARRA) ]
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA BRAD0433                           ***'.
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*

       01  WRK-BRAD0433.
           05 WRK-0433-VALOR           PIC  X(030)         VALUE SPACES.
           05 WRK-0433-DIGITO          PIC  X(001)         VALUE SPACES.
           05 WRK-0433-TAMANHO         PIC  9(002)         VALUE ZEROS.

           CALL 'BRAD0433'             USING     WRK-0433-VALOR
                                                 WRK-0433-DIGITO
                                                 WRK-0433-TAMANHO.

           IF WRK-0433-DIGITO          EQUAL     '.'
              MOVE 'APL'               TO   ERR-TIPO-ACESSO
              MOVE 'BRAD0433'          TO   ERR-SEGM
              MOVE RETURN-CODE         TO   ERR-STA-CODE
              MOVE 'ERRO BRAD0433'     TO   ERR-TEXTO
      *       PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD0434 | CALCULA O DÍGITO USANDO O MODULO 10 (ATÉ 15) ]
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA BRAD0434                           ***'.
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*

       01  WRK-BRAD0434.
           05 WRK-0434-VALOR           PIC  X(030)         VALUE SPACES.
           05 WRK-0434-DIGITO          PIC  X(001)         VALUE SPACES.
           05 WRK-0434-TAMANHO         PIC  9(002)         VALUE ZEROS.

           CALL 'BRAD0434'             USING     WRK-0434-VALOR
                                                 WRK-0434-DIGITO
                                                 WRK-0434-TAMANHO.

           IF WRK-0434-DIGITO          EQUAL     '.'
              MOVE 'APL'               TO   ERR-TIPO-ACESSO
              MOVE 'BRAD0434'          TO   ERR-SEGM
              MOVE RETURN-CODE         TO   ERR-STA-CODE
              MOVE 'ERRO BRAD0434'     TO   ERR-TEXTO
      *       PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD0435 | CALCULA O DÍGITO USANDO O MODULO 10 E MULTIPLICA DE 2 A 15 (ATÉ 30)]
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA BRAD0435                           ***'.
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*

       01  WRK-BRAD0435.
           05 WRK-0435-VALOR           PIC  X(030)         VALUE SPACES.
           05 WRK-0435-DIGITO          PIC  X(001)         VALUE SPACES.
           05 WRK-0435-TAMANHO         PIC  9(002)         VALUE ZEROS.
           05 WRK-0435-MENSAGEM.
              10 WRK-0435-COD-MSG      PIC  9(003)         VALUE ZEROS.
              10 FILLER                PIC  X(001)         VALUE SPACES.
              10 WRK-0435-TXT-MSG      PIC  X(079)         VALUE SPACES.

           CALL 'BRAD0435'             USING     WRK-0435-VALOR
                                                 WRK-0435-DIGITO
                                                 WRK-0435-TAMANHO
                                                 WRK-0435-MENSAGEM.

           IF WRK-0435-DIGITO          EQUAL     '.'
              MOVE 'APL'               TO   ERR-TIPO-ACESSO
              MOVE 'BRAD0435'          TO   ERR-SEGM
              MOVE RETURN-CODE         TO   ERR-STA-CODE
              MOVE 'ERRO BRAD0435'     TO   ERR-TEXTO
      *       PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD0480 | CRIAR E PESQUISAR TABELAS ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD0480                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD0480.
           05 WRK-0480-FUNCAO          PIC  9(001)         VALUE ZEROS.
              88 WRK-0480-MONTAR-TAB                       VALUE 1.
              88 WRK-0480-CONCLUIR-TAB                     VALUE 2.
              88 WRK-0480-PESQUISAR-TAB                    VALUE 3.
           05 WRK-0480-NOME-TAB        PIC  X(008)         VALUE SPACES.
           05 WRK-0480-TAM-CHAVE       PIC  9(002)         VALUE ZEROS.
           05 WRK-0480-TAM-OCORR       PIC  9(003)         VALUE ZEROS.

       01  WRK-AREA-PESQUISA.
           05 WRK-CHAVE-PESQUISA       PIC  9(003)         VALUE ZEROS.
           05 WRK-NOME-PESQUISA        PIC  X(030)         VALUE SPACES.

      *---PROCEDURE DIVISION

           PERFORM 1000-MONTAR-TABELA  UNTIL FIM-ARQ-ENTRADA.

           PERFORM 2000-CONCLUIR-MONTAGEM-TABELA.

           PERFORM 3000-PESQUISAR-TABELA.

      *----------------------------------------------------------------*
       1000-MONTAR-TABELA              SECTION.
      *----------------------------------------------------------------*

           MOVE ARQ-ENTRADA-CHAVE      TO   WRK-CHAVE-PESQUISA.
           MOVE ARQ-ENTRADA-NOME       TO   WRK-NOME-PESQUISA.

           SET WRK-0480-MONTAR-TAB     TO   TRUE.
           MOVE 'XXXXXXXX'             TO   WRK-0480-NOME-TAB.
           MOVE 03                     TO   WRK-0480-TAM-CHAVE.
           MOVE 33                     TO   WRK-0480-TAM-OCORR.

           CALL 'BRAD0480'             USING     WRK-0480-FUNCAO
                                                 WRK-0480-NOME-TAB
                                                 WRK-0480-TAM-CHAVE
                                                 WRK-0480-TAM-OCORR
                                                 WRK-AREA-PESQUISA.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD0480'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE 'ERRO BRAD0480'    TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       1000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2000-CONCLUIR-MONTAGEM-TABELA   SECTION.
      *----------------------------------------------------------------*

           SET WRK-0480-CONCLUIR-TAB   TO   TRUE.
           MOVE 'XXXXXXXX'             TO   WRK-0480-NOME-TAB.

           CALL 'BRAD0480'             USING     WRK-0480-FUNCAO
                                                 WRK-0480-NOME-TAB.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD0480'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE 'ERRO BRAD0480'    TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       2000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3000-PESQUISAR-TABELA           SECTION.
      *----------------------------------------------------------------*

           MOVE ARQ2-CHAVE-PESQUISA    TO   WRK-CHAVE-PESQUISA.

           SET WRK-0480-PESQUISAR-TAB  TO   TRUE.
           MOVE 'XXXXXXXX'             TO   WRK-0480-NOME-TAB.

           CALL 'BRAD0480'             USING     WRK-0480-FUNCAO
                                                 WRK-0480-NOME-TAB
                                                 WRK-CHAVE-PESQUISA
                                                 WRK-AREA-PESQUISA.

           IF (RETURN-CODE             NOT EQUAL ZEROS AND 12)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD0480'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE 'ERRO BRAD0480'    TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           ELSE
               IF (RETURN-CODE         EQUAL     12)
                   DISPLAY 'CHAVE NAO ENCONTRADA'
               END-IF
           END-IF.

      *----------------------------------------------------------------*
       3000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
;
[BRAD0436 | CALCULA O DÍGITO USANDO O MODULO 10 (ATÉ 43) ]
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA BRAD0436                           ***'.
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*

       01  WRK-BRAD0436.
           05 WRK-0436-VALOR           PIC  X(043)         VALUE SPACES.
           05 WRK-0436-DIGITO          PIC  X(001)         VALUE SPACES.
           05 WRK-0436-TAMANHO         PIC  9(002)         VALUE ZEROS.

           CALL 'BRAD0436'             USING     WRK-0436-VALOR
                                                 WRK-0436-DIGITO
                                                 WRK-0436-TAMANHO.

           IF (WRK-0436-DIGITO         EQUAL     '.')
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD0436'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE 'ERRO BRAD0436'    TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD0496 | CONSISTE VALORES EDITADOS COM OU SEM CASAS DECIMAIS ]
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
       01  FILLER                      PIC  X(050)         VALUE
           '* AREA DA BRAD0496                             ***'.
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*

       01  WRK-BRAD0496.
           05 WRK-0496-ENTRADA         PIC  X(013)         VALUE SPACES.
           05 WRK-0496-SAIDA           PIC  X(010)         VALUE SPACES.
           05 WRK-0496-TAMANHO.
              10 WRK-0496-ENTRA        PIC  9(002)         VALUE ZEROS.
              10 WRK-0496-SAI          PIC  9(002)         VALUE ZEROS.
              10 WRK-0496-INTEIRO      PIC  9(002)         VALUE ZEROS.
              10 WRK-0496-DECIMAL      PIC  9(002)         VALUE ZEROS.
           05 WRK-0496-TAMANHO-R       REDEFINES WRK-0496-TAMANHO
                                       PIC  9(008).

           CALL 'BRAD0496'             USING     WRK-0496-ENTRADA
                                                 WRK-0496-SAIDA
                                                 WRK-0496-TAMANHO-R.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD0496'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE 'ERRO BRAD0496'    TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD0497 | CONSISTE VALORES EDITADOS E ACEITA VALORES NEGATIVOS ]
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
       01  FILLER                      PIC  X(050)         VALUE
           '* AREA DA BRAD0497                             ***'.
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*

       01  WRK-BRAD0497.
           05 WRK-0497-ENTRADA         PIC  X(013)         VALUE SPACES.
           05 WRK-0497-SAIDA           PIC  X(010)         VALUE SPACES.
           05 WRK-0497-TAMANHO.
              10 WRK-0497-ENTRA        PIC  9(002)         VALUE ZEROS.
              10 WRK-0497-SAI          PIC  9(002)         VALUE ZEROS.
              10 WRK-0497-INTEIRO      PIC  9(002)         VALUE ZEROS.
              10 WRK-0497-DECIMAL      PIC  9(002)         VALUE ZEROS.
           05 WRK-0497-TAMANHO-R       REDEFINES WRK-0497-TAMANHO
                                       PIC  9(008).

           CALL 'BRAD0497'             USING     WRK-0497-ENTRADA
                                                 WRK-0497-SAIDA
                                                 WRK-0497-TAMANHO-R.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD0497'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE 'ERRO BRAD0497'    TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD0560 | FORNECE 'JOBNAME' E 'JOBNUMBER' DO PROGRAMA ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA BRAD0560                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD0560.
           05 WRK-0560-JOBNAME         PIC  X(008)         VALUE SPACES.
           05 WRK-0560-JOBNUMBER       PIC  9(005)         VALUE ZEROS.

           CALL 'BRAD0560'             USING     WRK-0560-JOBNAME
                                                 WRK-0560-JOBNUMBER.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD0560'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE 'ERRO BRAD0560'    TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD1050 | CONEXÃO COM DB2 ]
           CALL 'BRAD1050'.
;
[BRAD1205 | FORNECE INFORMACOES SEMELHANTES A "FERI1010" (COM SÉCULO) ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD1205                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD1205.
           05 WRK-1205-LISTA-CAMPOS.
              10 WRK-1205-DT-ENVIADA   PIC  9(008) COMP-3  VALUE ZEROS.
              10 WRK-1205-OPCAO        PIC  X(001)         VALUE SPACES.
              10 WRK-1205-DT-JULIANA   PIC  9(007) COMP-3  VALUE ZEROS.
              10 WRK-1205-DT-EDITADA   PIC  X(010)         VALUE SPACES.
              10 WRK-1205-DT-GREGORI   PIC  9(008)         VALUE ZEROS.
              10 WRK-1205-DIA-SEMANA   PIC  X(013)         VALUE SPACES.
              10 WRK-1205-MES-EXTENSO  PIC  X(009)         VALUE SPACES.
              10 WRK-1205-DIA-UT-ANTER PIC  9(008)         VALUE ZEROS.
              10 WRK-1205-DIA-UT-POSTE PIC  9(008)         VALUE ZEROS.
           05 WRK-1205-MENSAGEM        PIC  X(050)         VALUE SPACES.

           CALL 'BRAD1205'             USING     WRK-1205-LISTA-CAMPOS
                                                 WRK-1205-MENSAGEM.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD1205'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE WRK-1205-MENSAGEM  TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD1210 | TRANSFORMA DATA GREGORIANA EM DATA JULIANA (COM SÉCULO) ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD1210                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD1210.
           05 WRK-1210-DATA-GREGORIANA PIC  9(008) COMP-3  VALUE ZEROS.
           05 WRK-1210-DATA-JULIANA    PIC  9(007) COMP-3  VALUE ZEROS.
           05 WRK-1210-MENSAGEM        PIC  X(050)         VALUE SPACES.

           CALL 'BRAD1210'             USING WRK-1210-DATA-GREGORIANA
                                             WRK-1210-DATA-JULIANA
                                             WRK-1210-MENSAGEM.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD1210'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE WRK-1210-MENSAGEM  TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD1215 | TRANSFORMA DATA JULIANA EM DATA GREGORIANA (COM SÉCULO) ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD1215                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD1215.
           05 WRK-1215-DATA-JULIANA    PIC  9(007) COMP-3  VALUE ZEROS.
           05 WRK-1215-DATA-GREGORIANA PIC  9(008) COMP-3  VALUE ZEROS.
           05 WRK-1215-MENSAGEM        PIC  X(050)         VALUE SPACES.

           CALL 'BRAD1215'             USING WRK-1215-DATA-JULIANA
                                             WRK-1215-DATA-GREGORIANA
                                             WRK-1215-MENSAGEM.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD1215'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE WRK-1215-MENSAGEM  TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD1280 | CALCULA O NÚMERO DE DIAS ÚTEIS ENTRE DUAS DATAS (COM SÉCULO) ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD1280                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD1280.
           05 WRK-1280-DATA-INFERIOR   PIC  9(008) COMP-3  VALUE ZEROS.
           05 WRK-1280-DATA-SUPERIOR   PIC  9(008) COMP-3  VALUE ZEROS.
           05 WRK-1280-DIAS            PIC S9(005) COMP-3  VALUE ZEROS.
           05 WRK-1280-MENSAGEM        PIC  X(050)         VALUE SPACES.

           CALL 'BRAD1280'             USING     WRK-1280-DATA-INFERIOR
                                                 WRK-1280-DATA-SUPERIOR
                                                 WRK-1280-DIAS
                                                 WRK-1280-MENSAGEM.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD1280'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE WRK-1280-MENSAGEM  TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD1285 | SOMA OU SUBTRAI DIAS ÚTEIS (COM SÉCULO) ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD1285                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD1285.
           05 WRK-1285-DATA-ENTRADA    PIC  9(008) COMP-3  VALUE ZEROS.
           05 WRK-1285-DIAS            PIC S9(005) COMP-3  VALUE ZEROS.
           05 WRK-1285-DATA-SAIDA      PIC  9(008) COMP-3  VALUE ZEROS.
           05 WRK-1285-MENSAGEM        PIC  X(050)         VALUE SPACES.

           CALL 'BRAD1285'             USING     WRK-BRAD1285.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD1285'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE WRK-1285-MENSAGEM  TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD1290 | RETORNA A DATA (ANO COM QUATRO DÍGITOS) ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD1290                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD1290.
           05 WRK-1290-VERSAO          PIC  X(006)         VALUE
              'VRS001'.
           05 WRK-1290-DATA-ENTRADA    PIC  9(006)         VALUE ZEROS.
           05 WRK-1290-DATA-SAIDA      PIC  9(008)         VALUE ZEROS.
           05 WRK-1290-MENSAGEM        PIC  X(050)         VALUE SPACES.

           CALL 'BRAD1290'             USING     WRK-BRAD1290.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD1290'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE WRK-1290-MENSAGEM  TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD1470 | CONSISTE DATAS (COM SÉCULO) ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD1470                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD1470.
           05 WRK-1470-DATA            PIC  9(008)         VALUE ZEROS.

           CALL 'BRAD1470'             USING     WRK-1470-DATA.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD1470'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE 'ERRO BRAD1470'    TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD1560 | CONVERSOR DE DATA ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD1560                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD1560.
           05 WRK-1560-FORMATO-ENTRADA PIC  9(002)         VALUE ZEROS.
           05 WRK-1560-FORMATO-SAIDA   PIC  9(002)         VALUE ZEROS.
           05 WRK-1560-DATA-ENTRADA    PIC  X(010)         VALUE SPACES.
           05 WRK-1560-DATA-SAIDA      PIC  X(010)         VALUE SPACES.
           05 WRK-1560-CRITERIO        PIC  9(002)         VALUE ZEROS.
           05 WRK-1560-ANO-BASE        PIC  9(002)         VALUE ZEROS.

           CALL 'BRAD1560'             USING WRK-1560-FORMATO-ENTRADA
                                             WRK-1560-FORMATO-SAIDA
                                             WRK-1560-DATA-ENTRADA
                                             WRK-1560-DATA-SAIDA
                                             WRK-1560-CRITERIO
                                             WRK-1560-ANO-BASE.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD1560'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE 'ERRO BRAD1560'    TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD1570 | CONSISTENCIA DE DATAS (COM SÉCULO) ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD1570                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD1570.
           05 WRK-1570-DATA-CONS       PIC  X(010)         VALUE SPACES.
           05 WRK-1570-FORMATO-DATA    PIC  9(002)         VALUE ZEROS.
           05 WRK-1570-MENSAGEM        PIC  X(080)         VALUE SPACES.

           CALL 'BRAD1570'             USING     WRK-1570-DATA-CONS
                                                 WRK-1570-FORMATO-DATA
                                                 WRK-1570-MENSAGEM.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD1570'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE WRK-1570-MENSAGEM  TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD1640 | EFETUA SOMA DE DIAS, MESES E ANOS EM DATA (COM SÉCULO) ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD1640                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-BRAD1640.
           05 WRK-1640-DATA-ENTRADA    PIC  X(010)         VALUE SPACES.
           05 WRK-1640-FORMATO-ENTRADA PIC  9(002)         VALUE ZEROS
           05 WRK-1640-TIPO-INCREMENTO PIC  X(002)         VALUE SPACES.
           05 WRK-1640-INCREMENTO      PIC  9(003)         VALUE ZEROS.
           05 WRK-1640-FORMATO-SAIDA   PIC  9(002)         VALUE ZEROS.
           05 WRK-1640-DATA-SAIDA      PIC  X(010)         VALUE SPACES.
           05 WRK-1640-MENSAGEM        PIC  X(080)         VALUE SPACES.

           CALL 'BRAD1640'             USING WRK-1640-DATA-ENTRADA
                                             WRK-1640-FORMATO-ENTRADA
                                             WRK-1640-TIPO-INCREMENTO
                                             WRK-1640-INCREMENTO
                                             WRK-1640-FORMATO-SAIDA
                                             WRK-1640-DATA-SAIDA
                                             WRK-1640-MENSAGEM.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD1640'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE WRK-1640-MENSAGEM  TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
[BRAD7100 | TRATAMENTO DE ERROS COM INTERRUPÇÃO DE PROCESSAMENTO  ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA BRAD7100                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BRAD7C'.

           IF (ERR-TIPO-ACESSO         EQUAL     'DB2')
               CALL 'BRAD7100'         USING     WRK-BATCH
                                                 ERRO-AREA
                                                 SQLCA
           ELSE
               CALL 'BRAD7100'         USING     WRK-BATCH
                                                 ERRO-AREA
           END-IF.
;
[BRAD7106 | TRATAMENTO DE ERROS SEM INTERRUPÇÃO DE PROCESSAMENTO  ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA BRAD7106                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BRAD7C'.

           IF (ERR-TIPO-ACESSO         EQUAL     'DB2')
               CALL 'BRAD7106'         USING     WRK-BATCH
                                                 ERRO-AREA
                                                 SQLCA
           ELSE
               CALL 'BRAD7106'         USING     WRK-BATCH
                                                 ERRO-AREA
           END-IF.
;
[BRAD7600 | FORNECE DATA E HORA ATUAL ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD7600                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-7600-DATA-HORA.
           05 WRK-7600-DT-JULIANA      PIC  9(005) COMP-3  VALUE ZEROS.
           05 WRK-7600-DT-AAMMDDD      PIC  9(007) COMP-3  VALUE ZEROS.
           05 WRK-7600-DT-AAAAMMDD     PIC  9(009) COMP-3  VALUE ZEROS.
           05 WRK-7600-DT-HHMMSS       PIC  9(007) COMP-3  VALUE ZEROS.
           05 WRK-7600-DT-HHMMSSSS     PIC  9(013) COMP-3  VALUE ZEROS.
           05 WRK-7600-TIMESTAMP.
              10 WRK-7600-ANO          PIC  9(004)         VALUE ZEROS.
              10 WRK-7600-MES          PIC  9(002)         VALUE ZEROS.
              10 WRK-7600-DIA          PIC  9(002)         VALUE ZEROS.
              10 WRK-7600-HORA         PIC  9(002)         VALUE ZEROS.
              10 WRK-7600-MINUTOS      PIC  9(002)         VALUE ZEROS.
              10 WRK-7600-SEGUNDOS     PIC  9(002)         VALUE ZEROS.
              10 WRK-7600-MICROSEG     PIC  9(006)         VALUE ZEROS.


           CALL 'BRAD7600'             USING     WRK-7600-DATA-HORA.

           IF (RETURN-CODE             NOT EQUAL ZEROS)
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE 'BRAD7600'         TO   ERR-SEGM
               MOVE RETURN-CODE        TO   ERR-STA-CODE
               MOVE 'ERRO BRAD7600'    TO   ERR-TEXTO
      *        PERFORM 9999-TRATAR-ERRO
           END-IF.
;
;*----------------------------------------------------------------*
;            *** AREA DE COMANDOS CABEÇALHOS PADRÕES ***
;*----------------------------------------------------------------*
[PADRAO CABEÇALHO Batch | ]
      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*

       PROGRAM-ID. %Var1PadraoPrograma%.
       AUTHOR.     XXXXXXXXXXXXXXXXXXXXXX.

      *================================================================*
      *                 P R I M E   I N F O R M A T I C A              *
      *----------------------------------------------------------------*
      *    PROGRAMA....:  %Var1PadraoPrograma%                                     *
      *    PROGRAMADOR.:  XXXXXXXXXXXXXXXXXXX               -  PRIME   *
      *    ANALISTA....:  XXXXXXXXXXXXXXXXXXX               -  PRIME   *
      *    DATA........:  %Var2PadraoData%                                   *
      *----------------------------------------------------------------*
      *    OBJETIVO....:  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX *
      *                   XXXXXXXXXXXXXXXXXX.                          *
      *----------------------------------------------------------------*
      *    BCO DE DADOS:                                               *
      *                TABLE                          INCLUDE/BOOK     *
      *                DB2PRD.XXXXXX_XXXXX_XXXXX        XXXXB000       *
      *----------------------------------------------------------------*
      *    ARQUIVOS....:                                               *
      *                DDNAME           I/O           INCLUDE/BOOK     *
      *                %VAR3MODELOARQENT1%          I              I#XXXXXX       *
      *                %VAR4MODELOARQENT2%          O                  -          *
      *----------------------------------------------------------------*
      *    BOOK'S......:                                               *
      *    I#BRAD7C - AREA PARA TRATAMENTO DE ERRO PELA BRAD7100       *
      *----------------------------------------------------------------*
      *    MODULOS.....:                                               *
      *    BRAD7100 - TRATAMENTO DE ERRO                               *
      *================================================================*
;
[PADRAO CABEÇALHO Cics | ]
      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*

       PROGRAM-ID. %Var1PadraoPrograma%.
       AUTHOR.     XXXXXXXXXXXXXXXXXXXXXX.

      *================================================================*
      *                 P R I M E   I N F O R M A T I C A              *
      *----------------------------------------------------------------*
      *    PROGRAMA....:  %Var1PadraoPrograma%                                     *
      *    MAPA........:  XXXXX   	                                    *
      *    TRANSACAO...:  XXXX    	                                    *
      *    PROGRAMADOR.:  XXXXXXXXXXXXXXXXXXX               -  PRIME   *
      *    ANALISTA....:  XXXXXXXXXXXXXXXXXXX               -  PRIME   *
      *    DATA........:  %Var2PadraoData%                                   *
      *----------------------------------------------------------------*
      *    OBJETIVO....:  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX *
      *                   XXXXXXXXXXXXXXXXXX.                          *
      *----------------------------------------------------------------*
      *    BCO DE DADOS:                                               *
      *                TABLE                          INCLUDE/BOOK     *
      *                DB2PRD.XXXXXX_XXXXX_XXXXX        XXXXB000       *
      *----------------------------------------------------------------*
      *    ARQUIVOS....:                                               *
      *                DDNAME           I/O           INCLUDE/BOOK     *
      *                %VAR3MODELOARQENT1%          I              I#XXXXXX       *
      *                %VAR4MODELOARQENT2%          O                  -          *
      *----------------------------------------------------------------*
      *    BOOK'S......:                                               *
      *    I#BRAD7C - AREA PARA TRATAMENTO DE ERRO PELA BRAD7100       *
      *----------------------------------------------------------------*
      *    MODULOS.....:                                               *
      *    BRAD7100 - TRATAMENTO DE ERRO                               *
      *----------------------------------------------------------------*
      *    NAVEGACAO...:                                               *
      *    CHAMADO POR.: XXXXXXXX           CHAMA ......: XXXXXXXX     *
      *                  XXXXXXXX                         XXXXXXXX     *
      *================================================================*
;
[PADRAO CABEÇALHO Mapa | ]
*=====================================================================*
*                   P R I M E  I N F O R M A T I C A                  *
*---------------------------------------------------------------------*
*    MAPA........:  XXXXXXX   	                                       *
*    PROGRAMA....:  XXXXXXX                                           *
*    PROGRAMADOR.:  XXXXXXXXXXXXXXXXXXX                     -  PRIME  *
*    ANALISTA....:  XXXXXXXXXXXXXXXXXXX                     -  PRIME  *
*    DATA........:  %Var2PadraoData%                                        *
*---------------------------------------------------------------------*
*    OBJETIVO....:  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  *
*=====================================================================*
;
[PADRAO CABEÇALHO Alteração | ]
%Var3PadraoRemark%*================================================================*
.     *                        A L T E R A C A O                       *
.     *----------------------------------------------------------------*
.     *    PROGRAMADOR.:  XXXXXXXXXXXXXXXXXXX               -  PRIME   *
.     *    ANALISTA....:  XXXXXXXXXXXXXXXXXXX               -  PRIME   *
.     *    DATA........:  %Var2PadraoData%                                   *
.     *----------------------------------------------------------------*
.     *    OBJETIVO....:  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  *
%Var3PadraoRemark%*================================================================*
;
[PADRAO CABEÇALHO WORKING-STORAGE | ]
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE AUXILIARES                         ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
;
[PADRAO Section | ]
      *----------------------------------------------------------------*
       %Var1NumSection%-%Var2NomeSection%              SECTION.
      *----------------------------------------------------------------*

           |

      *----------------------------------------------------------------*
       %Var1NumSection%-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
;
[PADRAO FILE DESCRIPTION | ]
      *----------------------------------------------------------------*
      *   %Var3FileEntradaSaida%:  DESCRICAO ARQUIVO                                   *
      *            ORG. SEQUENCIAL     -   LRECL   =  %Var2FileTamArquivo%             *
      *----------------------------------------------------------------*
       FD  %Var1FileNomeArquivo%
           RECORDING MODE IS F
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-%Var1FileNomeArquivo%                 PIC  X(%Var2FileTamArquivo%).
;
[MODELO TI Melhorias Coordenador Lista (Paginação) | ]
      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*

       PROGRAM-ID. |%Var1TIMelhoriasPrograma%.
       AUTHOR.     AUTOR.

      *================================================================*
      *                 P R I M E   I N F O R M A T I C A              *
      *----------------------------------------------------------------*
      *    PROGRAMA....:  %Var1TIMelhoriasPrograma%                                     *
      *    PROGRAMADOR.:  AUTOR                             -  PRIME   *
      *    ANALISTA....:  ANALISTA                          -  PRIME   *
      *    DATA........:  %Var2TIMelhoriasData%                                   *
      *----------------------------------------------------------------*
      *    OBJETIVO....:  COORDENADOR P/ LISTA DE XXXXXXXXXXXXXXXXXX   *
      *----------------------------------------------------------------*
      *    BOOK'S......:                                               *
      *    %Var3TIMelhoriasBookEntrada% - DADOS DE ENTRADA P/ ALTERAR/EXCLUIR/INCLUIR XXXX *
      *    %Var4TIMelhoriasBookSaida% - DADOS DE SAIDA P/ ALTERAR/EXCLUIR/INCLUIR XXXX   *
      *    %Var5TIMelhoriasBookFuncional% - DADOS DO FUNCIONAL P/ ALTERAR/EXCLUIR/INCLUIR XX *
      *    %Var6TIMelhoriasBookPaginacao% - DADOS P/ PAGINACAO (GAM)                          *
      *    %Var0TIMelhoriasSistema%W000 - DADOS DE CONTROLE                                *
      *    I#FRWKAQ - AREA COMUM PROG/FRWK                             *
      *    I#FRWK04 - COMUNICACAO COM GERENCIADOR DE AREA DE MEMORIA   *
      *    I#FRWK83 - DADOS DE SESSAO DO USUARIO                       *
      *    I#FRWKGE - TRATAMENTO DE ERROS - GERAL                      *
      *    I#FRWKMD - TRATAMENTO DE ERROS - MODULO                     *
      *    I#FRWKCI - TRATAMENTO DE ERROS - CICS                       *
      *    I#FRWKLI - TRATAMENTO DE ERROS - LIVRE                      *
      *----------------------------------------------------------------*
      *    MODULOS.....:                                               *
      *    %Var7TIMelhoriasProgramaFuncional% - FUNCIONAL P/ ALTERAR/EXCLUIR/INCLUIR XXXXXXXXXX  *
      *    FRWK1200 - GERENCIADOR DE AREA DE MEMORIA (GAM)             *
      *    FRWK1999 - GRAVACAO DE LOG DE ERROS                         *
      *================================================================*

      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*

       SPECIAL-NAMES.
           DECIMAL-POINT               IS   COMMA.

      *================================================================*
       DATA                            DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           'INICIO DA WORKING STORAGE SECTION'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           'VARIAVEIS AUXILIARES'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  WRK-PROGRAMA                PIC  X(008)         VALUE
           '%Var1TIMelhoriasPrograma%'.

       77  WRK-PARAGRAFO               PIC  X(030)         VALUE SPACES.

       77  IND-1                       PIC  9(003) COMP-3  VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA PARA DADOS DE ENTRADA'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ENTRADA.
           COPY %Var3TIMelhoriasBookEntrada%.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE SAIDA DO PROGRAMA'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-SAIDA.
           COPY %Var4TIMelhoriasBookSaida%.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA PARA DADOS DO GAM'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-PAGINACAO.
           COPY %Var6TIMelhoriasBookPaginacao%.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DO SERVICO FUNCIONAL'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-%Var7TIMelhoriasProgramaFuncional%                PIC  X(008)         VALUE
           '%Var7TIMelhoriasProgramaFuncional%'.

       01  WRK-AREA-FUNCIONAL.
           COPY %Var0TIMelhoriasSistema%W000.
           COPY %Var5TIMelhoriasBookFuncional%.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE PARA COMUNICACAO COM O GAM'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-FRWK1200                PIC  X(008)         VALUE
           'FRWK1200'.

       01  WRK-AREA-FRWK1200.
           COPY 'I#FRWK04'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE ACESSO PARA DADOS DA SESSAO'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-SESSAO.
           COPY 'I#FRWK83'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE COMUNICACAO DO PROGRAMA FRWK1999'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-FRWK1999                PIC  X(008)         VALUE
           'FRWK1999'.

       01  WRK-AREA-ERRO.
           COPY 'I#FRWKGE'.
           05  WRK-BLOCO-INFO-ERRO.
             10  WRK-CHAR-INFO-ERRO    PIC  X(001) OCCURS 0 TO 30000
                                       TIMES DEPENDING ON
                                       FRWKGHEA-TAM-DADOS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE TRATAMENTO DE ERRO - MODULO'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ERRO-MODULO.
           COPY 'I#FRWKMD'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE TRATAMENTO DE ERRO - LIVRE'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ERRO-LIVRE.
           COPY 'I#FRWKLI'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE TRATAMENTO DE ERRO - CICS'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ERRO-CICS.
           COPY 'I#FRWKCI'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'FIM DA WORKING STORAGE SECTION'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *================================================================*
       LINKAGE                         SECTION.
      *================================================================*

       01  DFHCOMMAREA.
           COPY 'I#FRWKAQ'.

      *================================================================*
       PROCEDURE                       DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       0000-PRINCIPAL                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 1000-INICIALIZAR.

           PERFORM 2000-PROCESSAR.

           PERFORM 3000-FINALIZAR.

      *----------------------------------------------------------------*
       0000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1000-INICIALIZAR                SECTION.
      *----------------------------------------------------------------*

           INITIALIZE FRWKGHEA-REGISTRO
                      FRWKGCIC-REGISTRO
                      FRWKGMOD-REGISTRO
                      FRWKGLIV-REGISTRO.

           PERFORM 1100-OBTER-DADOS-ENTRADA.

           PERFORM 1200-OBTER-DADOS-SESSAO.

           PERFORM 1300-CONSISTIR-DADOS-ENTRADA.

      *----------------------------------------------------------------*
       1000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1100-OBTER-DADOS-ENTRADA        SECTION.
      *----------------------------------------------------------------*

           MOVE '1100-OBTER-DADOS-ENTRADA' TO WRK-PARAGRAFO.

           SET FRWKEL04-FUN-CONSULTAR      TO TRUE.

           MOVE FRWKGLAQ-IDENT-AREA-GLOBAL TO FRWKEL04-IDENT-AREA-GLOBAL

           MOVE %Var3TIMelhoriasBookEntrada%-COD-LAYOUT        TO FRWKEL04-ID-BLOCO.
           MOVE %Var3TIMelhoriasBookEntrada%-TAM-LAYOUT        TO FRWKEL04-TAM-BLOCO.

           PERFORM 5000-ACESSAR-GAM.

           MOVE FRWKEL04-BUFFER(1:FRWKEL04-TAM-BLOCO)
                                           TO WRK-AREA-ENTRADA.

      *----------------------------------------------------------------*
       1100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * OBTEM DADOS DA SESSAO DO USUARIO                               *
      *----------------------------------------------------------------*
       1200-OBTER-DADOS-SESSAO         SECTION.
      *----------------------------------------------------------------*

           MOVE '1200-OBTER-DADOS-SESSAO'  TO WRK-PARAGRAFO.

           SET FRWKEL04-FUN-CONSULTAR      TO TRUE.

           MOVE FRWKGLAQ-IDENT-AREA-GLOBAL TO FRWKEL04-IDENT-AREA-GLOBAL

           MOVE FRWKEL83-COD-LAYOUT        TO FRWKEL04-ID-BLOCO.
           MOVE FRWKEL83-TAM-LAYOUT        TO FRWKEL04-TAM-BLOCO.

           PERFORM 5000-ACESSAR-GAM.

           MOVE FRWKEL04-BUFFER(1:FRWKEL04-TAM-BLOCO)
                                           TO FRWKEL83-REGISTRO.

      *----------------------------------------------------------------*
       1200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1300-CONSISTIR-DADOS-ENTRADA    SECTION.
      *----------------------------------------------------------------*

      *----USAR COMENTARIOS (EX. CODIGO DE FUNCAO 3 = EXCLUSAO)
           IF (%Var3TIMelhoriasBookEntrada%-E-CD-FUNCAO         NOT EQUAL 03)
               MOVE 08                      TO FRWKGLAQ-COD-RETORNO
               MOVE '0010'                  TO FRWKGLAQ-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO FRWKGLAQ-COD-MENSAGEM
               PERFORM 3000-FINALIZAR
           END-IF.

           IF (%Var3TIMelhoriasBookEntrada%-E-NU-COMPONENTE     NOT NUMERIC) OR
              (%Var3TIMelhoriasBookEntrada%-E-NU-COMPONENTE     EQUAL ZEROS)
               MOVE 08                      TO FRWKGLAQ-COD-RETORNO
               MOVE '0020'                  TO FRWKGLAQ-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO FRWKGLAQ-COD-MENSAGEM
               PERFORM 3000-FINALIZAR
           END-IF.

      *----------------------------------------------------------------*
       1300-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * VERIFICA SE NECESSITA OBTER CHAVES DE PAGINACAO NO GAM OU NAO  *
      * DE ACORDO COM SENTIDO DE PAGINA DA SESSAO                      *
      *----------------------------------------------------------------*
       2000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*

           MOVE '2000-PROCESSAR'       TO WRK-PARAGRAFO.

           EVALUATE TRUE

               WHEN FRWKEL83-CONSULTA-INICIAL
               WHEN FRWKEL83-PRIMEIRO-BLOCO
               WHEN FRWKEL83-ULTIMO-BLOCO
                   PERFORM 2100-CONSULTA-INICIAL

               WHEN FRWKEL83-BLOCO-SEGUINTE
               WHEN FRWKEL83-BLOCO-ANTERIOR
                   PERFORM 2200-PAGINAR

               WHEN OTHER
                   SET  ERRO-LIVRE     TO TRUE
                   MOVE 08             TO FRWKGLAQ-COD-RETORNO
                   MOVE '0030'         TO FRWKGLAQ-COD-ERRO
                   MOVE '%Var0TIMelhoriasSistema%0000'     TO FRWKGLAQ-COD-MENSAGEM
                   PERFORM 9998-TRATAR-ERRO

           END-EVALUATE.

           MOVE %Var0TIMelhoriasSistema%W000-COD-RETORNO   TO FRWKGLAQ-COD-RETORNO.
           MOVE %Var0TIMelhoriasSistema%W000-COD-ERRO      TO FRWKGLAQ-COD-ERRO.
           MOVE %Var0TIMelhoriasSistema%W000-COD-MENSAGEM  TO FRWKGLAQ-COD-MENSAGEM.

      *----------------------------------------------------------------*
       2000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *  CONSULTA SEM NECESSIDADE DE OBTER DADOS PARA PAGINACAO        *
      *----------------------------------------------------------------*
       2100-CONSULTA-INICIAL           SECTION.
      *----------------------------------------------------------------*

           PERFORM 2110-INFORMAR-SERV-FUNCIONAL.

           PERFORM 5100-ACESSAR-SERVICO-FUNCIONAL.

           PERFORM 2120-VALORIZAR-BLOCO-SAIDA.

           PERFORM 6100-GRAVAR-BLOCO-SAIDA.

      *----SE HA MAIS DADOS A LISTAR E FOR PRIMEIRA EXECUCAO
      *----CRIA BLOCO NO GAM, SENAO ATUALIZA BLOCO
           IF (%Var0TIMelhoriasSistema%W000-COD-RETORNO    EQUAL     01)
               IF (FRWKEL83-CONSULTA-INICIAL)
                   PERFORM 6200-CRIAR-GAM-PERSISTENTE
               ELSE
                   PERFORM 6300-ATUALIZAR-GAM-PERSISTENTE
               END-IF
           END-IF.

      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * VALORIZA AREA FUNCIONAL (SENTIDO PAGINA, QTD REGS E ENTRADA)   *
      *----------------------------------------------------------------*
       2110-INFORMAR-SERV-FUNCIONAL    SECTION.
      *----------------------------------------------------------------*

           INITIALIZE %Var0TIMelhoriasSistema%W000-BLOCO-RETORNO
                      %Var0TIMelhoriasSistema%W000-BLOCO-PARAMETRO
                      %Var5TIMelhoriasBookFuncional%-PAGINACAO
                      %Var5TIMelhoriasBookFuncional%-S-NUM-CONSULTAS.

           MOVE FRWKEL83-SOLIC-MAIS-DADOS  TO %Var5TIMelhoriasBookFuncional%-P-SENTIDO.

           MOVE 05                         TO %Var5TIMelhoriasBookFuncional%-S-NUM-CONSULTAS.

           MOVE %Var3TIMelhoriasBookEntrada%-ENTRADA           TO %Var5TIMelhoriasBookFuncional%-ENTRADA.

      *----------------------------------------------------------------*
       2110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *  PASSA DADOS OBTIDOS NO FUNCIONAL PARA SAIDA DO COORDENADOR    *
      *----------------------------------------------------------------*
       2120-VALORIZAR-BLOCO-SAIDA      SECTION.
      *----------------------------------------------------------------*

           MOVE %Var5TIMelhoriasBookFuncional%-S-NUM-CONSULTAS TO %Var4TIMelhoriasBookSaida%-S-NUM-CONSULTAS.

           PERFORM VARYING IND-1        FROM  01  BY  01
                     UNTIL IND-1        GREATER %Var4TIMelhoriasBookSaida%-S-NUM-CONSULTAS
               MOVE %Var5TIMelhoriasBookFuncional%-S-CESTRT-DIC(IND-1)
                                        TO %Var4TIMelhoriasBookSaida%-S-CESTRT-DIC(IND-1)
               MOVE %Var5TIMelhoriasBookFuncional%-S-NVRSAO-ESTRT-DIC(IND-1)
                                        TO %Var4TIMelhoriasBookSaida%-S-NVRSAO-ESTRT-DIC
                                            (IND-1)
               MOVE %Var5TIMelhoriasBookFuncional%-S-RFNALD-ESTRT(IND-1)
                                        TO %Var4TIMelhoriasBookSaida%-S-RFNALD-ESTRT
                                            (IND-1)
               MOVE %Var5TIMelhoriasBookFuncional%-S-DINIC-VGCIA(IND-1)
                                        TO %Var4TIMelhoriasBookSaida%-S-DINIC-VGCIA(IND-1)
               MOVE %Var5TIMelhoriasBookFuncional%-S-DFIM-VGCIA(IND-1)
                                        TO %Var4TIMelhoriasBookSaida%-S-DFIM-VGCIA(IND-1)
           END-PERFORM.

      *----------------------------------------------------------------*
       2120-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2200-PAGINAR                    SECTION.
      *----------------------------------------------------------------*

           PERFORM 6400-CONSULTAR-GAM-PERSISTENTE.

           PERFORM 2210-CONSISTIR-SENTIDO-PAGINA.

           PERFORM 2110-INFORMAR-SERV-FUNCIONAL.

           PERFORM 2220-CARREGAR-CHAVE.

           PERFORM 5100-ACESSAR-SERVICO-FUNCIONAL.

           PERFORM 2120-VALORIZAR-BLOCO-SAIDA.

           PERFORM 6100-GRAVAR-BLOCO-SAIDA.

           PERFORM 6300-ATUALIZAR-GAM-PERSISTENTE.

      *----------------------------------------------------------------*
       2200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * VERIFICA SE SENTIDO DA PAGINACAO DO GAM E DA SESSAO SAO        *
      * POSSIVEIS DE ACORDO COM O CODIGO DE RETORNO                    *
      *----------------------------------------------------------------*
       2210-CONSISTIR-SENTIDO-PAGINA   SECTION.
      *----------------------------------------------------------------*

           IF  (%Var6TIMelhoriasBookPaginacao%-P-INICIAL         AND FRWKEL83-BLOCO-ANTERIOR)
           OR  (%Var6TIMelhoriasBookPaginacao%-P-ULTIMA          AND FRWKEL83-BLOCO-SEGUINTE)
           OR  (%Var6TIMelhoriasBookPaginacao%-P-SEGUINTE        AND FRWKEL83-BLOCO-SEGUINTE
           AND  %Var6TIMelhoriasBookPaginacao%-COD-RETORNO       EQUAL ZEROS)
           OR  (%Var6TIMelhoriasBookPaginacao%-P-ANTERIOR        AND FRWKEL83-BLOCO-ANTERIOR
           AND  %Var6TIMelhoriasBookPaginacao%-COD-RETORNO       EQUAL ZEROS)
               MOVE 08                     TO FRWKGLAQ-COD-RETORNO
               MOVE '0040'                 TO FRWKGLAQ-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'             TO FRWKGLAQ-COD-MENSAGEM
               PERFORM 3000-FINALIZAR
           END-IF.

      *----------------------------------------------------------------*
       2210-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * VALORIZA AS CHAVES DO FUNCIONAL COM AS OBTIDAS NO GAM          *
      *----------------------------------------------------------------*
       2220-CARREGAR-CHAVE             SECTION.
      *----------------------------------------------------------------*

           MOVE %Var6TIMelhoriasBookPaginacao%-PRI-CESTRT-DIC TO %Var5TIMelhoriasBookFuncional%-PRI-CESTRT-DIC.
           MOVE %Var6TIMelhoriasBookPaginacao%-ULT-CESTRT-DIC TO %Var5TIMelhoriasBookFuncional%-ULT-CESTRT-DIC.

      *----------------------------------------------------------------*
       2220-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3000-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*

           EXEC CICS
                RETURN
           END-EXEC.

      *----------------------------------------------------------------*
       3000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * ACESSA GERENCIADOR DE AREA DE MEMORIA                          *
      *----------------------------------------------------------------*
       5000-ACESSAR-GAM                SECTION.
      *----------------------------------------------------------------*

           EXEC CICS
                LINK
                PROGRAM (WRK-FRWK1200)
                COMMAREA(WRK-AREA-FRWK1200)
                LENGTH  (LENGTH OF WRK-AREA-FRWK1200)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                      NOT EQUAL DFHRESP(NORMAL))
               SET  ERRO-CICS               TO TRUE
               MOVE  16                     TO FRWKGLAQ-COD-RETORNO
               MOVE '0050'                  TO FRWKGLAQ-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO FRWKGLAQ-COD-MENSAGEM
               PERFORM 9998-TRATAR-ERRO
           END-IF.

           IF (FRWKEL04-COD-RETORNO         NOT EQUAL ZEROS)
               SET  ERRO-MODULO             TO TRUE
               MOVE 12                      TO FRWKGLAQ-COD-RETORNO
               MOVE '0060'                  TO FRWKGLAQ-COD-ERRO
               MOVE FRWKEL04-COD-MENSAGEM   TO FRWKGLAQ-COD-MENSAGEM
               MOVE WRK-FRWK1200            TO FRWKGMOD-NOME-MODULO
               MOVE FRWKEL04-BLOCO-RETORNO  TO FRWKGMOD-BLOCO-RETORNO
               PERFORM 9998-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       5000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       5100-ACESSAR-SERVICO-FUNCIONAL  SECTION.
      *----------------------------------------------------------------*

           MOVE '5100-ACESSAR-SERVICO-FUNCIONAL'
                                               TO WRK-PARAGRAFO.

           EXEC CICS
                LINK
                PROGRAM  (WRK-%Var7TIMelhoriasProgramaFuncional%)
                COMMAREA (WRK-AREA-FUNCIONAL)
                LENGTH   (LENGTH OF WRK-AREA-FUNCIONAL)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                         NOT EQUAL DFHRESP(NORMAL))
               SET  ERRO-CICS                  TO TRUE
               MOVE  16                        TO FRWKGLAQ-COD-RETORNO
               MOVE '0070'                     TO FRWKGLAQ-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'                 TO FRWKGLAQ-COD-MENSAGEM
               PERFORM 9998-TRATAR-ERRO
           END-IF.

           EVALUATE %Var0TIMelhoriasSistema%W000-COD-RETORNO

               WHEN ZEROS
               WHEN 01
                   CONTINUE

               WHEN 08
                   MOVE %Var0TIMelhoriasSistema%W000-COD-RETORNO   TO FRWKGLAQ-COD-RETORNO
                   MOVE %Var0TIMelhoriasSistema%W000-COD-ERRO      TO FRWKGLAQ-COD-ERRO
                   MOVE %Var0TIMelhoriasSistema%W000-COD-MENSAGEM  TO FRWKGLAQ-COD-MENSAGEM
                   PERFORM 3000-FINALIZAR

               WHEN OTHER
                   SET  ERRO-MODULO            TO TRUE
                   MOVE 12                     TO FRWKGLAQ-COD-RETORNO
                   MOVE '0080'                 TO FRWKGLAQ-COD-ERRO
                   MOVE %Var0TIMelhoriasSistema%W000-COD-MENSAGEM  TO FRWKGLAQ-COD-MENSAGEM
                   MOVE WRK-%Var7TIMelhoriasProgramaFuncional%           TO FRWKGMOD-NOME-MODULO
                   MOVE %Var0TIMelhoriasSistema%W000-BLOCO-RETORNO TO FRWKGMOD-BLOCO-RETORNO
                   PERFORM 9998-TRATAR-ERRO

           END-EVALUATE.

      *----------------------------------------------------------------*
       5100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * GRAVA A LISTA OBTIDA ATRAVES DO FUNCIONAL NO GAM               *
      *----------------------------------------------------------------*
       6100-GRAVAR-BLOCO-SAIDA         SECTION.
      *----------------------------------------------------------------*

           MOVE '6100-GRAVAR-BLOCO-SAIDA'  TO WRK-PARAGRAFO.

           SET FRWKEL04-FUN-CRIAR          TO TRUE.
           SET FRWKEL04-PERM-ATUALIZAR     TO TRUE.
           SET FRWKEL04-IND-BL-SAIDA       TO TRUE.

           MOVE FRWKGLAQ-IDENT-AREA-GLOBAL TO FRWKEL04-IDENT-AREA-GLOBAL

           MOVE %Var4TIMelhoriasBookSaida%-COD-LAYOUT         TO FRWKEL04-ID-BLOCO.
           MOVE %Var4TIMelhoriasBookSaida%-TAM-LAYOUT         TO FRWKEL04-TAM-BLOCO.

           MOVE WRK-AREA-SAIDA             TO FRWKEL04-BUFFER.

           PERFORM 5000-ACESSAR-GAM.

      *----------------------------------------------------------------*
       6100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *  CRIA BLOCO DE DADOS PERSISTENTES COM DADOS DA PAGINACAO       *
      * (CHAVES, SENTIDO E CODIGO DE RETORNO)                          *
      *----------------------------------------------------------------*
       6200-CRIAR-GAM-PERSISTENTE      SECTION.
      *----------------------------------------------------------------*

           MOVE '6200-CRIAR-GAM-PERSISTENTE'
                                           TO WRK-PARAGRAFO.

           INITIALIZE FRWKEL04-BLOCO-ENTRADA
                      FRWKEL04-BLOCO-RETORNO.

           SET FRWKEL04-FUN-CRIAR          TO TRUE.
           SET FRWKEL04-PERM-RESTRITO      TO TRUE.
           SET FRWKEL04-IND-BL-PERS        TO TRUE.

           MOVE FRWKGLAQ-IDENT-AREA-GLOBAL TO FRWKEL04-IDENT-AREA-GLOBAL

           MOVE %Var6TIMelhoriasBookPaginacao%-COD-LAYOUT        TO FRWKEL04-ID-BLOCO.
           MOVE %Var6TIMelhoriasBookPaginacao%-TAM-LAYOUT        TO FRWKEL04-TAM-BLOCO.

           MOVE %Var5TIMelhoriasBookFuncional%-P-SENTIDO         TO %Var6TIMelhoriasBookPaginacao%-P-SENTIDO.
           MOVE %Var5TIMelhoriasBookFuncional%-PRI-CESTRT-DIC    TO %Var6TIMelhoriasBookPaginacao%-PRI-CESTRT-DIC.
           MOVE %Var5TIMelhoriasBookFuncional%-ULT-CESTRT-DIC    TO %Var6TIMelhoriasBookPaginacao%-ULT-CESTRT-DIC.
           MOVE %Var0TIMelhoriasSistema%W000-COD-RETORNO       TO %Var6TIMelhoriasBookPaginacao%-COD-RETORNO.

           MOVE WRK-AREA-PAGINACAO         TO FRWKEL04-BUFFER.

           PERFORM 5000-ACESSAR-GAM.

      *----------------------------------------------------------------*
       6200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *  ATUALIZA BLOCO DE DADOS PERSISTENTES COM DADOS DA PAGINACAO   *
      * (CHAVES, SENTIDO E CODIGO DE RETORNO)                          *
      *----------------------------------------------------------------*
       6300-ATUALIZAR-GAM-PERSISTENTE  SECTION.
      *----------------------------------------------------------------*

           MOVE '6300-ATUALIZAR-GAM-PERSISTENTE'
                                           TO WRK-PARAGRAFO.

           INITIALIZE  FRWKEL04-BLOCO-ENTRADA
                       FRWKEL04-BLOCO-RETORNO.

           SET FRWKEL04-FUN-ATUALIZAR      TO TRUE.
           SET FRWKEL04-PERM-ATUALIZAR     TO TRUE.
           SET FRWKEL04-IND-BL-PERS        TO TRUE.

           MOVE FRWKGLAQ-IDENT-AREA-GLOBAL TO FRWKEL04-IDENT-AREA-GLOBAL

           MOVE %Var6TIMelhoriasBookPaginacao%-COD-LAYOUT        TO FRWKEL04-ID-BLOCO.
           MOVE %Var6TIMelhoriasBookPaginacao%-TAM-LAYOUT        TO FRWKEL04-TAM-BLOCO.

           MOVE %Var5TIMelhoriasBookFuncional%-P-SENTIDO         TO %Var6TIMelhoriasBookPaginacao%-P-SENTIDO.
           MOVE %Var5TIMelhoriasBookFuncional%-PRI-CESTRT-DIC    TO %Var6TIMelhoriasBookPaginacao%-PRI-CESTRT-DIC.
           MOVE %Var5TIMelhoriasBookFuncional%-ULT-CESTRT-DIC    TO %Var6TIMelhoriasBookPaginacao%-ULT-CESTRT-DIC.
           MOVE %Var0TIMelhoriasSistema%W000-COD-RETORNO       TO %Var6TIMelhoriasBookPaginacao%-COD-RETORNO.

           MOVE WRK-AREA-PAGINACAO         TO FRWKEL04-BUFFER.

           PERFORM 5000-ACESSAR-GAM.

      *----------------------------------------------------------------*
       6300-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * OBTEM DADOS DE PAGINACAO DO GAM (CHAVES, SENTIDO E COD RETORNO)*
      *----------------------------------------------------------------*
       6400-CONSULTAR-GAM-PERSISTENTE  SECTION.
      *----------------------------------------------------------------*

           MOVE '6400-CONSULTAR-GAM-PERSISTENTE'
                                           TO WRK-PARAGRAFO.

           SET FRWKEL04-FUN-CONSULTAR      TO TRUE.

           MOVE FRWKGLAQ-IDENT-AREA-GLOBAL TO FRWKEL04-IDENT-AREA-GLOBAL

           MOVE %Var6TIMelhoriasBookPaginacao%-COD-LAYOUT      TO FRWKEL04-ID-BLOCO.
           MOVE %Var6TIMelhoriasBookPaginacao%-TAM-LAYOUT      TO FRWKEL04-TAM-BLOCO.

           PERFORM 5000-ACESSAR-GAM.

           MOVE FRWKEL04-BUFFER(1:FRWKEL04-TAM-BLOCO)
                                           TO WRK-AREA-PAGINACAO.

      *----------------------------------------------------------------*
       6400-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * CODIGOS DE RETORNO : ERRO-LIVRE=8, MODULO=12, CICS=16 E DB2=16 *
      *----------------------------------------------------------------*
       9998-TRATAR-ERRO                SECTION.
      *----------------------------------------------------------------*

           MOVE WRK-PROGRAMA           TO FRWKGHEA-NOME-PROGRAMA.
           MOVE WRK-PARAGRAFO          TO FRWKGHEA-IDEN-PARAGRAFO.

           EVALUATE TRUE

               WHEN ERRO-CICS
                   MOVE FRWKGCIC-TAM-LAYOUT    TO FRWKGHEA-TAM-DADOS
                   MOVE EIBFN                  TO FRWKGCIC-EIBFN
                   MOVE EIBRCODE               TO FRWKGCIC-EIBRCODE
                   MOVE EIBRSRCE               TO FRWKGCIC-EIBRSRCE
                   MOVE EIBRESP                TO FRWKGCIC-EIBRESP
                   MOVE EIBRESP2               TO FRWKGCIC-EIBRESP2
                   MOVE EIBTASKN               TO FRWKGCIC-EIBTASKN
                   MOVE WRK-AREA-ERRO-CICS     TO WRK-BLOCO-INFO-ERRO
                                                  (1:FRWKGHEA-TAM-DADOS)

               WHEN ERRO-MODULO
                   MOVE FRWKGMOD-TAM-LAYOUT    TO FRWKGHEA-TAM-DADOS
                   MOVE WRK-AREA-ERRO-MODULO   TO WRK-BLOCO-INFO-ERRO
                                                  (1:FRWKGHEA-TAM-DADOS)

               WHEN ERRO-LIVRE
                   MOVE FRWKGLIV-TAM-LAYOUT    TO FRWKGHEA-TAM-DADOS
                   MOVE FRWKEL83-WINFO-DADOS-IDIOM
                                               TO FRWKGLIV-IDIOMA
                   MOVE SPACES                 TO FRWKGLIV-PARAMETROS
                   MOVE FRWKGLAQ-COD-MENSAGEM  TO FRWKGLIV-COD-MENSAGEM
                   MOVE WRK-AREA-ERRO-LIVRE    TO WRK-BLOCO-INFO-ERRO
                                                 (1:FRWKGHEA-TAM-DADOS)

           END-EVALUATE.

           PERFORM 9999-CHAMAR-API-ERROS.

      *----------------------------------------------------------------*
       9998-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *  GRAVA LOG DE ERRO E CONTINUA PROCESSAMENTO                    *
      *----------------------------------------------------------------*
       9999-CHAMAR-API-ERROS           SECTION.
      *----------------------------------------------------------------*

           EXEC CICS
                LINK
                PROGRAM  (WRK-FRWK1999)
                COMMAREA (WRK-AREA-ERRO)
                LENGTH   (LENGTH OF WRK-AREA-ERRO)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))
               CONTINUE
           END-IF.

           PERFORM 3000-FINALIZAR.

      *----------------------------------------------------------------*
       9999-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
;
[MODELO TI Melhorias Coordenador Incluir/Alterar/Excluir | ]
      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*

       PROGRAM-ID. |%Var1TIMelhoriasPrograma%.
       AUTHOR.     AUTOR.

      *================================================================*
      *                 P R I M E   I N F O R M A T I C A              *
      *----------------------------------------------------------------*
      *    PROGRAMA....:  %Var1TIMelhoriasPrograma%                                     *
      *    PROGRAMADOR.:  AUTOR                             -  PRIME   *
      *    ANALISTA....:  ANALISTA                          -  PRIME   *
      *    DATA........:  %Var2TIMelhoriasData%                                   *
      *----------------------------------------------------------------*
      *    OBJETIVO....:  COORDENADOR P/ ALTERAR/EXCLUIR/INCLUIR       *
      *                   XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX   *
      *----------------------------------------------------------------*
      *    BOOK'S......:                                               *
      *    %Var3TIMelhoriasBookEntrada% - DADOS DE ENTRADA P/ ALTERAR/EXCLUIR/INCLUIR XXXX *
      *    %Var5TIMelhoriasBookFuncional% - DADOS DO FUNCIONAL P/ ALTERAR/EXCLUIR/INCLUIR XX *
      *    %Var0TIMelhoriasSistema%W000 - DADOS DE CONTROLE                                *
      *    I#FRWKAQ - AREA COMUM PROG/FRWK                             *
      *    I#FRWK04 - COMUNICACAO COM GERENCIADOR DE AREA DE MEMORIA   *
      *    I#FRWK83 - DADOS DE SESSAO DO USUARIO                       *
      *    I#FRWKGE - TRATAMENTO DE ERROS - GERAL                      *
      *    I#FRWKMD - TRATAMENTO DE ERROS - MODULO                     *
      *    I#FRWKCI - TRATAMENTO DE ERROS - CICS                       *
      *----------------------------------------------------------------*
      *    MODULOS.....:                                               *
      *    %Var7TIMelhoriasProgramaFuncional% - FUNCIONAL P/ ALTERAR/EXCLUIR/INCLUIR XXXXXXXXXX  *
      *    FRWK1200 - GERENCIADOR DE AREA DE MEMORIA (GAM)             *
      *    FRWK1999 - GRAVACAO DE LOG DE ERROS                         *
      *================================================================*

      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*

       SPECIAL-NAMES.
           DECIMAL-POINT               IS   COMMA.

      *================================================================*
       DATA                            DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           'INICIO DA WORKING STORAGE SECTION'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           'VARIAVEIS AUXILIARES'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  WRK-PROGRAMA                PIC  X(008)         VALUE
           '%Var1TIMelhoriasPrograma%'.
       77  WRK-PARAGRAFO               PIC  X(030)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA PARA DADOS DE ENTRADA'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ENTRADA.
           COPY %Var3TIMelhoriasBookEntrada%.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DO SERVICO FUNCIONAL'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-%Var7TIMelhoriasProgramaFuncional%                PIC  X(008)         VALUE
           '%Var7TIMelhoriasProgramaFuncional%'.

       01  WRK-AREA-FUNCIONAL.
           COPY %Var0TIMelhoriasSistema%W000.
           COPY %Var5TIMelhoriasBookFuncional%.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE ACESSO PARA DADOS DA SESSAO'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-SESSAO.
           COPY 'I#FRWK83'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE PARA COMUNICACAO COM O GAM'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-FRWK1200                PIC  X(008)         VALUE
           'FRWK1200'.

       01  WRK-AREA-FRWK1200.
           COPY 'I#FRWK04'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE COMUNICACAO DO PROGRAMA FRWK1999'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-FRWK1999                PIC  X(008)         VALUE
           'FRWK1999'.

       01  WRK-AREA-ERRO.
           COPY 'I#FRWKGE'.
           05 WRK-BLOCO-INFO-ERRO.
              10 WRK-CHAR-INFO-ERRO    PIC  X(001) OCCURS 0 TO 30000
                                       TIMES DEPENDING ON
                                       FRWKGHEA-TAM-DADOS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE TRATAMENTO DE ERRO - MODULO'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ERRO-MODULO.
           COPY 'I#FRWKMD'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE TRATAMENTO DE ERRO - CICS'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ERRO-CICS.
           COPY 'I#FRWKCI'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'FIM DA WORKING STORAGE SECTION'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *================================================================*
       LINKAGE                         SECTION.
      *================================================================*

       01  DFHCOMMAREA.
           COPY 'I#FRWKAQ'.

      *================================================================*
       PROCEDURE                       DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       0000-PRINCIPAL                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 1000-INICIALIZAR.

           PERFORM 2000-PROCESSAR.

           PERFORM 3000-FINALIZAR.

      *----------------------------------------------------------------*
       0000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1000-INICIALIZAR                SECTION.
      *----------------------------------------------------------------*

           INITIALIZE FRWKGHEA-REGISTRO
                      FRWKGCIC-REGISTRO
                      FRWKGMOD-REGISTRO.

           PERFORM 1100-OBTER-DADOS-ENTRADA.

           PERFORM 1200-OBTER-DADOS-SESSAO.

           PERFORM 1300-CONSISTIR-DADOS-ENTRADA.

      *----------------------------------------------------------------*
       1000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1100-OBTER-DADOS-ENTRADA        SECTION.
      *----------------------------------------------------------------*

           MOVE '1100-OBTER-DADOS-ENTRADA' TO WRK-PARAGRAFO.

           SET FRWKEL04-FUN-CONSULTAR      TO TRUE.

           MOVE FRWKGLAQ-IDENT-AREA-GLOBAL TO FRWKEL04-IDENT-AREA-GLOBAL

           MOVE %Var3TIMelhoriasBookEntrada%-COD-LAYOUT        TO FRWKEL04-ID-BLOCO.
           MOVE %Var3TIMelhoriasBookEntrada%-TAM-LAYOUT        TO FRWKEL04-TAM-BLOCO.

           PERFORM 5000-ACESSAR-GAM.

           MOVE FRWKEL04-BUFFER(1:FRWKEL04-TAM-BLOCO)
                                           TO WRK-AREA-ENTRADA.

      *----------------------------------------------------------------*
       1100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1200-OBTER-DADOS-SESSAO         SECTION.
      *----------------------------------------------------------------*

           MOVE '1200-OBTER-DADOS-SESSAO'  TO WRK-PARAGRAFO.

           SET FRWKEL04-FUN-CONSULTAR      TO TRUE.

           MOVE FRWKGLAQ-IDENT-AREA-GLOBAL TO FRWKEL04-IDENT-AREA-GLOBAL

           MOVE FRWKEL83-COD-LAYOUT        TO FRWKEL04-ID-BLOCO.
           MOVE FRWKEL83-TAM-LAYOUT        TO FRWKEL04-TAM-BLOCO.

           PERFORM 5000-ACESSAR-GAM.

           MOVE FRWKEL04-BUFFER(1:FRWKEL04-TAM-BLOCO)
                                           TO FRWKEL83-REGISTRO.

      *----------------------------------------------------------------*
       1200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1300-CONSISTIR-DADOS-ENTRADA    SECTION.
      *----------------------------------------------------------------*

      *----USAR COMENTARIOS (EX. CODIGO DE FUNCAO 3 = EXCLUSAO)
           IF (%Var3TIMelhoriasBookEntrada%-E-CD-FUNCAO         NOT EQUAL 03)
               MOVE 08                      TO FRWKGLAQ-COD-RETORNO
               MOVE '0010'                  TO FRWKGLAQ-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO FRWKGLAQ-COD-MENSAGEM
               PERFORM 3000-FINALIZAR
           END-IF.

           IF (%Var3TIMelhoriasBookEntrada%-E-NU-COMPONENTE     NOT NUMERIC) OR
              (%Var3TIMelhoriasBookEntrada%-E-NU-COMPONENTE     EQUAL ZEROS)
               MOVE 08                      TO FRWKGLAQ-COD-RETORNO
               MOVE '0020'                  TO FRWKGLAQ-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO FRWKGLAQ-COD-MENSAGEM
               PERFORM 3000-FINALIZAR
           END-IF.

      *----------------------------------------------------------------*
       1300-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 2100-ACESSAR-SERVICO-FUNCIONAL.

           MOVE %Var0TIMelhoriasSistema%W000-COD-RETORNO   TO   FRWKGLAQ-COD-RETORNO.
           MOVE %Var0TIMelhoriasSistema%W000-COD-ERRO      TO   FRWKGLAQ-COD-ERRO.
           MOVE %Var0TIMelhoriasSistema%W000-COD-MENSAGEM  TO   FRWKGLAQ-COD-MENSAGEM.

      *----------------------------------------------------------------*
       2000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2100-ACESSAR-SERVICO-FUNCIONAL  SECTION.
      *----------------------------------------------------------------*

           MOVE '2100-ACESSAR-SERVICO-FUNCIONAL' TO WRK-PARAGRAFO.

           PERFORM 2110-VALORIZAR-AREA-FUNCIONAL.

           EXEC CICS
                LINK
                PROGRAM  (WRK-%Var7TIMelhoriasProgramaFuncional%)
                COMMAREA (WRK-AREA-FUNCIONAL)
                LENGTH   (LENGTH OF WRK-AREA-FUNCIONAL)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                        NOT EQUAL DFHRESP(NORMAL))
               SET   ERRO-CICS                TO TRUE
               MOVE  16                       TO FRWKGLAQ-COD-RETORNO
               MOVE '0030'                    TO FRWKGLAQ-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'                TO FRWKGLAQ-COD-MENSAGEM
               PERFORM 9998-TRATAR-ERRO
           END-IF.

           EVALUATE %Var0TIMelhoriasSistema%W000-COD-RETORNO

               WHEN ZEROS
                   CONTINUE

               WHEN 08
                   MOVE %Var0TIMelhoriasSistema%W000-COD-RETORNO   TO FRWKGLAQ-COD-RETORNO
                   MOVE %Var0TIMelhoriasSistema%W000-COD-ERRO      TO FRWKGLAQ-COD-ERRO
                   MOVE %Var0TIMelhoriasSistema%W000-COD-MENSAGEM  TO FRWKGLAQ-COD-MENSAGEM
                   PERFORM 3000-FINALIZAR

               WHEN OTHER
                   SET  ERRO-MODULO            TO TRUE
                   MOVE 12                     TO FRWKGLAQ-COD-RETORNO
                   MOVE '0040'                 TO FRWKGLAQ-COD-ERRO
                   MOVE %Var0TIMelhoriasSistema%W000-COD-MENSAGEM  TO FRWKGLAQ-COD-MENSAGEM
                   MOVE WRK-%Var7TIMelhoriasProgramaFuncional%           TO FRWKGMOD-NOME-MODULO
                   MOVE %Var0TIMelhoriasSistema%W000-BLOCO-RETORNO TO FRWKGMOD-BLOCO-RETORNO
                   PERFORM 9998-TRATAR-ERRO

           END-EVALUATE.

      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * PASSAR DADOS DA ENTRADA DO COORDENADOR P/ ENTRADA DO FUNCIONAL *
      *----------------------------------------------------------------*
       2110-VALORIZAR-AREA-FUNCIONAL   SECTION.
      *----------------------------------------------------------------*

           MOVE %Var3TIMelhoriasBookEntrada%-ENTRADA                 TO %Var5TIMelhoriasBookFuncional%-ENTRADA.

      *----------------------------------------------------------------*
       2110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3000-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*

           EXEC CICS
                RETURN
           END-EXEC.

      *----------------------------------------------------------------*
       3000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * ACESSA GERENCIADOR DE AREA DE MEMORIA                          *
      *----------------------------------------------------------------*
       5000-ACESSAR-GAM                SECTION.
      *----------------------------------------------------------------*

           EXEC CICS
                LINK
                PROGRAM (WRK-FRWK1200)
                COMMAREA(WRK-AREA-FRWK1200)
                LENGTH  (LENGTH OF WRK-AREA-FRWK1200)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                      NOT EQUAL DFHRESP(NORMAL))
               SET   ERRO-CICS              TO TRUE
               MOVE  16                     TO FRWKGLAQ-COD-RETORNO
               MOVE '0050'                  TO FRWKGLAQ-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO FRWKGLAQ-COD-MENSAGEM
               PERFORM 9998-TRATAR-ERRO
           END-IF.

           IF (FRWKEL04-COD-RETORNO         NOT EQUAL ZEROS)
               SET  ERRO-MODULO             TO TRUE
               MOVE 12                      TO FRWKGLAQ-COD-RETORNO
               MOVE '0060'                  TO FRWKGLAQ-COD-ERRO
               MOVE FRWKEL04-COD-MENSAGEM   TO FRWKGLAQ-COD-MENSAGEM
               MOVE WRK-FRWK1200            TO FRWKGMOD-NOME-MODULO
               MOVE FRWKEL04-BLOCO-RETORNO  TO FRWKGMOD-BLOCO-RETORNO
               PERFORM 9998-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       5000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * CODIGOS DE RETORNO : ERRO-LIVRE=8, MODULO=12, CICS=16 E DB2=16 *
      *----------------------------------------------------------------*
       9998-TRATAR-ERRO                SECTION.
      *----------------------------------------------------------------*

           MOVE WRK-PROGRAMA           TO FRWKGHEA-NOME-PROGRAMA.
           MOVE WRK-PARAGRAFO          TO FRWKGHEA-IDEN-PARAGRAFO.

           EVALUATE TRUE

               WHEN ERRO-CICS
                   MOVE FRWKGCIC-TAM-LAYOUT    TO FRWKGHEA-TAM-DADOS
                   MOVE EIBFN                  TO FRWKGCIC-EIBFN
                   MOVE EIBRCODE               TO FRWKGCIC-EIBRCODE
                   MOVE EIBRSRCE               TO FRWKGCIC-EIBRSRCE
                   MOVE EIBRESP                TO FRWKGCIC-EIBRESP
                   MOVE EIBRESP2               TO FRWKGCIC-EIBRESP2
                   MOVE EIBTASKN               TO FRWKGCIC-EIBTASKN
                   MOVE WRK-AREA-ERRO-CICS     TO WRK-BLOCO-INFO-ERRO
                                                  (1:FRWKGHEA-TAM-DADOS)

               WHEN ERRO-MODULO
                   MOVE FRWKGMOD-TAM-LAYOUT    TO FRWKGHEA-TAM-DADOS
                   MOVE WRK-AREA-ERRO-MODULO   TO WRK-BLOCO-INFO-ERRO
                                                  (1:FRWKGHEA-TAM-DADOS)

           END-EVALUATE.

           PERFORM 9999-CHAMAR-API-ERROS.

      *----------------------------------------------------------------*
       9998-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9999-CHAMAR-API-ERROS           SECTION.
      *----------------------------------------------------------------*

           EXEC CICS
                LINK
                PROGRAM  (WRK-FRWK1999)
                COMMAREA (WRK-AREA-ERRO)
                LENGTH   (LENGTH OF WRK-AREA-ERRO)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))
               CONTINUE
           END-IF.

           PERFORM 3000-FINALIZAR.

      *----------------------------------------------------------------*
       9999-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
;
[MODELO TI Melhorias Coordenador Consulta Simples | ]
      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*

       PROGRAM-ID. |%Var1TIMelhoriasPrograma%.
       AUTHOR.     AUTOR.

      *================================================================*
      *                 P R I M E   I N F O R M A T I C A              *
      *----------------------------------------------------------------*
      *    PROGRAMA....:  %Var1TIMelhoriasPrograma%                                     *
      *    PROGRAMADOR.:  AUTOR                             -  PRIME   *
      *    ANALISTA....:  ANALISTA                          -  PRIME   *
      *    DATA........:  %Var2TIMelhoriasData%                                   *
      *----------------------------------------------------------------*
      *    OBJETIVO....:  COORDENADOR P/ CONSULTAR XXXXXXXXXXXXXXXXX   *
      *                   XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX   *
      *----------------------------------------------------------------*
      *    BOOK'S......:                                               *
      *    %Var3TIMelhoriasBookEntrada% - DADOS DE ENTRADA P/ ALTERAR/EXCLUIR/INCLUIR XXXX *
      *    %Var5TIMelhoriasBookFuncional% - DADOS DO FUNCIONAL P/ ALTERAR/EXCLUIR/INCLUIR XX *
      *    %Var4TIMelhoriasBookSaida% - DADOS DE SAIDA P/ ALTERAR/EXCLUIR/INCLUIR XXXX   *
      *    %Var0TIMelhoriasSistema%W000 - DADOS DE CONTROLE                                *
      *    I#FRWKAQ - AREA COMUM PROG/FRWK                             *
      *    I#FRWK04 - COMUNICACAO COM GERENCIADOR DE AREA DE MEMORIA   *
      *    I#FRWK83 - DADOS DE SESSAO DO USUARIO                       *
      *    I#FRWKGE - TRATAMENTO DE ERROS - GERAL                      *
      *    I#FRWKMD - TRATAMENTO DE ERROS - MODULO                     *
      *    I#FRWKCI - TRATAMENTO DE ERROS - CICS                       *
      *----------------------------------------------------------------*
      *    MODULOS.....:                                               *
      *    %Var7TIMelhoriasProgramaFuncional% - FUNCIONAL P/ ALTERAR/EXCLUIR/INCLUIR XXXXXXXXXX  *
      *    FRWK1200 - GERENCIADOR DE AREA DE MEMORIA (GAM)             *
      *    FRWK1999 - GRAVACAO DE LOG DE ERROS                         *
      *================================================================*

      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*

       SPECIAL-NAMES.
           DECIMAL-POINT               IS   COMMA.

      *================================================================*
       DATA                            DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           'INICIO DA WORKING STORAGE SECTION'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           'VARIAVEIS AUXILIARES'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  WRK-PROGRAMA                PIC  X(008)         VALUE
           '%Var1TIMelhoriasPrograma%'.
       77  WRK-PARAGRAFO               PIC  X(030)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA PARA DADOS DE ENTRADA'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ENTRADA.
           COPY %Var3TIMelhoriasBookEntrada%.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA PARA DADOS DE SAIDA'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-SAIDA.
           COPY %Var4TIMelhoriasBookSaida%.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DO SERVICO FUNCIONAL'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-%Var7TIMelhoriasProgramaFuncional%                PIC  X(008)         VALUE
           '%Var7TIMelhoriasProgramaFuncional%'.

       01  WRK-AREA-FUNCIONAL.
           COPY %Var0TIMelhoriasSistema%W000.
           COPY %Var5TIMelhoriasBookFuncional%.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE ACESSO PARA DADOS DA SESSAO'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-SESSAO.
           COPY 'I#FRWK83'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE PARA COMUNICACAO COM O GAM'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-FRWK1200                PIC  X(008)         VALUE
           'FRWK1200'.

       01  WRK-AREA-FRWK1200.
           COPY 'I#FRWK04'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE COMUNICACAO DO PROGRAMA FRWK1999'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-FRWK1999                PIC  X(008)         VALUE
           'FRWK1999'.

       01  WRK-AREA-ERRO.
           COPY 'I#FRWKGE'.
           05 WRK-BLOCO-INFO-ERRO.
              10 WRK-CHAR-INFO-ERRO    PIC  X(001) OCCURS 0 TO 30000
                                       TIMES DEPENDING ON
                                       FRWKGHEA-TAM-DADOS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE TRATAMENTO DE ERRO - MODULO'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ERRO-MODULO.
           COPY 'I#FRWKMD'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE TRATAMENTO DE ERRO - CICS'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ERRO-CICS.
           COPY 'I#FRWKCI'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'FIM DA WORKING STORAGE SECTION'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *================================================================*
       LINKAGE                         SECTION.
      *================================================================*

       01  DFHCOMMAREA.
           COPY 'I#FRWKAQ'.

      *================================================================*
       PROCEDURE                       DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       0000-PRINCIPAL                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 1000-INICIALIZAR.

           PERFORM 2000-PROCESSAR.

           PERFORM 3000-FINALIZAR.

      *----------------------------------------------------------------*
       0000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1000-INICIALIZAR                SECTION.
      *----------------------------------------------------------------*

           INITIALIZE FRWKGHEA-REGISTRO
                      FRWKGCIC-REGISTRO
                      FRWKGMOD-REGISTRO.

           PERFORM 1100-OBTER-DADOS-ENTRADA.

           PERFORM 1200-OBTER-DADOS-SESSAO.

           PERFORM 1300-CONSISTIR-DADOS-ENTRADA.

      *----------------------------------------------------------------*
       1000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1100-OBTER-DADOS-ENTRADA        SECTION.
      *----------------------------------------------------------------*

           MOVE '1100-OBTER-DADOS-ENTRADA' TO WRK-PARAGRAFO.

           SET FRWKEL04-FUN-CONSULTAR      TO TRUE.

           MOVE FRWKGLAQ-IDENT-AREA-GLOBAL TO FRWKEL04-IDENT-AREA-GLOBAL

           MOVE %Var3TIMelhoriasBookEntrada%-COD-LAYOUT        TO FRWKEL04-ID-BLOCO.
           MOVE %Var3TIMelhoriasBookEntrada%-TAM-LAYOUT        TO FRWKEL04-TAM-BLOCO.

           PERFORM 5000-ACESSAR-GAM.

           MOVE FRWKEL04-BUFFER(1:FRWKEL04-TAM-BLOCO)
                                           TO WRK-AREA-ENTRADA.

      *----------------------------------------------------------------*
       1100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1200-OBTER-DADOS-SESSAO         SECTION.
      *----------------------------------------------------------------*

           MOVE '1200-OBTER-DADOS-SESSAO'  TO WRK-PARAGRAFO.

           SET FRWKEL04-FUN-CONSULTAR      TO TRUE.

           MOVE FRWKGLAQ-IDENT-AREA-GLOBAL TO FRWKEL04-IDENT-AREA-GLOBAL

           MOVE FRWKEL83-COD-LAYOUT        TO FRWKEL04-ID-BLOCO.
           MOVE FRWKEL83-TAM-LAYOUT        TO FRWKEL04-TAM-BLOCO.

           PERFORM 5000-ACESSAR-GAM.

           MOVE FRWKEL04-BUFFER(1:FRWKEL04-TAM-BLOCO)
                                           TO FRWKEL83-REGISTRO.

      *----------------------------------------------------------------*
       1200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1300-CONSISTIR-DADOS-ENTRADA    SECTION.
      *----------------------------------------------------------------*

      *----USAR COMENTARIOS (EX. CODIGO DE FUNCAO 3 = EXCLUSAO)
           IF (%Var3TIMelhoriasBookEntrada%-E-CD-FUNCAO         NOT EQUAL 03)
               MOVE 08                      TO FRWKGLAQ-COD-RETORNO
               MOVE '0010'                  TO FRWKGLAQ-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO FRWKGLAQ-COD-MENSAGEM
               PERFORM 3000-FINALIZAR
           END-IF.

           IF (%Var3TIMelhoriasBookEntrada%-E-NU-COMPONENTE     NOT NUMERIC) OR
              (%Var3TIMelhoriasBookEntrada%-E-NU-COMPONENTE     EQUAL ZEROS)
               MOVE 08                      TO FRWKGLAQ-COD-RETORNO
               MOVE '0020'                  TO FRWKGLAQ-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO FRWKGLAQ-COD-MENSAGEM
               PERFORM 3000-FINALIZAR
           END-IF.

      *----------------------------------------------------------------*
       1300-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 2100-ACESSAR-SERVICO-FUNCIONAL.

           PERFORM 2200-GRAVAR-BLOCO-SAIDA.

           MOVE %Var0TIMelhoriasSistema%W000-COD-RETORNO   TO   FRWKGLAQ-COD-RETORNO.
           MOVE %Var0TIMelhoriasSistema%W000-COD-ERRO      TO   FRWKGLAQ-COD-ERRO.
           MOVE %Var0TIMelhoriasSistema%W000-COD-MENSAGEM  TO   FRWKGLAQ-COD-MENSAGEM.

      *----------------------------------------------------------------*
       2000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2100-ACESSAR-SERVICO-FUNCIONAL  SECTION.
      *----------------------------------------------------------------*

           MOVE '2100-ACESSAR-SERVICO-FUNCIONAL' TO WRK-PARAGRAFO.

           PERFORM 2110-VALORIZAR-AREA-FUNCIONAL.

           EXEC CICS
                LINK
                PROGRAM  (WRK-%Var7TIMelhoriasProgramaFuncional%)
                COMMAREA (WRK-AREA-FUNCIONAL)
                LENGTH   (LENGTH OF WRK-AREA-FUNCIONAL)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                        NOT EQUAL DFHRESP(NORMAL))
               SET   ERRO-CICS                TO TRUE
               MOVE  16                       TO FRWKGLAQ-COD-RETORNO
               MOVE '0030'                    TO FRWKGLAQ-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'                TO FRWKGLAQ-COD-MENSAGEM
               PERFORM 9998-TRATAR-ERRO
           END-IF.

           EVALUATE %Var0TIMelhoriasSistema%W000-COD-RETORNO

               WHEN ZEROS
                   CONTINUE

               WHEN 08
                   MOVE %Var0TIMelhoriasSistema%W000-COD-RETORNO   TO FRWKGLAQ-COD-RETORNO
                   MOVE %Var0TIMelhoriasSistema%W000-COD-ERRO      TO FRWKGLAQ-COD-ERRO
                   MOVE %Var0TIMelhoriasSistema%W000-COD-MENSAGEM  TO FRWKGLAQ-COD-MENSAGEM
                   PERFORM 3000-FINALIZAR

               WHEN OTHER
                   SET  ERRO-MODULO            TO TRUE
                   MOVE 12                     TO FRWKGLAQ-COD-RETORNO
                   MOVE '0040'                 TO FRWKGLAQ-COD-ERRO
                   MOVE %Var0TIMelhoriasSistema%W000-COD-MENSAGEM  TO FRWKGLAQ-COD-MENSAGEM
                   MOVE WRK-%Var7TIMelhoriasProgramaFuncional%           TO FRWKGMOD-NOME-MODULO
                   MOVE %Var0TIMelhoriasSistema%W000-BLOCO-RETORNO TO FRWKGMOD-BLOCO-RETORNO
                   PERFORM 9998-TRATAR-ERRO

           END-EVALUATE.

      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * PASSAR DADOS DA ENTRADA DO COORDENADOR P/ ENTRADA DO FUNCIONAL *
      *----------------------------------------------------------------*
       2110-VALORIZAR-AREA-FUNCIONAL   SECTION.
      *----------------------------------------------------------------*

           MOVE %Var3TIMelhoriasBookEntrada%-ENTRADA                 TO %Var5TIMelhoriasBookFuncional%-ENTRADA.

      *----------------------------------------------------------------*
       2110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * GRAVA DADOS DA CONSULTA NO GAM PARA COMUNICACAO COM A BAIXA    *
      *----------------------------------------------------------------*
       2200-GRAVAR-BLOCO-SAIDA         SECTION.
      *----------------------------------------------------------------*

           PERFORM 2210-VALORIZAR-AREA-SAIDA.

           MOVE '2200-GRAVAR-BLOCO-SAIDA'
                                       TO   WRK-PARAGRAFO.

           SET FRWKEL04-FUN-CRIAR      TO   TRUE.
           SET FRWKEL04-PERM-ATUALIZAR TO   TRUE.
           SET FRWKEL04-IND-BL-SAIDA   TO   TRUE.

           MOVE FRWKGLAQ-IDENT-AREA-GLOBAL
                                       TO   FRWKEL04-IDENT-AREA-GLOBAL.

           MOVE %Var4TIMelhoriasBookSaida%-COD-LAYOUT    TO   FRWKEL04-ID-BLOCO.
           MOVE LENGTH                 OF   WRK-AREA-SAIDA
                                       TO   FRWKEL04-TAM-BLOCO.

           MOVE WRK-AREA-SAIDA(1:FRWKEL04-TAM-BLOCO)
                                       TO FRWKEL04-BUFFER.

           PERFORM 5000-ACESSAR-GAM.

      *----------------------------------------------------------------*
       2200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *  PASSA DADOS DA AREA DO FUNCIONAL PARA AREA DE SAIDA DO COORD. *
      *----------------------------------------------------------------*
       2210-VALORIZAR-AREA-SAIDA       SECTION.
      *----------------------------------------------------------------*

           MOVE %Var5TIMelhoriasBookFuncional%-SAIDA         TO   %Var4TIMelhoriasBookSaida%-SAIDA.

      *----------------------------------------------------------------*
       2210-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3000-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*

           EXEC CICS
                RETURN
           END-EXEC.

      *----------------------------------------------------------------*
       3000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * ACESSA GERENCIADOR DE AREA DE MEMORIA                          *
      *----------------------------------------------------------------*
       5000-ACESSAR-GAM                SECTION.
      *----------------------------------------------------------------*

           EXEC CICS
                LINK
                PROGRAM (WRK-FRWK1200)
                COMMAREA(WRK-AREA-FRWK1200)
                LENGTH  (LENGTH OF WRK-AREA-FRWK1200)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                      NOT EQUAL DFHRESP(NORMAL))
               SET   ERRO-CICS              TO TRUE
               MOVE  16                     TO FRWKGLAQ-COD-RETORNO
               MOVE '0050'                  TO FRWKGLAQ-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO FRWKGLAQ-COD-MENSAGEM
               PERFORM 9998-TRATAR-ERRO
           END-IF.

           IF (FRWKEL04-COD-RETORNO         NOT EQUAL ZEROS)
               SET  ERRO-MODULO             TO TRUE
               MOVE 12                      TO FRWKGLAQ-COD-RETORNO
               MOVE '0060'                  TO FRWKGLAQ-COD-ERRO
               MOVE FRWKEL04-COD-MENSAGEM   TO FRWKGLAQ-COD-MENSAGEM
               MOVE WRK-FRWK1200            TO FRWKGMOD-NOME-MODULO
               MOVE FRWKEL04-BLOCO-RETORNO  TO FRWKGMOD-BLOCO-RETORNO
               PERFORM 9998-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       5000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * CODIGOS DE RETORNO : ERRO-LIVRE=8, MODULO=12, CICS=16 E DB2=16 *
      *----------------------------------------------------------------*
       9998-TRATAR-ERRO                SECTION.
      *----------------------------------------------------------------*

           MOVE WRK-PROGRAMA           TO FRWKGHEA-NOME-PROGRAMA.
           MOVE WRK-PARAGRAFO          TO FRWKGHEA-IDEN-PARAGRAFO.

           EVALUATE TRUE

               WHEN ERRO-CICS
                   MOVE FRWKGCIC-TAM-LAYOUT    TO FRWKGHEA-TAM-DADOS
                   MOVE EIBFN                  TO FRWKGCIC-EIBFN
                   MOVE EIBRCODE               TO FRWKGCIC-EIBRCODE
                   MOVE EIBRSRCE               TO FRWKGCIC-EIBRSRCE
                   MOVE EIBRESP                TO FRWKGCIC-EIBRESP
                   MOVE EIBRESP2               TO FRWKGCIC-EIBRESP2
                   MOVE EIBTASKN               TO FRWKGCIC-EIBTASKN
                   MOVE WRK-AREA-ERRO-CICS     TO WRK-BLOCO-INFO-ERRO
                                                  (1:FRWKGHEA-TAM-DADOS)

               WHEN ERRO-MODULO
                   MOVE FRWKGMOD-TAM-LAYOUT    TO FRWKGHEA-TAM-DADOS
                   MOVE WRK-AREA-ERRO-MODULO   TO WRK-BLOCO-INFO-ERRO
                                                  (1:FRWKGHEA-TAM-DADOS)

           END-EVALUATE.

           PERFORM 9999-CHAMAR-API-ERROS.

      *----------------------------------------------------------------*
       9998-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9999-CHAMAR-API-ERROS           SECTION.
      *----------------------------------------------------------------*

           EXEC CICS
                LINK
                PROGRAM  (WRK-FRWK1999)
                COMMAREA (WRK-AREA-ERRO)
                LENGTH   (LENGTH OF WRK-AREA-ERRO)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))
               CONTINUE
           END-IF.

           PERFORM 3000-FINALIZAR.

      *----------------------------------------------------------------*
       9999-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
;
[MODELO TI Melhorias Funcional Lista (paginação) | ]
      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*

       PROGRAM-ID. |%Var1TIMelhoriasPrograma%.
       AUTHOR.     AUTOR.

      *================================================================*
      *                 P R I M E   I N F O R M A T I C A              *
      *----------------------------------------------------------------*
      *    PROGRAMA....:  %Var1TIMelhoriasPrograma%                                     *
      *    PROGRAMADOR.:  AUTOR                             -  PRIME   *
      *    ANALISTA....:  ANALISTA                          -  PRIME   *
      *    DATA........:  %Var2TIMelhoriasData%                                   *
      *----------------------------------------------------------------*
      *    OBJETIVO....:  FUNCIONAL P/ LISTAR XXXXXXXXXXXXXXXXXXXXXX   *
      *                   XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX   *
      *----------------------------------------------------------------*
      *    BCO DE DADOS:                                               *
      *                TABLE                          INCLUDE/BOOK     *
      *                DB2PRD.%Var2Db2Tabela%            %Var1Db2Dclgen%       *
      *----------------------------------------------------------------*
      *    BOOK'S......:                                               *
      *    %Var0TIMelhoriasSistema%W000 - INTERFACE WEB/MAINFRAME                          *
      *    %Var5TIMelhoriasBookFuncional% - COMUNICACAO DO PROGRAMA                          *
      *    I#FRWKGE - TRATAMENTO DE ERRO - GERAL                       *
      *    I#FRWKDB - TRATAMENTO DE ERRO - DB2                         *
      *----------------------------------------------------------------*
      *    MODULOS.....:                                               *
      *    FRWK1999 - GRAVA LOG DE ERRO                                *
      *================================================================*

      *================================================================*
        ENVIRONMENT                    DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*

       SPECIAL-NAMES.
           DECIMAL-POINT               IS   COMMA.

      *================================================================*
       DATA                            DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           'INICIO DA WORKING STORAGE SECTION'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           'ACUMULADORES E INDEXADORES'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  ACU-OCORRENCIAS             PIC  9(005) COMP-3  VALUE ZEROS.

       77  IND-1                       PIC  9(002) COMP-3  VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           'VARIAVEIS AUXILIARES'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  WRK-PROGRAMA                PIC  X(008)         VALUE
           'PROG9999'.

       77  WRK-PARAGRAFO               PIC  X(030)         VALUE SPACES.

       77  WRK-FIM-CURSOR              PIC  X(001)         VALUE 'N'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA P/ CHAVES'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-CHAVE-PAGINACAO.
           05 WRK-CH-CESTRT-DIC        PIC  9(005)         VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE COMUNICACAO DO PROGRAMA FRWK1999'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-FRWK1999                PIC  X(008)         VALUE
           'FRWK1999'.

       01  WRK-AREA-ERRO.
           COPY 'I#FRWKGE'.
           05 WRK-BLOCO-INFO-ERRO.
              10 WRK-CHAR-INFO-ERRO    PIC  X(001) OCCURS 0 TO 30000
                                       TIMES DEPENDING ON
                                       FRWKGHEA-TAM-DADOS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE ERRO DB2'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ERRO-DB2.
           COPY 'I#FRWKDB'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA PARA INCLUDES DB2'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

           EXEC SQL
                INCLUDE SQLCA
           END-EXEC.

           EXEC SQL
                INCLUDE %Var1Db2Dclgen%
           END-EXEC.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA PARA CURSORES DE PAGINACAO'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

           EXEC SQL
                DECLARE  CSR01-%Var1Db2Dclgen%  CURSOR  FOR
                 SELECT  CESTRT_DIC
                        ,NVRSAO_ESTRT_DIC
                        ,RFNALD_ESTRT
                        ,DINIC_VGCIA_DIC
                        ,DFIM_VGCIA_ESTRT
                   FROM  DB2PRD.%Var2Db2Tabela%
                  WHERE  CESTRT_DIC       >  :%Var1Db2Dclgen%.CESTRT-DIC
               ORDER BY  CESTRT_DIC ASC
            FETCH FIRST  51 ROWS  ONLY
           END-EXEC.

           EXEC SQL
                DECLARE  CSR02-%Var1Db2Dclgen%  CURSOR  FOR
                 SELECT  CESTRT_DIC
                        ,NVRSAO_ESTRT_DIC
                        ,RFNALD_ESTRT
                        ,DINIC_VGCIA_DIC
                        ,DFIM_VGCIA_ESTRT
                   FROM  DB2PRD.%Var2Db2Tabela%
                  WHERE  CESTRT_DIC       <  :%Var1Db2Dclgen%.CESTRT-DIC
               ORDER BY  CESTRT_DIC DESC
            FETCH FIRST  51 ROWS  ONLY
           END-EXEC.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'FIM DA WORKING STORAGE SECTION'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *----------------------------------------------------------------*
       LINKAGE                         SECTION.
      *----------------------------------------------------------------*

       01  DFHCOMMAREA.
           COPY %Var0TIMelhoriasSistema%W000.
           COPY %Var5TIMelhoriasBookFuncional%.

      *================================================================*
       PROCEDURE                       DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       0000-INICIAR                    SECTION.
      *----------------------------------------------------------------*

           PERFORM 1000-INICIALIZAR.

           PERFORM 2000-PROCESSAR.

           PERFORM 3000-FINALIZAR.

      *----------------------------------------------------------------*
       0000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1000-INICIALIZAR                SECTION.
      *----------------------------------------------------------------*

           INITIALIZE FRWKGHEA-REGISTRO
                      FRWKGDB2-REGISTRO
                      %Var0TIMelhoriasSistema%W000-BLOCO-RETORNO.

           PERFORM 1100-VERIFICAR-PAGINACAO.

      *----------------------------------------------------------------*
       1000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1100-VERIFICAR-PAGINACAO        SECTION.
      *----------------------------------------------------------------*

           EVALUATE TRUE

               WHEN %Var5TIMelhoriasBookFuncional%-P-INICIAL
                   MOVE ZEROS               TO WRK-CH-CESTRT-DIC

               WHEN %Var5TIMelhoriasBookFuncional%-P-SEGUINTE
                   IF (%Var5TIMelhoriasBookFuncional%-PRI-CHAVE   GREATER %Var5TIMelhoriasBookFuncional%-ULT-CHAVE)
                       MOVE %Var5TIMelhoriasBookFuncional%-PRI-CESTRT-DIC
                                            TO WRK-CH-CESTRT-DIC
                   ELSE
                       MOVE %Var5TIMelhoriasBookFuncional%-ULT-CESTRT-DIC
                                            TO WRK-CH-CESTRT-DIC
                END-IF

               WHEN %Var5TIMelhoriasBookFuncional%-P-ANTERIOR
                   IF (%Var5TIMelhoriasBookFuncional%-PRI-CHAVE   GREATER %Var5TIMelhoriasBookFuncional%-ULT-CHAVE)
                       MOVE %Var5TIMelhoriasBookFuncional%-ULT-CESTRT-DIC
                                            TO WRK-CH-CESTRT-DIC
                   ELSE
                       MOVE %Var5TIMelhoriasBookFuncional%-PRI-CESTRT-DIC
                                            TO WRK-CH-CESTRT-DIC
                   END-IF

               WHEN %Var5TIMelhoriasBookFuncional%-P-ULTIMA
                   MOVE 999999999           TO WRK-CH-CESTRT-DIC

           END-EVALUATE.

      *----------------------------------------------------------------*
       1100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 2100-ABRIR-CURSOR.

           PERFORM 2200-LER-CURSOR.

           PERFORM VARYING IND-1       FROM    01  BY  01
                   UNTIL   IND-1       GREATER %Var5TIMelhoriasBookFuncional%-S-NUM-CONSULTAS
                   OR  WRK-FIM-CURSOR  EQUAL 'S'
               PERFORM 2300-FORMATAR-LISTA
               PERFORM 2200-LER-CURSOR
           END-PERFORM.

           PERFORM 2400-FECHAR-CURSOR.

      *----SE LISTA ESTIVER VAZIA RETORNA AO COORDENADOR
           IF (ACU-OCORRENCIAS         EQUAL     ZEROS)
               MOVE 08                 TO %Var0TIMelhoriasSistema%W000-COD-RETORNO
               MOVE '0010'             TO %Var0TIMelhoriasSistema%W000-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'         TO %Var0TIMelhoriasSistema%W000-COD-MENSAGEM
               PERFORM 3000-FINALIZAR
           END-IF.

      *----VALORIZANDO NUMERO DE CONSULTAS E PRIMEIRA E ULTIMA CHAVES
           MOVE ACU-OCORRENCIAS        TO %Var5TIMelhoriasBookFuncional%-S-NUM-CONSULTAS.
           MOVE %Var5TIMelhoriasBookFuncional%-S-CESTRT-DIC(1)
                                       TO %Var5TIMelhoriasBookFuncional%-PRI-CESTRT-DIC.
           MOVE %Var5TIMelhoriasBookFuncional%-S-CESTRT-DIC(ACU-OCORRENCIAS)
                                       TO %Var5TIMelhoriasBookFuncional%-ULT-CESTRT-DIC.

      *----SE HOUVER MAIS DADOS A SEREM LISTADOS COD-RETORNO = 01
           IF (WRK-FIM-CURSOR          EQUAL     'N')
               MOVE 01                 TO %Var0TIMelhoriasSistema%W000-COD-RETORNO
           ELSE
               MOVE 00                 TO %Var0TIMelhoriasSistema%W000-COD-RETORNO
           END-IF.

           MOVE '0000'                 TO %Var0TIMelhoriasSistema%W000-COD-ERRO.
           MOVE '%Var0TIMelhoriasSistema%0000'             TO %Var0TIMelhoriasSistema%W000-COD-MENSAGEM.

      *----------------------------------------------------------------*
       2000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2100-ABRIR-CURSOR               SECTION.
      *----------------------------------------------------------------*

           MOVE WRK-CH-CESTRT-DIC      TO CESTRT-DIC        OF %Var1Db2Dclgen%.

           IF (%Var5TIMelhoriasBookFuncional%-P-SENTIDO      EQUAL 'I' OR 'P' OR 'S')
               PERFORM 2110-ABRIR-CURSOR-ASC
           ELSE
               PERFORM 2120-ABRIR-CURSOR-DESC
           END-IF.

      *----------------------------------------------------------------*
       2110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2110-ABRIR-CURSOR-ASC           SECTION.
      *----------------------------------------------------------------*

           MOVE '2110-ABRIR-CURSOR-ASC'     TO WRK-PARAGRAFO.

           EXEC SQL
                OPEN CSR01-%Var1Db2Dclgen%
           END-EXEC.

           IF (SQLCODE                      NOT EQUAL ZEROS) OR
              (SQLWARN0                     EQUAL 'W')
               SET ERRO-DB2                 TO TRUE
               SET DB2-OPEN                 TO TRUE
               MOVE 16                      TO %Var0TIMelhoriasSistema%W000-COD-RETORNO
               MOVE '0020'                  TO %Var0TIMelhoriasSistema%W000-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO %Var0TIMelhoriasSistema%W000-COD-MENSAGEM
               MOVE '%Var2Db2Tabela%'        TO FRWKGDB2-NOME-TABELA
               PERFORM 9998-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       2110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2120-ABRIR-CURSOR-DESC          SECTION.
      *----------------------------------------------------------------*

           MOVE '2120-ABRIR-CURSOR-DESC'    TO WRK-PARAGRAFO.

           EXEC SQL
                OPEN CSR02-%Var1Db2Dclgen%
           END-EXEC.

           IF (SQLCODE                      NOT EQUAL ZEROS) OR
              (SQLWARN0                     EQUAL 'W')
               SET ERRO-DB2                 TO TRUE
               SET DB2-OPEN                 TO TRUE
               MOVE 16                      TO %Var0TIMelhoriasSistema%W000-COD-RETORNO
               MOVE '0030'                  TO %Var0TIMelhoriasSistema%W000-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO %Var0TIMelhoriasSistema%W000-COD-MENSAGEM
               MOVE '%Var2Db2Tabela%'        TO FRWKGDB2-NOME-TABELA
               PERFORM 9998-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       2120-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2200-LER-CURSOR                 SECTION.
      *----------------------------------------------------------------*

           IF (%Var5TIMelhoriasBookFuncional%-P-SENTIDO      EQUAL 'I' OR 'P' OR 'S')
               PERFORM 2210-LER-CURSOR-ASC
           ELSE
               PERFORM 2220-LER-CURSOR-DESC
           END-IF.

      *----------------------------------------------------------------*
       2200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2210-LER-CURSOR-ASC             SECTION.
      *----------------------------------------------------------------*

           MOVE '2210-LER-CURSOR-ASC'       TO WRK-PARAGRAFO.

           EXEC SQL
                FETCH  CSR01-%Var1Db2Dclgen%
                 INTO :%Var1Db2Dclgen%.CESTRT-DIC
                     ,:%Var1Db2Dclgen%.NVRSAO-ESTRT-DIC
                     ,:%Var1Db2Dclgen%.RFNALD-ESTRT
                     ,:%Var1Db2Dclgen%.DINIC-VGCIA-DIC
                     ,:%Var1Db2Dclgen%.DFIM-VGCIA-ESTRT
           END-EXEC.

           IF (SQLCODE                      NOT EQUAL ZEROS AND +100) OR
              (SQLWARN0                     EQUAL 'W')
               SET ERRO-DB2                 TO TRUE
               SET DB2-FETCH                TO TRUE
               MOVE 16                      TO %Var0TIMelhoriasSistema%W000-COD-RETORNO
               MOVE '0040'                  TO %Var0TIMelhoriasSistema%W000-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO %Var0TIMelhoriasSistema%W000-COD-MENSAGEM
               MOVE '%Var2Db2Tabela%'        TO FRWKGDB2-NOME-TABELA
               PERFORM 9998-TRATAR-ERRO
           END-IF.

           IF (SQLCODE                      EQUAL +100)
               MOVE 'S'                     TO WRK-FIM-CURSOR
           END-IF.

      *----------------------------------------------------------------*
       2210-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2220-LER-CURSOR-DESC            SECTION.
      *----------------------------------------------------------------*

           MOVE '2220-LER-CURSOR-DESC'      TO WRK-PARAGRAFO.

           EXEC SQL
                FETCH  CSR02-%Var1Db2Dclgen%
                 INTO :%Var1Db2Dclgen%.CESTRT-DIC
                     ,:%Var1Db2Dclgen%.NVRSAO-ESTRT-DIC
                     ,:%Var1Db2Dclgen%.RFNALD-ESTRT
                     ,:%Var1Db2Dclgen%.DINIC-VGCIA-DIC
                     ,:%Var1Db2Dclgen%.DFIM-VGCIA-ESTRT
           END-EXEC.

           IF (SQLCODE                      NOT EQUAL ZEROS AND +100) OR
              (SQLWARN0                     EQUAL 'W')
               SET ERRO-DB2                 TO TRUE
               SET DB2-FETCH                TO TRUE
               MOVE 16                      TO %Var0TIMelhoriasSistema%W000-COD-RETORNO
               MOVE '0050'                  TO %Var0TIMelhoriasSistema%W000-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO %Var0TIMelhoriasSistema%W000-COD-MENSAGEM
               MOVE '%Var2Db2Tabela%'        TO FRWKGDB2-NOME-TABELA
               PERFORM 9998-TRATAR-ERRO
           END-IF.

           IF (SQLCODE                      EQUAL +100)
               MOVE 'S'                     TO WRK-FIM-CURSOR
           END-IF.

      *----------------------------------------------------------------*
       2220-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2300-FORMATAR-LISTA             SECTION.
      *----------------------------------------------------------------*

           ADD 1                       TO ACU-OCORRENCIAS.

           MOVE CESTRT-DIC             OF %Var1Db2Dclgen%
                                       TO %Var5TIMelhoriasBookFuncional%-S-CESTRT-DIC(IND-1).

           MOVE NVRSAO-ESTRT-DIC       OF %Var1Db2Dclgen%
                                       TO %Var5TIMelhoriasBookFuncional%-S-NVRSAO-ESTRT-DIC
                                         (IND-1).

           MOVE RFNALD-ESTRT           OF %Var1Db2Dclgen%
                                       TO %Var5TIMelhoriasBookFuncional%-S-RFNALD-ESTRT
                                         (IND-1).

           MOVE DINIC-VGCIA-DIC        OF %Var1Db2Dclgen%
                                       TO %Var5TIMelhoriasBookFuncional%-S-DINIC-VGCIA(IND-1).

           MOVE DFIM-VGCIA-ESTRT       OF %Var1Db2Dclgen%
                                       TO %Var5TIMelhoriasBookFuncional%-S-DFIM-VGCIA(IND-1).

      *----------------------------------------------------------------*
       2300-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2400-FECHAR-CURSOR              SECTION.
      *----------------------------------------------------------------*

           IF (%Var5TIMelhoriasBookFuncional%-P-SENTIDO      EQUAL 'I' OR 'P' OR 'S')
               PERFORM 2410-FECHAR-CURSOR-ASC
           ELSE
               PERFORM 2420-FECHAR-CURSOR-DESC
           END-IF.

      *----------------------------------------------------------------*
       2130-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2410-FECHAR-CURSOR-ASC          SECTION.
      *----------------------------------------------------------------*

           MOVE '2410-FECHAR-CURSOR-ASC'    TO WRK-PARAGRAFO.

           EXEC SQL
                CLOSE CSR01-%Var1Db2Dclgen%
           END-EXEC.

           IF (SQLCODE                      NOT EQUAL ZEROS) OR
              (SQLWARN0                     EQUAL 'W')
               SET ERRO-DB2                 TO TRUE
               SET DB2-CLOSE                TO TRUE
               MOVE 16                      TO %Var0TIMelhoriasSistema%W000-COD-RETORNO
               MOVE '0060'                  TO %Var0TIMelhoriasSistema%W000-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO %Var0TIMelhoriasSistema%W000-COD-MENSAGEM
               MOVE '%Var2Db2Tabela%'        TO FRWKGDB2-NOME-TABELA
               PERFORM 9998-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       2410-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2420-FECHAR-CURSOR-DESC         SECTION.
      *----------------------------------------------------------------*

           MOVE '2420-FECHAR-CURSOR-DESC'   TO WRK-PARAGRAFO.

           EXEC SQL
                CLOSE CSR02-%Var1Db2Dclgen%
           END-EXEC.

           IF (SQLCODE                      NOT EQUAL ZEROS) OR
              (SQLWARN0                     EQUAL 'W')
               SET ERRO-DB2                 TO TRUE
               SET DB2-CLOSE                TO TRUE
               MOVE 16                      TO %Var0TIMelhoriasSistema%W000-COD-RETORNO
               MOVE '0070'                  TO %Var0TIMelhoriasSistema%W000-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO %Var0TIMelhoriasSistema%W000-COD-MENSAGEM
               MOVE '%Var2Db2Tabela%'        TO FRWKGDB2-NOME-TABELA
               PERFORM 9998-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       2420-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3000-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*

           EXEC CICS
                RETURN
           END-EXEC.

      *----------------------------------------------------------------*
       3000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9998-TRATAR-ERRO                SECTION.
      *----------------------------------------------------------------*

           MOVE WRK-PROGRAMA           TO FRWKGHEA-NOME-PROGRAMA.
           MOVE WRK-PARAGRAFO          TO FRWKGHEA-IDEN-PARAGRAFO.

           EVALUATE TRUE

               WHEN ERRO-DB2
                   MOVE FRWKGHEA-IDEN-PARAGRAFO(1:16)
                                              TO FRWKGDB2-LOCAL
                   MOVE FRWKGDB2-TAM-LAYOUT   TO FRWKGHEA-TAM-DADOS
                   MOVE SQLSTATE              TO FRWKGDB2-SQLSTATE
                   MOVE SQLCA                 TO FRWKGDB2-SQLCA
                   MOVE WRK-AREA-ERRO-DB2     TO WRK-BLOCO-INFO-ERRO
                                                 (1:FRWKGHEA-TAM-DADOS)

           END-EVALUATE.

           PERFORM 9999-CHAMAR-API-ERROS.

      *----------------------------------------------------------------*
       9998-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9999-CHAMAR-API-ERROS           SECTION.
      *----------------------------------------------------------------*

           EXEC CICS
                LINK
                PROGRAM  (WRK-FRWK1999)
                COMMAREA (WRK-AREA-ERRO)
                LENGTH   (LENGTH OF WRK-AREA-ERRO)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))
               CONTINUE
           END-IF.

           PERFORM 3000-FINALIZAR.

      *----------------------------------------------------------------*
       9999-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
;
[MODELO TI Melhorias Funcional Incluir/Alterar/Excluir/Consulta | ]
      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*

       PROGRAM-ID. |%Var1TIMelhoriasPrograma%.
       AUTHOR.     AUTOR.

      *================================================================*
      *                 P R I M E   I N F O R M A T I C A              *
      *----------------------------------------------------------------*
      *    PROGRAMA....:  %Var1TIMelhoriasPrograma%                                     *
      *    PROGRAMADOR.:  AUTOR                             -  PRIME   *
      *    ANALISTA....:  ANALISTA                          -  PRIME   *
      *    DATA........:  %Var2TIMelhoriasData%                                   *
      *----------------------------------------------------------------*
      *    OBJETIVO....:  FUNCIONAL P/ INCLUIR/ALTERAR/EXCLUIR         *
      *                   XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  *
      *----------------------------------------------------------------*
      *    BCO DE DADOS:                                               *
      *                TABLE                          INCLUDE/BOOK     *
      *                DB2PRD.XXXXXXXXXXXXXXXXXX        CCCCB000       *
      *----------------------------------------------------------------*
      *    BOOK'S......:                                               *
      *    %Var5TIMelhoriasBookFuncional% - DADOS DO FUNCIONAL P/ ALTERAR/EXCLUIR/INCLUIR XX *
      *    %Var0TIMelhoriasSistema%W000 - DADOS DE CONTROLE                                *
      *    I#FRWKGE - TRATAMENTO DE ERROS - GERAL                      *
      *    I#FRWKDB - TRATAMENTO DE ERROS - DB2                        *
      *----------------------------------------------------------------*
      *    MODULOS.....:                                               *
      *    FRWK1999 - GRAVACAO DE LOG DE ERROS                         *
      *================================================================*

      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*

       SPECIAL-NAMES.
           DECIMAL-POINT               IS   COMMA.

      *================================================================*
       DATA                            DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           'INICIO DA WORKING STORAGE SECTION'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           'VARIAVEIS AUXILIARES'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  WRK-PROGRAMA                PIC  X(008)         VALUE
           '%Var1TIMelhoriasPrograma%'.
       77  WRK-PARAGRAFO               PIC  X(030)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE COMUNICACAO DO PROGRAMA FRWK1999'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-FRWK1999                PIC  X(008)         VALUE
           'FRWK1999'.

       01  WRK-AREA-ERRO.
           COPY 'I#FRWKGE'.
           05 WRK-BLOCO-INFO-ERRO.
              10 WRK-CHAR-INFO-ERRO    PIC  X(001) OCCURS 0 TO 30000
                                       TIMES DEPENDING ON
                                       FRWKGHEA-TAM-DADOS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA DE ERRO DB2'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ERRO-DB2.
           COPY 'I#FRWKDB'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'AREA PARA DB2'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

           EXEC SQL
                INCLUDE SQLCA
           END-EXEC.

           EXEC SQL
                INCLUDE  %Var0TIMelhoriasSistema%B000
           END-EXEC.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           'FIM DA WORKING STORAGE SECTION'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *================================================================*
       LINKAGE                         SECTION.
      *================================================================*

       01  DFHCOMMAREA.
           COPY %Var0TIMelhoriasSistema%W000.
           COPY %Var5TIMelhoriasBookFuncional%.

      *================================================================*
       PROCEDURE                       DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       0000-PRINCIPAL                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 1000-INICIALIZAR.

           PERFORM 2000-PROCESSAR.

           PERFORM 3000-FINALIZAR.

      *----------------------------------------------------------------*
       0000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1000-INICIALIZAR                SECTION.
      *----------------------------------------------------------------*

           INITIALIZE FRWKGHEA-REGISTRO
                      FRWKGDB2-REGISTRO.

      *----------------------------------------------------------------*
       1000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 2100-EXCLUIR-REGISTRO.

           MOVE  ZEROS                 TO   %Var0TIMelhoriasSistema%W000-COD-RETORNO.
           MOVE '0000'                 TO   %Var0TIMelhoriasSistema%W000-COD-ERRO.
           MOVE '%Var0TIMelhoriasSistema%0000'             TO   %Var0TIMelhoriasSistema%W000-COD-MENSAGEM.

      *----------------------------------------------------------------*
       2000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2100-EXCLUIR-REGISTRO           SECTION.
      *----------------------------------------------------------------*

           MOVE '2100-EXCLUIR-REGISTRO'     TO WRK-PARAGRAFO.

           MOVE %Var5TIMelhoriasBookFuncional%-E-NU-COMPONENTE    TO NCOMPO-POSIC-GLOBL
                                            OF %Var0TIMelhoriasSistema%B000.

           EXEC SQL
                DELETE
                  FROM DB2PRD.TABELA
                 WHERE COL_1  = :%Var0TIMelhoriasSistema%B000.COL-1
           END-EXEC.

           IF (SQLCODE                      NOT EQUAL ZEROS AND +100) OR
              (SQLWARN0                     EQUAL     'W')
               SET ERRO-DB2                 TO TRUE
               SET DB2-DELETE               TO TRUE
               MOVE 16                      TO %Var0TIMelhoriasSistema%W000-COD-RETORNO
               MOVE '0010'                  TO %Var0TIMelhoriasSistema%W000-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO %Var0TIMelhoriasSistema%W000-COD-MENSAGEM
               MOVE 'TABELA'                TO FRWKGDB2-NOME-TABELA
               PERFORM 9998-TRATAR-ERRO
           END-IF.

           IF (SQLCODE                      EQUAL +100)
               MOVE  08                     TO %Var0TIMelhoriasSistema%W000-COD-RETORNO
               MOVE '0020'                  TO %Var0TIMelhoriasSistema%W000-COD-ERRO
               MOVE '%Var0TIMelhoriasSistema%0000'              TO %Var0TIMelhoriasSistema%W000-COD-MENSAGEM
               PERFORM 3000-FINALIZAR
           END-IF.

      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3000-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*

           EXEC CICS
                RETURN
           END-EXEC.

      *----------------------------------------------------------------*
       3000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      * CODIGOS DE RETORNO : ERRO-LIVRE=8, MODULO=12, CICS=16 E DB2=16 *
      *----------------------------------------------------------------*
       9998-TRATAR-ERRO                SECTION.
      *----------------------------------------------------------------*

           MOVE WRK-PROGRAMA           TO FRWKGHEA-NOME-PROGRAMA.
           MOVE WRK-PARAGRAFO          TO FRWKGHEA-IDEN-PARAGRAFO.

           EVALUATE TRUE

               WHEN ERRO-DB2
                   MOVE FRWKGHEA-IDEN-PARAGRAFO(1:16)
                                              TO FRWKGDB2-LOCAL
                   MOVE FRWKGDB2-TAM-LAYOUT   TO FRWKGHEA-TAM-DADOS
                   MOVE SQLSTATE              TO FRWKGDB2-SQLSTATE
                   MOVE SQLCA                 TO FRWKGDB2-SQLCA
                   MOVE WRK-AREA-ERRO-DB2     TO WRK-BLOCO-INFO-ERRO
                                                 (1:FRWKGHEA-TAM-DADOS)

           END-EVALUATE.

           PERFORM 9999-CHAMAR-API-ERROS.

      *----------------------------------------------------------------*
       9998-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9999-CHAMAR-API-ERROS           SECTION.
      *----------------------------------------------------------------*

           EXEC CICS
                LINK
                PROGRAM  (WRK-FRWK1999)
                COMMAREA (WRK-AREA-ERRO)
                LENGTH   (LENGTH OF WRK-AREA-ERRO)
                NOHANDLE
           END-EXEC.

           IF (EIBRESP                 NOT EQUAL DFHRESP(NORMAL))
               CONTINUE
           END-IF.

           PERFORM 3000-FINALIZAR.

      *----------------------------------------------------------------*
       9999-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
;
[MODELO TI Melhorias Batch c/ DB2 | ]
      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*

       PROGRAM-ID. |%Var1TIMelhoriasPrograma%.
       AUTHOR.     AUTOR.

      *================================================================*
      *                 P R I M E   I N F O R M A T I C A              *
      *----------------------------------------------------------------*
      *    PROGRAMA....:  %Var1TIMelhoriasPrograma%                                     *
      *    PROGRAMADOR.:  AUTOR                             -  PRIME   *
      *    ANALISTA....:  ANALISTA                          -  PRIME   *
      *    DATA........:  %VAR2MODELODATA%                                   *
      *----------------------------------------------------------------*
      *    OBJETIVO....:  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  *
      *                   XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  *
      *----------------------------------------------------------------*
      *    BCO DE DADOS:                                               *
      *                TABLE                          INCLUDE/BOOK     *
      *                DB2PRD.XXXXXXXXXXXXXXX           DCLGEN99       *
      *----------------------------------------------------------------*
      *    ARQUIVOS....:                                               *
      *                DDNAME           I/O           INCLUDE/BOOK     *
      *                ARQUIVO1          I              I#BOOK01       *
      *                ARQUIVO2          I              I#BOOK02       *
      *                ARQUIVO3          O              I#BOOK03       *
      *----------------------------------------------------------------*
      *    BOOK'S......:                                               *
      *    I#BOOK01 - DESCRICAO BOOK01                                 *
      *    I#BOOK02 - DESCRICAO BOOK02                                 *
      *    I#BOOK03 - DESCRICAO BOOK03                                 *
      *    I#FRWKGE - BOOK DE COMUNICACAO COM FRWK2999                 *
      *    I#FRWKAR - BOOK PARA TRATAMENTO DE ERROS DE ARQUIVOS        *
      *    I#FRWKDB - BOOK PARA TRATAMENTO DE ERROS DE DB2             *
      *    I#FRWKLI - BOOK PARA TRATAMENTO DE ERROS LIVRES             *
      *----------------------------------------------------------------*
      *    MODULOS.....:                                               *
      *    CKRS1000 - IDENTIFICA DINAMICAMENTE TIPO DE CONEXAO USADO   *
      *    CKRS1050 - CONEXAO COM DB2 VIA CAF E ABERTURA DO PLANO      *
      *    BRAD0450 - PROVOCAR ABEND COM OU SEM DUMP                   *
      *    FRWK2999 - GRAVAR LOG DE ERRO P/ BATCH                      *
      *================================================================*

      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*

       SPECIAL-NAMES.
           DECIMAL-POINT               IS   COMMA.

      *----------------------------------------------------------------*
       INPUT-OUTPUT                    SECTION.
      *----------------------------------------------------------------*

       FILE-CONTROL.

           SELECT ARQUIVO1 ASSIGN      TO   UT-S-ARQUIVO1
                      FILE STATUS      IS   WRK-FS-ARQUIVO1.

           SELECT ARQUIVO2 ASSIGN      TO   UT-S-ARQUIVO2
                      FILE STATUS      IS   WRK-FS-ARQUIVO2.

           SELECT ARQUIVO3 ASSIGN      TO   UT-S-ARQUIVO3
                      FILE STATUS      IS   WRK-FS-ARQUIVO3.

      *================================================================*
       DATA                            DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       FILE                            SECTION.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *   INPUT:   DESCRICAO ARQUIVO                                   *
      *            ORG. SEQUENCIAL     -   LRECL   =  0999             *
      *----------------------------------------------------------------*
       FD  ARQUIVO1
           RECORDING MODE IS F
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-ARQUIVO1                 PIC  X(999).

      *----------------------------------------------------------------*
      *   INPUT:   DESCRICAO ARQUIVO                                   *
      *            ORG. SEQUENCIAL     -   LRECL   =  0999             *
      *----------------------------------------------------------------*
       FD  ARQUIVO2
           RECORDING MODE IS F
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-ARQUIVO2                 PIC  X(999).

      *----------------------------------------------------------------*
      *   OUTPUT:  DESCRICAO ARQUIVO                                   *
      *            ORG. SEQUENCIAL     -   LRECL   =   999             *
      *----------------------------------------------------------------*
       FD  ARQUIVO3
           RECORDING MODE IS F
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-ARQUIVO3                 PIC  X(999).

      *----------------------------------------------------------------*
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)        VALUE
           '*** INICIO DA WORKING-STORAGE SECTION         ****'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ACUMULADORES                       ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  ACU-LIDOS-ARQUIVO1          PIC  9(009) COMP-3  VALUE ZEROS.
       77  ACU-LIDOS-ARQUIVO2          PIC  9(009) COMP-3  VALUE ZEROS.
       77  ACU-GRAVA-ARQUIVO3          PIC  9(009) COMP-3  VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE AUXILIARES                         ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  WRK-MASK-ACU                PIC  ZZZ.ZZZ.Z99    VALUE ZEROS.

       01  WRK-SQLCODE-AUX             PIC S9(009)         VALUE ZEROS.
       01  FILLER                      REDEFINES WRK-SQLCODE-AUX.
           05 FILLER                   PIC  9(006).
           05 WRK-SQLCODE-9-3          PIC S9(003).

       01  WRK-SQLCODE-MASK            PIC +9(003)         VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE TESTE DE FILE-STATUS               ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-FS-ARQUIVO1             PIC  X(002)         VALUE SPACES.
       01  WRK-FS-ARQUIVO2             PIC  X(002)         VALUE SPACES.
       01  WRK-FS-ARQUIVO3             PIC  X(002)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE CHAVES                             ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-CHAVE-ARQUIVO1.
           05 WRK-ARQUIVO1-AGENCIA     PIC  9(005)         VALUE ZEROS.
           05 WRK-ARQUIVO1-CONTA       PIC  9(013)         VALUE ZEROS.

       01  WRK-CHAVE-ARQUIVO2.
           05 WRK-ARQUIVO2-AGENCIA     PIC  9(005)         VALUE ZEROS.
           05 WRK-ARQUIVO2-CONTA       PIC  9(013)         VALUE ZEROS.

       01  WRK-CHAVE-ARQUIVO1-ANT      PIC  X(018)         VALUE ZEROS.
       01  WRK-CHAVE-ARQUIVO2-ANT      PIC  X(018)         VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ENTRADA ARQUIVO1                   ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BOOK01'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ENTRADA ARQUIVO2                   ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BOOK02'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE SAIDA ARQUIVO3                     ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BOOK03'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DO FRWK2999                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-FRWK2999                PIC  X(008)         VALUE
           'FRWK2999'.

       01  WRK-AREA-ERRO.
           COPY 'I#FRWKGE'.
           05 WRK-BLOCO-INFO-ERRO.
              10 WRK-CHAR-INFO-ERRO    PIC  X(001) OCCURS 0 TO 30000
                                       TIMES DEPENDING ON
                                       FRWKGHEA-TAM-DADOS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA P/ FORMATACAO DE ERRO DE ARQUIVO      ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ERRO-ARQUIVO.
           COPY 'I#FRWKAR'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA P/ FORMATACAO DE ERRO DE LIVRE        ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ERRO-LIVRE.
           COPY 'I#FRWKLI'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA PARA ERROS DB2                        ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ERRO-DB2.
           COPY 'I#FRWKDB'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA BRAD0450                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-BRAD0450.
           05 WRK-0450-ABEND-BAT       PIC S9(004)  COMP   VALUE +1111.
           05 WRK-0450-DUMP-BAT        PIC  X(001)         VALUE 'S'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA P/ INCLUDES DB2                       ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

           EXEC SQL
                INCLUDE SQLCA
           END-EXEC.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** FIM DA WORKING-STORAGE SECTION             ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *================================================================*
       PROCEDURE                       DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       0000-ROTINA-PRINCIPAL           SECTION.
      *----------------------------------------------------------------*

           PERFORM 1000-INICIALIZAR.

           PERFORM 2000-VERIFICAR-VAZIO.

           PERFORM 3000-PROCESSAR      UNTIL     WRK-CHAVE-ARQUIVO1
                                       EQUAL     HIGH-VALUES.

           PERFORM 4000-FINALIZAR.

      *----------------------------------------------------------------*
       0000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1000-INICIALIZAR                SECTION.
      *----------------------------------------------------------------*

           CALL 'CKRS1000'.
           CALL 'CKRS1050'.

           INITIALIZE FRWKGHEA-REGISTRO
                      FRWKGARQ-REGISTRO
                      FRWKGDB2-REGISTRO.

           MOVE '1000-INICIALIZAR'     TO FRWKGHEA-IDEN-PARAGRAFO.

           OPEN INPUT  ARQUIVO1
                       ARQUIVO2
               OUTPUT  ARQUIVO3.

           SET ARQ-OPEN                TO   TRUE.

           PERFORM 1100-TESTAR-FILE-STATUS.

           PERFORM 1200-OBTER-DADO-COMPLEMENTAR.

      *----------------------------------------------------------------*
       1000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1100-TESTAR-FILE-STATUS         SECTION.
      *----------------------------------------------------------------*

           PERFORM 1110-TESTAR-FS-ARQUIVO1.

           PERFORM 1120-TESTAR-FS-ARQUIVO2.

           PERFORM 1130-TESTAR-FS-ARQUIVO3.

      *----------------------------------------------------------------*
       1100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1110-TESTAR-FS-ARQUIVO1         SECTION.
      *----------------------------------------------------------------*

           IF  WRK-FS-ARQUIVO1         NOT EQUAL  '00'
               MOVE 'ARQUIVO1'         TO FRWKGARQ-NOME-ARQUIVO
               MOVE WRK-FS-ARQUIVO1    TO FRWKGARQ-FILE-STATUS
               PERFORM 9100-FORMATAR-ERRO-ARQUIVO
           END-IF.

      *----------------------------------------------------------------*
       1110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1120-TESTAR-FS-ARQUIVO2         SECTION.
      *----------------------------------------------------------------*

           IF  WRK-FS-ARQUIVO2         NOT EQUAL  '00'
               MOVE 'ARQUIVO2'         TO FRWKGARQ-NOME-ARQUIVO
               MOVE WRK-FS-ARQUIVO2    TO FRWKGARQ-FILE-STATUS
               PERFORM 9100-FORMATAR-ERRO-ARQUIVO
           END-IF.

      *----------------------------------------------------------------*
       1120-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1130-TESTAR-FS-ARQUIVO3         SECTION.
      *----------------------------------------------------------------*

           IF  WRK-FS-ARQUIVO3         NOT EQUAL  '00'
               MOVE 'ARQUIVO3'         TO FRWKGARQ-NOME-ARQUIVO
               MOVE WRK-FS-ARQUIVO3    TO FRWKGARQ-FILE-STATUS
               PERFORM 9100-FORMATAR-ERRO-ARQUIVO
           END-IF.

      *----------------------------------------------------------------*
       1130-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1200-OBTER-DADO-COMPLEMENTAR    SECTION.
      *----------------------------------------------------------------*

           MOVE '1200-OBTER-DADO-COMPLEMENTAR'
                                       TO FRWKGHEA-IDEN-PARAGRAFO.

           EXEC SQL
                SELECT  COL1
                       ,COL2
                  INTO :DCLGEN.COL1
                      ,:DCLGEN.COL2
                  FROM  DB2PRD.TABELA
                 WHERE  COL3  =  :DCLGEN.COL3
           END-EXEC.

           IF (SQLCODE                 NOT EQUAL ZEROS AND +100) OR
              (SQLWARN0                EQUAL     'W')
               SET  DB2-SELECT         TO TRUE
               MOVE 'TABELA'           TO FRWKGDB2-NOME-TABELA
               PERFORM 9200-FORMATAR-ERRO-DB2
           END-IF.

      *----------------------------------------------------------------*
       1200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2000-VERIFICAR-VAZIO            SECTION.
      *----------------------------------------------------------------*

           PERFORM 2100-LER-ARQUIVO1.

           IF (ACU-LIDOS-ARQUIVO1      EQUAL     ZEROS)
               DISPLAY '************ %Var1TIMelhoriasPrograma% ************'
               DISPLAY '*                                *'
               DISPLAY '*     ARQUIVO ARQUIVO1 VAZIO     *'
               DISPLAY '*       PROGRAMA ENCERRADO       *'
               DISPLAY '*                                *'
               DISPLAY '************ %Var1TIMelhoriasPrograma% ************'
               PERFORM 4000-FINALIZAR
           END-IF.

           PERFORM 2200-LER-ARQUIVO2.

           IF (ACU-LIDOS-ARQUIVO2      EQUAL     ZEROS)
               DISPLAY '************ %Var1TIMelhoriasPrograma% ************'
               DISPLAY '*                                *'
               DISPLAY '*     ARQUIVO ARQUIVO2 VAZIO     *'
               DISPLAY '*                                *'
               DISPLAY '************ %Var1TIMelhoriasPrograma% ************'
           END-IF.

      *----------------------------------------------------------------*
       2000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2100-LER-ARQUIVO1               SECTION.
      *----------------------------------------------------------------*

           MOVE '2100-LER-ARQUIVO1'    TO   FRWKGHEA-IDEN-PARAGRAFO.

           READ ARQUIVO1               INTO BOOK01-REG.

           IF WRK-FS-ARQUIVO1          EQUAL     '10'
               MOVE HIGH-VALUES        TO   WRK-CHAVE-ARQUIVO1
           ELSE
               SET ARQ-READ            TO   TRUE
               PERFORM 1110-TESTAR-FS-ARQUIVO1
               ADD  1                  TO   ACU-LIDOS-ARQUIVO1
               PERFORM 2110-MONTAR-CHAVE-ARQUIVO1
               PERFORM 2120-TESTAR-SEQUENCIA-ARQUIVO1
           END-IF.

      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2110-MONTAR-CHAVE-ARQUIVO1      SECTION.
      *----------------------------------------------------------------*

           MOVE BOOK01-AGENCIA         TO   WRK-ARQUIVO1-AGENCIA.
           MOVE BOOK01-CONTA           TO   WRK-ARQUIVO1-CONTA.

      *----------------------------------------------------------------*
       2110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2120-TESTAR-SEQUENCIA-ARQUIVO1  SECTION.
      *----------------------------------------------------------------*

           MOVE '2120-TESTAR-SEQUENCIA-ARQUIVO1'
                                       TO   FRWKGHEA-IDEN-PARAGRAFO.

           IF (WRK-CHAVE-ARQUIVO1      LESS WRK-CHAVE-ARQUIVO1-ANT)
               DISPLAY '**************** %Var1TIMelhoriasPrograma% ****************'
               DISPLAY '*                                        *'
               DISPLAY '*            ARQUIVO ARQUIVO1            *'
               DISPLAY '*            FORA DE SEQUENCIA           *'
               DISPLAY '*         PROCESSAMENTO ENCERRADO        *'
               DISPLAY '* CHAVE ATU : '  WRK-CHAVE-ARQUIVO1
                       '         *'
               DISPLAY '* CHAVE ANT : '  WRK-CHAVE-ARQUIVO1-ANT
                       '         *'
               DISPLAY '*                                        *'
               DISPLAY '**************** %Var1TIMelhoriasPrograma% ****************'
               MOVE SPACES             TO   FRWKGLIV-COD-MENSAGEM
               MOVE 'ARQUIVO ARQUIVO1 FORA DE SEQUENCIA'
                                       TO   FRWKGLIV-PARAMETROS
               PERFORM 9300-FORMATAR-ERRO-LIVRE
           ELSE
               MOVE WRK-CHAVE-ARQUIVO1 TO   WRK-CHAVE-ARQUIVO1-ANT
           END-IF.

      *----------------------------------------------------------------*
       2120-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2200-LER-ARQUIVO2               SECTION.
      *----------------------------------------------------------------*

           MOVE '2200-LER-ARQUIVO2'    TO   FRWKGHEA-IDEN-PARAGRAFO.

           READ ARQUIVO2               INTO   BOOK02-REG.

           IF WRK-FS-ARQUIVO2          EQUAL     '10'
               MOVE HIGH-VALUES        TO   WRK-CHAVE-ARQUIVO2
           ELSE
               SET ARQ-READ            TO   TRUE
               PERFORM 1120-TESTAR-FS-ARQUIVO2
               ADD  1                  TO   ACU-LIDOS-ARQUIVO2
               PERFORM 2210-MONTAR-CHAVE-ARQUIVO2
               PERFORM 2220-TESTAR-SEQUENCIA-ARQUIVO2
           END-IF.

      *----------------------------------------------------------------*
       2200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2210-MONTAR-CHAVE-ARQUIVO2      SECTION.
      *----------------------------------------------------------------*

           MOVE BOOK02-AGENCIA         TO   WRK-ARQUIVO2-AGENCIA.
           MOVE BOOK02-CONTA           TO   WRK-ARQUIVO2-CONTA.

      *----------------------------------------------------------------*
       2210-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2220-TESTAR-SEQUENCIA-ARQUIVO2  SECTION.
      *----------------------------------------------------------------*

           MOVE '2220-TESTAR-SEQUENCIA-ARQUIVO2'
                                       TO   FRWKGHEA-IDEN-PARAGRAFO.

           IF (WRK-CHAVE-ARQUIVO2      LESS WRK-CHAVE-ARQUIVO2-ANT)
               DISPLAY '**************** %Var1TIMelhoriasPrograma% ****************'
               DISPLAY '*                                        *'
               DISPLAY '*            ARQUIVO ARQUIVO2            *'
               DISPLAY '*            FORA DE SEQUENCIA           *'
               DISPLAY '*         PROCESSAMENTO ENCERRADO        *'
               DISPLAY '* CHAVE ATU : '  WRK-CHAVE-ARQUIVO2
                       '         *'
               DISPLAY '* CHAVE ANT : '  WRK-CHAVE-ARQUIVO2-ANT
                       '         *'
               DISPLAY '*                                        *'
               DISPLAY '**************** %Var1TIMelhoriasPrograma% ****************'
               MOVE SPACES             TO   FRWKGLIV-COD-MENSAGEM
               MOVE 'ARQUIVO ARQUIVO2 FORA DE SEQUENCIA'
                                       TO   FRWKGLIV-PARAMETROS
               PERFORM 9300-FORMATAR-ERRO-LIVRE
           ELSE
               MOVE WRK-CHAVE-ARQUIVO2 TO   WRK-CHAVE-ARQUIVO2-ANT
           END-IF.

      *----------------------------------------------------------------*
       2220-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*

           IF (WRK-CHAVE-ARQUIVO1      EQUAL     WRK-CHAVE-ARQUIVO2)
               PERFORM 3100-GRAVAR-ARQUIVO3
               PERFORM 2100-LER-ARQUIVO1
               PERFORM 2200-LER-ARQUIVO2
           ELSE
               IF (WRK-CHAVE-ARQUIVO1  GREATER   WRK-CHAVE-ARQUIVO2)
                   PERFORM 2200-LER-ARQUIVO2
               ELSE
                   PERFORM 2100-LER-ARQUIVO1
               END-IF
           END-IF.

      *----------------------------------------------------------------*
       3000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3100-GRAVAR-ARQUIVO3            SECTION.
      *----------------------------------------------------------------*

           PERFORM 3110-MOVER-CAMPOS-ARQUIVO3.

           MOVE '3100-GRAVAR-ARQUIVO3' TO FRWKGHEA-IDEN-PARAGRAFO.

           SET ARQ-WRITE               TO TRUE

           WRITE FD-ARQUIVO3           FROM BOOK03-REG.

           PERFORM 1130-TESTAR-FS-ARQUIVO3.

           ADD 1                       TO ACU-GRAVA-ARQUIVO3.

      *----------------------------------------------------------------*
       3100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3110-MOVER-CAMPOS-ARQUIVO3      SECTION.
      *----------------------------------------------------------------*

           INITIALIZE BOOK03-REG.

           MOVE BOOK01-REG             TO   BOOK03-REG.

           MOVE BOOK02-CAMPO           TO   BOOK03-CAMPO.

      *----------------------------------------------------------------*
       3110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       4000-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*

           MOVE '4000-FINALIZAR'       TO FRWKGHEA-IDEN-PARAGRAFO.

           CLOSE ARQUIVO1
                 ARQUIVO2
                 ARQUIVO3.

           SET ARQ-CLOSE               TO   TRUE.

           PERFORM 1100-TESTAR-FILE-STATUS.

           DISPLAY '************ %Var1TIMelhoriasPrograma% ************'.
           DISPLAY '*                                *'.
           DISPLAY '* PROGRAMA ENCERRADO COM SUCESSO *'.
           DISPLAY '*                                *'.
           DISPLAY '*                                *'.
           DISPLAY '************ %Var1TIMelhoriasPrograma% ************'.

           PERFORM 4100-EMITIR-TOTAIS.

           STOP RUN.

      *----------------------------------------------------------------*
       4000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       4100-EMITIR-TOTAIS              SECTION.
      *----------------------------------------------------------------*

           DISPLAY '******************** %Var1TIMelhoriasPrograma% ********************'.
           DISPLAY '*                                                *'.

           MOVE ACU-LIDOS-ARQUIVO1     TO   WRK-MASK-ACU.
           DISPLAY '* TOTAL LIDOS ARQUIVO1.............: '
                      WRK-MASK-ACU ' *'.

           MOVE ACU-LIDOS-ARQUIVO2     TO   WRK-MASK-ACU.
           DISPLAY '* TOTAL LIDOS ARQUIVO2.............: '
                      WRK-MASK-ACU ' *'.

           MOVE ACU-GRAVA-ARQUIVO3     TO   WRK-MASK-ACU.
           DISPLAY '* TOTAL GRAVADOS ARQUIVO3..........: '
                      WRK-MASK-ACU ' *'.

           DISPLAY '*                                                *'.
           DISPLAY '******************** %Var1TIMelhoriasPrograma% ********************'.

      *----------------------------------------------------------------*
       4100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9100-FORMATAR-ERRO-ARQUIVO      SECTION.
      *----------------------------------------------------------------*

           SET ERRO-ARQUIVO            TO TRUE.

           MOVE FRWKGARQ-TAM-LAYOUT    TO FRWKGHEA-TAM-DADOS.
           MOVE WRK-AREA-ERRO-ARQUIVO  TO WRK-BLOCO-INFO-ERRO
                                          (1:FRWKGHEA-TAM-DADOS).

           DISPLAY ' '.
           DISPLAY 'FRWKGARQ-FILE-STATUS   = ' FRWKGARQ-FILE-STATUS.
           DISPLAY 'FRWKGARQ-NOME-ARQUIVO  = ' FRWKGARQ-NOME-ARQUIVO.
           DISPLAY 'FRWKGARQ-COMANDO       = ' FRWKGARQ-COMANDO.

           PERFORM 9900-TRATAR-ERRO.

      *----------------------------------------------------------------*
       9100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9200-FORMATAR-ERRO-DB2          SECTION.
      *----------------------------------------------------------------*

           SET ERRO-DB2                TO   TRUE.

           MOVE FRWKGDB2-TAM-LAYOUT    TO   FRWKGHEA-TAM-DADOS.
           MOVE FRWKGHEA-IDEN-PARAGRAFO(1:16)
                                       TO   FRWKGDB2-LOCAL.
           MOVE SQLSTATE               TO   FRWKGDB2-SQLSTATE.
           MOVE SQLCA                  TO   FRWKGDB2-SQLCA.
           MOVE SQLCODE                TO   WRK-SQLCODE-AUX.
           MOVE WRK-SQLCODE-9-3        TO   FRWKGDB2-SQLCODE2
                                            WRK-SQLCODE-MASK.
           MOVE WRK-AREA-ERRO-DB2      TO   WRK-BLOCO-INFO-ERRO
                                                 (1:FRWKGHEA-TAM-DADOS).

           DISPLAY ' '.
           DISPLAY 'FRWKGDB2-NOME-TABELA  = ' FRWKGDB2-NOME-TABELA.
           DISPLAY 'FRWKGDB2-COMANDO-DB2  = ' FRWKGDB2-COMANDO-DB2.
           DISPLAY 'FRWKGDB2-LOCAL        = ' FRWKGDB2-LOCAL.
           DISPLAY 'FRWKGDB2-SQLCODE2     = ' WRK-SQLCODE-MASK.
           DISPLAY ' '.

           PERFORM 9900-TRATAR-ERRO.

      *----------------------------------------------------------------*
       9200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9300-FORMATAR-ERRO-LIVRE        SECTION.
      *----------------------------------------------------------------*

           SET ERRO-LIVRE               TO   TRUE.

           MOVE 1                      TO   FRWKGLIV-IDIOMA.
           MOVE FRWKGLIV-TAM-LAYOUT    TO   FRWKGHEA-TAM-DADOS.
           MOVE WRK-AREA-ERRO-LIVRE    TO   WRK-BLOCO-INFO-ERRO
                                            (1:FRWKGHEA-TAM-DADOS).

           DISPLAY ' '.
           DISPLAY 'FRWKGLIV-IDIOMA       = ' FRWKGLIV-IDIOMA.
           DISPLAY 'FRWKGLIV-COD-MENSAGEM = ' FRWKGLIV-COD-MENSAGEM.
           DISPLAY 'FRWKGLIV-PARAMETROS   = ' FRWKGLIV-PARAMETROS.
           DISPLAY ' '.

           PERFORM 9900-TRATAR-ERRO.

      *----------------------------------------------------------------*
       9200-FORMATAR-ERRO-LIVRE-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9900-TRATAR-ERRO                SECTION.
      *----------------------------------------------------------------*

           MOVE '%Var1TIMelhoriasPrograma%'             TO FRWKGHEA-NOME-PROGRAMA.

           PERFORM 4100-EMITIR-TOTAIS.

           PERFORM 9990-GRAVAR-LOG-ERRO.

           PERFORM 9999-ABENDAR-PROGRAMA.

           GOBACK.

      *----------------------------------------------------------------*
       9900-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9990-GRAVAR-LOG-ERRO            SECTION.
      *----------------------------------------------------------------*

           DISPLAY '*** FRWK2999 CHAMADO. SEGUEM SEUS PARAMETROS ***'.
           DISPLAY ' '.
           DISPLAY 'FRWKGHEA-TIPO-ERRO      = ' FRWKGHEA-TIPO-ERRO.
           DISPLAY 'FRWKGHEA-NOME-PROGRAMA  = ' FRWKGHEA-NOME-PROGRAMA.
           DISPLAY 'FRWKGHEA-IDEN-PARAGRAFO = ' FRWKGHEA-IDEN-PARAGRAFO.
           DISPLAY 'FRWKGHEA-TAM-DADOS      = ' FRWKGHEA-TAM-DADOS.

           CALL WRK-FRWK2999           USING WRK-AREA-ERRO.

           DISPLAY '*** PARAMETROS RETORNADOS PELO FRWK2999 ***'.
           DISPLAY 'FRWKGERR-COD-RETORNO    = ' FRWKGERR-COD-RETORNO.
           DISPLAY 'FRWKGERR-COD-ERRO       = ' FRWKGERR-COD-ERRO.
           DISPLAY 'FRWKGERR-COD-MENSAGEM   = ' FRWKGERR-COD-MENSAGEM.

      *----------------------------------------------------------------*
       9990-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9999-ABENDAR-PROGRAMA           SECTION.
      *----------------------------------------------------------------*

           DISPLAY '*** BRAD0450 CHAMADO PARA ABENDAR O PROGRAMA ***'.
           DISPLAY ' '.

           CALL 'BRAD0450'             USING WRK-0450-ABEND-BAT
                                             WRK-0450-DUMP-BAT.

      *----------------------------------------------------------------*
       9999-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
;
[MODELO TI Melhorias Balance-line c/ 2 Arquivos | ]
      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*

       PROGRAM-ID. |%Var1TIMelhoriasPrograma%.
       AUTHOR.     AUTOR.

      *================================================================*
      *                 P R I M E   I N F O R M A T I C A              *
      *----------------------------------------------------------------*
      *    PROGRAMA....:  %Var1TIMelhoriasPrograma%                                     *
      *    PROGRAMADOR.:  AUTOR                             -  PRIME   *
      *    ANALISTA....:  ANALISTA                          -  PRIME   *
      *    DATA........:  %VAR2MODELODATA%                                   *
      *----------------------------------------------------------------*
      *    OBJETIVO....:  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  *
      *                   XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  *
      *----------------------------------------------------------------*
      *    ARQUIVOS....:                                               *
      *                DDNAME           I/O           INCLUDE/BOOK     *
      *                %VAR3MODELOARQENT1%          I              I#BOOK01       *
      *                %VAR4MODELOARQENT2%          I              I#BOOK02       *
      *                %VAR5MODELOARQSAI1%          O              I#BOOK03       *
      *----------------------------------------------------------------*
      *    BOOK'S......:                                               *
      *    I#BOOK01 - DESCRICAO BOOK01                                 *
      *    I#BOOK02 - DESCRICAO BOOK02                                 *
      *    I#BOOK03 - DESCRICAO BOOK03                                 *
      *    I#FRWKGE - BOOK DE COMUNICACAO COM FRWK2999                 *
      *    I#FRWKAR - BOOK PARA TRATAMENTO DE ERROS DE ARQUIVOS        *
      *    I#FRWKLI - BOOK PARA TRATAMENTO DE ERROS LIVRES             *
      *----------------------------------------------------------------*
      *    MODULOS.....:                                               *
      *    CKRS1000 - IDENTIFICA DINAMICAMENTE TIPO DE CONEXAO USADO   *
      *    CKRS1050 - CONEXAO COM DB2 VIA CAF E ABERTURA DO PLANO      *
      *    BRAD0450 - PROVOCAR ABEND COM OU SEM DUMP                   *
      *    FRWK2999 - GRAVAR LOG DE ERRO P/ BATCH                      *
      *================================================================*

      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*

       SPECIAL-NAMES.
           DECIMAL-POINT               IS   COMMA.

      *----------------------------------------------------------------*
       INPUT-OUTPUT                    SECTION.
      *----------------------------------------------------------------*

       FILE-CONTROL.

           SELECT %VAR3MODELOARQENT1% ASSIGN      TO   UT-S-%VAR3MODELOARQENT1%
                      FILE STATUS      IS   WRK-FS-%VAR3MODELOARQENT1%.

           SELECT %VAR4MODELOARQENT2% ASSIGN      TO   UT-S-%VAR4MODELOARQENT2%
                      FILE STATUS      IS   WRK-FS-%VAR4MODELOARQENT2%.

           SELECT %VAR5MODELOARQSAI1% ASSIGN      TO   UT-S-%VAR5MODELOARQSAI1%
                      FILE STATUS      IS   WRK-FS-%VAR5MODELOARQSAI1%.

      *================================================================*
       DATA                            DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       FILE                            SECTION.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *   INPUT:   DESCRICAO ARQUIVO                                   *
      *            ORG. SEQUENCIAL     -   LRECL   =  0999             *
      *----------------------------------------------------------------*
       FD  %VAR3MODELOARQENT1%
           RECORDING MODE IS F
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-%VAR3MODELOARQENT1%                 PIC  X(999).

      *----------------------------------------------------------------*
      *   INPUT:   DESCRICAO ARQUIVO                                   *
      *            ORG. SEQUENCIAL     -   LRECL   =  0999             *
      *----------------------------------------------------------------*
       FD  %VAR4MODELOARQENT2%
           RECORDING MODE IS F
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-%VAR4MODELOARQENT2%                 PIC  X(999).

      *----------------------------------------------------------------*
      *   OUTPUT:  DESCRICAO ARQUIVO                                   *
      *            ORG. SEQUENCIAL     -   LRECL   =   999             *
      *----------------------------------------------------------------*
       FD  %VAR5MODELOARQSAI1%
           RECORDING MODE IS F
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-%VAR5MODELOARQSAI1%                 PIC  X(999).

      *----------------------------------------------------------------*
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)        VALUE
           '*** INICIO DA WORKING-STORAGE SECTION         ****'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ACUMULADORES                       ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  ACU-LIDOS-%VAR3MODELOARQENT1%          PIC  9(009) COMP-3  VALUE ZEROS.
       77  ACU-LIDOS-%VAR4MODELOARQENT2%          PIC  9(009) COMP-3  VALUE ZEROS.
       77  ACU-GRAVA-%VAR5MODELOARQSAI1%          PIC  9(009) COMP-3  VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE AUXILIARES                         ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  WRK-MASK-ACU                PIC  ZZZ.ZZZ.Z99    VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE TESTE DE FILE-STATUS               ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  WRK-FS-%VAR3MODELOARQENT1%             PIC  X(002)         VALUE SPACES.
       77  WRK-FS-%VAR4MODELOARQENT2%             PIC  X(002)         VALUE SPACES.
       77  WRK-FS-%VAR5MODELOARQSAI1%             PIC  X(002)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE CHAVES                             ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-CHAVE-%VAR3MODELOARQENT1%.
           05 WRK-%VAR3MODELOARQENT1%-AGENCIA     PIC  9(005)         VALUE ZEROS.
           05 WRK-%VAR3MODELOARQENT1%-CONTA       PIC  9(013)         VALUE ZEROS.

       01  WRK-CHAVE-%VAR4MODELOARQENT2%.
           05 WRK-%VAR4MODELOARQENT2%-AGENCIA     PIC  9(005)         VALUE ZEROS.
           05 WRK-%VAR4MODELOARQENT2%-CONTA       PIC  9(013)         VALUE ZEROS.

       01  WRK-CHAVE-%VAR3MODELOARQENT1%-ANT      PIC  X(018)         VALUE ZEROS.
       01  WRK-CHAVE-%VAR4MODELOARQENT2%-ANT      PIC  X(018)         VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ENTRADA %VAR3MODELOARQENT1%                   ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BOOK01'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ENTRADA %VAR4MODELOARQENT2%                   ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BOOK02'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE SAIDA %VAR5MODELOARQSAI1%                     ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BOOK03'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DO FRWK2999                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-FRWK2999                PIC  X(008)         VALUE
           'FRWK2999'.

       01  WRK-AREA-ERRO.
           COPY 'I#FRWKGE'.
           05 WRK-BLOCO-INFO-ERRO.
              10 WRK-CHAR-INFO-ERRO    PIC  X(001) OCCURS 0 TO 30000
                                       TIMES DEPENDING ON
                                       FRWKGHEA-TAM-DADOS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA P/ FORMATACAO DE ERRO DE ARQUIVO      ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ERRO-ARQUIVO.
           COPY 'I#FRWKAR'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA P/ FORMATACAO DE ERRO DE LIVRE        ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-ERRO-LIVRE.
           COPY 'I#FRWKLI'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA BRAD0450                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-BRAD0450.
           05 WRK-0450-ABEND-BAT       PIC S9(004)  COMP   VALUE +1111.
           05 WRK-0450-DUMP-BAT        PIC  X(001)         VALUE 'S'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** FIM DA WORKING-STORAGE SECTION             ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *================================================================*
       PROCEDURE                       DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       0000-ROTINA-PRINCIPAL           SECTION.
      *----------------------------------------------------------------*

           PERFORM 1000-INICIALIZAR.

           PERFORM 2000-VERIFICAR-VAZIO.

           PERFORM 3000-PROCESSAR      UNTIL     WRK-CHAVE-%VAR3MODELOARQENT1%
                                       EQUAL     HIGH-VALUES.

           PERFORM 4000-FINALIZAR.

      *----------------------------------------------------------------*
       0000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1000-INICIALIZAR                SECTION.
      *----------------------------------------------------------------*

           CALL 'CKRS1000'.
           CALL 'CKRS1050'.

           INITIALIZE FRWKGHEA-REGISTRO
                      FRWKGARQ-REGISTRO.

           MOVE '1000-INICIALIZAR'     TO FRWKGHEA-IDEN-PARAGRAFO.

           OPEN INPUT  %VAR3MODELOARQENT1%
                       %VAR4MODELOARQENT2%
               OUTPUT  %VAR5MODELOARQSAI1%.

           SET ARQ-OPEN                TO   TRUE.

           PERFORM 1100-TESTAR-FILE-STATUS.

      *----------------------------------------------------------------*
       1000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1100-TESTAR-FILE-STATUS         SECTION.
      *----------------------------------------------------------------*

           PERFORM 1110-TESTAR-FS-%VAR3MODELOARQENT1%.

           PERFORM 1120-TESTAR-FS-%VAR4MODELOARQENT2%.

           PERFORM 1130-TESTAR-FS-%VAR5MODELOARQSAI1%.

      *----------------------------------------------------------------*
       1100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1110-TESTAR-FS-%VAR3MODELOARQENT1%         SECTION.
      *----------------------------------------------------------------*

           IF  WRK-FS-%VAR3MODELOARQENT1%         NOT EQUAL  '00'
               MOVE '%VAR3MODELOARQENT1%'         TO FRWKGARQ-NOME-ARQUIVO
               MOVE WRK-FS-%VAR3MODELOARQENT1%    TO FRWKGARQ-FILE-STATUS
               PERFORM 9100-FORMATAR-ERRO-ARQUIVO
           END-IF.

      *----------------------------------------------------------------*
       1110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1120-TESTAR-FS-%VAR4MODELOARQENT2%         SECTION.
      *----------------------------------------------------------------*

           IF  WRK-FS-%VAR4MODELOARQENT2%         NOT EQUAL  '00'
               MOVE '%VAR4MODELOARQENT2%'         TO FRWKGARQ-NOME-ARQUIVO
               MOVE WRK-FS-%VAR4MODELOARQENT2%    TO FRWKGARQ-FILE-STATUS
               PERFORM 9100-FORMATAR-ERRO-ARQUIVO
           END-IF.

      *----------------------------------------------------------------*
       1120-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1130-TESTAR-FS-%VAR5MODELOARQSAI1%         SECTION.
      *----------------------------------------------------------------*

           IF  WRK-FS-%VAR5MODELOARQSAI1%         NOT EQUAL  '00'
               MOVE '%VAR5MODELOARQSAI1%'         TO FRWKGARQ-NOME-ARQUIVO
               MOVE WRK-FS-%VAR5MODELOARQSAI1%    TO FRWKGARQ-FILE-STATUS
               PERFORM 9100-FORMATAR-ERRO-ARQUIVO
           END-IF.

      *----------------------------------------------------------------*
       1130-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2000-VERIFICAR-VAZIO            SECTION.
      *----------------------------------------------------------------*

           PERFORM 2100-LER-%VAR3MODELOARQENT1%.

           IF (ACU-LIDOS-%VAR3MODELOARQENT1%      EQUAL     ZEROS)
               DISPLAY '************ %Var1TIMelhoriasPrograma% ************'
               DISPLAY '*                                *'
               DISPLAY '*     ARQUIVO %VAR3MODELOARQENT1% VAZIO     *'
               DISPLAY '*       PROGRAMA ENCERRADO       *'
               DISPLAY '*                                *'
               DISPLAY '************ %Var1TIMelhoriasPrograma% ************'
               PERFORM 4000-FINALIZAR
           END-IF.

           PERFORM 2200-LER-%VAR4MODELOARQENT2%.

           IF (ACU-LIDOS-%VAR4MODELOARQENT2%      EQUAL     ZEROS)
               DISPLAY '************ %Var1TIMelhoriasPrograma% ************'
               DISPLAY '*                                *'
               DISPLAY '*     ARQUIVO %VAR4MODELOARQENT2% VAZIO     *'
               DISPLAY '*                                *'
               DISPLAY '************ %Var1TIMelhoriasPrograma% ************'
           END-IF.

      *----------------------------------------------------------------*
       2000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2100-LER-%VAR3MODELOARQENT1%               SECTION.
      *----------------------------------------------------------------*

           MOVE '2100-LER-%VAR3MODELOARQENT1%'    TO   FRWKGHEA-IDEN-PARAGRAFO.

           READ %VAR3MODELOARQENT1%               INTO BOOK01-REG.

           IF WRK-FS-%VAR3MODELOARQENT1%          EQUAL     '10'
               MOVE HIGH-VALUES        TO   WRK-CHAVE-%VAR3MODELOARQENT1%
           ELSE
               SET ARQ-READ            TO   TRUE
               PERFORM 1110-TESTAR-FS-%VAR3MODELOARQENT1%
               ADD  1                  TO   ACU-LIDOS-%VAR3MODELOARQENT1%
               PERFORM 2110-MONTAR-CHAVE-%VAR3MODELOARQENT1%
               PERFORM 2120-TESTAR-SEQUENCIA-%VAR3MODELOARQENT1%
           END-IF.

      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2110-MONTAR-CHAVE-%VAR3MODELOARQENT1%      SECTION.
      *----------------------------------------------------------------*

           MOVE BOOK01-AGENCIA         TO   WRK-%VAR3MODELOARQENT1%-AGENCIA.
           MOVE BOOK01-CONTA           TO   WRK-%VAR3MODELOARQENT1%-CONTA.

      *----------------------------------------------------------------*
       2110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2120-TESTAR-SEQUENCIA-%VAR3MODELOARQENT1%  SECTION.
      *----------------------------------------------------------------*

           MOVE '2120-TESTAR-SEQUENCIA-%VAR3MODELOARQENT1%'
                                       TO   FRWKGHEA-IDEN-PARAGRAFO.

           IF (WRK-CHAVE-%VAR3MODELOARQENT1%      LESS WRK-CHAVE-%VAR3MODELOARQENT1%-ANT)
               DISPLAY '**************** %Var1TIMelhoriasPrograma% ****************'
               DISPLAY '*                                        *'
               DISPLAY '*            ARQUIVO %VAR3MODELOARQENT1%            *'
               DISPLAY '*            FORA DE SEQUENCIA           *'
               DISPLAY '*         PROCESSAMENTO ENCERRADO        *'
               DISPLAY '* CHAVE ATU : '  WRK-CHAVE-%VAR3MODELOARQENT1%
                       '         *'
               DISPLAY '* CHAVE ANT : '  WRK-CHAVE-%VAR3MODELOARQENT1%-ANT
                       '         *'
               DISPLAY '*                                        *'
               DISPLAY '**************** %Var1TIMelhoriasPrograma% ****************'
               MOVE SPACES             TO   FRWKGLIV-COD-MENSAGEM
               MOVE 'ARQUIVO %VAR3MODELOARQENT1% FORA DE SEQUENCIA'
                                       TO   FRWKGLIV-PARAMETROS
               PERFORM 9200-FORMATAR-ERRO-LIVRE
           ELSE
               MOVE WRK-CHAVE-%VAR3MODELOARQENT1% TO   WRK-CHAVE-%VAR3MODELOARQENT1%-ANT
           END-IF.

      *----------------------------------------------------------------*
       2120-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2200-LER-%VAR4MODELOARQENT2%               SECTION.
      *----------------------------------------------------------------*

           MOVE '2200-LER-%VAR4MODELOARQENT2%'    TO   FRWKGHEA-IDEN-PARAGRAFO.

           READ %VAR4MODELOARQENT2%               INTO   BOOK02-REG.

           IF WRK-FS-%VAR4MODELOARQENT2%          EQUAL     '10'
               MOVE HIGH-VALUES        TO   WRK-CHAVE-%VAR4MODELOARQENT2%
           ELSE
               SET ARQ-READ            TO   TRUE
               PERFORM 1120-TESTAR-FS-%VAR4MODELOARQENT2%
               ADD  1                  TO   ACU-LIDOS-%VAR4MODELOARQENT2%
               PERFORM 2210-MONTAR-CHAVE-%VAR4MODELOARQENT2%
               PERFORM 2220-TESTAR-SEQUENCIA-%VAR4MODELOARQENT2%
           END-IF.

      *----------------------------------------------------------------*
       2200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2210-MONTAR-CHAVE-%VAR4MODELOARQENT2%      SECTION.
      *----------------------------------------------------------------*

           MOVE BOOK02-AGENCIA         TO   WRK-%VAR4MODELOARQENT2%-AGENCIA.
           MOVE BOOK02-CONTA           TO   WRK-%VAR4MODELOARQENT2%-CONTA.

      *----------------------------------------------------------------*
       2210-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2220-TESTAR-SEQUENCIA-%VAR4MODELOARQENT2%  SECTION.
      *----------------------------------------------------------------*

           MOVE '2220-TESTAR-SEQUENCIA-%VAR4MODELOARQENT2%'
                                       TO   FRWKGHEA-IDEN-PARAGRAFO.

           IF (WRK-CHAVE-%VAR4MODELOARQENT2%      LESS WRK-CHAVE-%VAR4MODELOARQENT2%-ANT)
               DISPLAY '**************** %Var1TIMelhoriasPrograma% ****************'
               DISPLAY '*                                        *'
               DISPLAY '*            ARQUIVO %VAR4MODELOARQENT2%            *'
               DISPLAY '*            FORA DE SEQUENCIA           *'
               DISPLAY '*         PROCESSAMENTO ENCERRADO        *'
               DISPLAY '* CHAVE ATU : '  WRK-CHAVE-%VAR4MODELOARQENT2%
                       '         *'
               DISPLAY '* CHAVE ANT : '  WRK-CHAVE-%VAR4MODELOARQENT2%-ANT
                       '         *'
               DISPLAY '*                                        *'
               DISPLAY '**************** %Var1TIMelhoriasPrograma% ****************'
               MOVE SPACES             TO   FRWKGLIV-COD-MENSAGEM
               MOVE 'ARQUIVO %VAR4MODELOARQENT2% FORA DE SEQUENCIA'
                                       TO   FRWKGLIV-PARAMETROS
               PERFORM 9200-FORMATAR-ERRO-LIVRE
           ELSE
               MOVE WRK-CHAVE-%VAR4MODELOARQENT2% TO   WRK-CHAVE-%VAR4MODELOARQENT2%-ANT
           END-IF.

      *----------------------------------------------------------------*
       2220-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*

           IF (WRK-CHAVE-%VAR3MODELOARQENT1%      EQUAL     WRK-CHAVE-%VAR4MODELOARQENT2%)
               PERFORM 3100-GRAVAR-%VAR5MODELOARQSAI1%
               PERFORM 2100-LER-%VAR3MODELOARQENT1%
               PERFORM 2200-LER-%VAR4MODELOARQENT2%
           ELSE
               IF (WRK-CHAVE-%VAR3MODELOARQENT1%  GREATER   WRK-CHAVE-%VAR4MODELOARQENT2%)
                   PERFORM 2200-LER-%VAR4MODELOARQENT2%
               ELSE
                   PERFORM 2100-LER-%VAR3MODELOARQENT1%
               END-IF
           END-IF.

      *----------------------------------------------------------------*
       3000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3100-GRAVAR-%VAR5MODELOARQSAI1%            SECTION.
      *----------------------------------------------------------------*

           PERFORM 3110-MOVER-CAMPOS-%VAR5MODELOARQSAI1%.

           MOVE '3100-GRAVAR-%VAR5MODELOARQSAI1%' TO FRWKGHEA-IDEN-PARAGRAFO.

           SET ARQ-WRITE               TO TRUE

           WRITE FD-%VAR5MODELOARQSAI1%           FROM BOOK03-REG.

           PERFORM 1130-TESTAR-FS-%VAR5MODELOARQSAI1%.

           ADD 1                       TO ACU-GRAVA-%VAR5MODELOARQSAI1%.

      *----------------------------------------------------------------*
       3100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3110-MOVER-CAMPOS-%VAR5MODELOARQSAI1%      SECTION.
      *----------------------------------------------------------------*

           INITIALIZE BOOK03-REG.

           MOVE BOOK01-REG             TO   BOOK03-REG.

           MOVE BOOK02-CAMPO           TO   BOOK03-CAMPO.

      *----------------------------------------------------------------*
       3110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       4000-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*

           MOVE '4000-FINALIZAR'       TO FRWKGHEA-IDEN-PARAGRAFO.

           CLOSE %VAR3MODELOARQENT1%
                 %VAR4MODELOARQENT2%
                 %VAR5MODELOARQSAI1%.

           SET ARQ-CLOSE               TO   TRUE.

           PERFORM 1100-TESTAR-FILE-STATUS.

           DISPLAY '************ %Var1TIMelhoriasPrograma% ************'.
           DISPLAY '*                                *'.
           DISPLAY '* PROGRAMA ENCERRADO COM SUCESSO *'.
           DISPLAY '*                                *'.
           DISPLAY '*                                *'.
           DISPLAY '************ %Var1TIMelhoriasPrograma% ************'.

           PERFORM 4100-EMITIR-TOTAIS.

           STOP RUN.

      *----------------------------------------------------------------*
       4000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       4100-EMITIR-TOTAIS              SECTION.
      *----------------------------------------------------------------*

           DISPLAY '******************** %Var1TIMelhoriasPrograma% ********************'.
           DISPLAY '*                                                *'.

           MOVE ACU-LIDOS-%VAR3MODELOARQENT1%     TO   WRK-MASK-ACU.
           DISPLAY '* TOTAL LIDOS %VAR3MODELOARQENT1%.............: '
                      WRK-MASK-ACU ' *'.

           MOVE ACU-LIDOS-%VAR4MODELOARQENT2%     TO   WRK-MASK-ACU.
           DISPLAY '* TOTAL LIDOS %VAR4MODELOARQENT2%.............: '
                      WRK-MASK-ACU ' *'.

           MOVE ACU-GRAVA-%VAR5MODELOARQSAI1%     TO   WRK-MASK-ACU.
           DISPLAY '* TOTAL GRAVADOS %VAR5MODELOARQSAI1%..........: '
                      WRK-MASK-ACU ' *'.

           DISPLAY '*                                                *'.
           DISPLAY '******************** %Var1TIMelhoriasPrograma% ********************'.

      *----------------------------------------------------------------*
       4100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9100-FORMATAR-ERRO-ARQUIVO      SECTION.
      *----------------------------------------------------------------*

           SET ERRO-ARQUIVO            TO TRUE.

           MOVE FRWKGARQ-TAM-LAYOUT    TO FRWKGHEA-TAM-DADOS.
           MOVE WRK-AREA-ERRO-ARQUIVO  TO WRK-BLOCO-INFO-ERRO
                                          (1:FRWKGHEA-TAM-DADOS).

           DISPLAY ' '.
           DISPLAY 'FRWKGARQ-FILE-STATUS   = ' FRWKGARQ-FILE-STATUS.
           DISPLAY 'FRWKGARQ-NOME-ARQUIVO  = ' FRWKGARQ-NOME-ARQUIVO.
           DISPLAY 'FRWKGARQ-COMANDO       = ' FRWKGARQ-COMANDO.

           PERFORM 9900-TRATAR-ERRO.

      *----------------------------------------------------------------*
       9100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9200-FORMATAR-ERRO-LIVRE        SECTION.
      *----------------------------------------------------------------*

           SET ERRO-LIVRE               TO   TRUE.

           MOVE 1                      TO   FRWKGLIV-IDIOMA.
           MOVE FRWKGLIV-TAM-LAYOUT    TO   FRWKGHEA-TAM-DADOS.
           MOVE WRK-AREA-ERRO-LIVRE    TO   WRK-BLOCO-INFO-ERRO
                                            (1:FRWKGHEA-TAM-DADOS).

           DISPLAY ' '.
           DISPLAY 'FRWKGLIV-IDIOMA       = ' FRWKGLIV-IDIOMA.
           DISPLAY 'FRWKGLIV-COD-MENSAGEM = ' FRWKGLIV-COD-MENSAGEM.
           DISPLAY 'FRWKGLIV-PARAMETROS   = ' FRWKGLIV-PARAMETROS.
           DISPLAY ' '.

           PERFORM 9900-TRATAR-ERRO.

      *----------------------------------------------------------------*
       9200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9900-TRATAR-ERRO                SECTION.
      *----------------------------------------------------------------*

           MOVE '%Var1TIMelhoriasPrograma%'             TO FRWKGHEA-NOME-PROGRAMA.

           PERFORM 4100-EMITIR-TOTAIS.

           PERFORM 9990-GRAVAR-LOG-ERRO.

           PERFORM 9999-ABENDAR-PROGRAMA.

           GOBACK.

      *----------------------------------------------------------------*
       9900-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9990-GRAVAR-LOG-ERRO            SECTION.
      *----------------------------------------------------------------*

           DISPLAY '*** FRWK2999 CHAMADO. SEGUEM SEUS PARAMETROS ***'.
           DISPLAY ' '.
           DISPLAY 'FRWKGHEA-TIPO-ERRO      = ' FRWKGHEA-TIPO-ERRO.
           DISPLAY 'FRWKGHEA-NOME-PROGRAMA  = ' FRWKGHEA-NOME-PROGRAMA.
           DISPLAY 'FRWKGHEA-IDEN-PARAGRAFO = ' FRWKGHEA-IDEN-PARAGRAFO.
           DISPLAY 'FRWKGHEA-TAM-DADOS      = ' FRWKGHEA-TAM-DADOS.

           CALL WRK-FRWK2999           USING WRK-AREA-ERRO.

           DISPLAY '*** PARAMETROS RETORNADOS PELO FRWK2999 ***'.
           DISPLAY 'FRWKGERR-COD-RETORNO    = ' FRWKGERR-COD-RETORNO.
           DISPLAY 'FRWKGERR-COD-ERRO       = ' FRWKGERR-COD-ERRO.
           DISPLAY 'FRWKGERR-COD-MENSAGEM   = ' FRWKGERR-COD-MENSAGEM.

      *----------------------------------------------------------------*
       9990-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9999-ABENDAR-PROGRAMA           SECTION.
      *----------------------------------------------------------------*

           DISPLAY '*** BRAD0450 CHAMADO PARA ABENDAR O PROGRAMA ***'.
           DISPLAY ' '.

           CALL 'BRAD0450'             USING WRK-0450-ABEND-BAT
                                             WRK-0450-DUMP-BAT.

      *----------------------------------------------------------------*
       9999-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
;
[MODELO Legado Balance-line c/ 2 Arquivos | ]
      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*

       PROGRAM-ID. |%VAR1MODELOPROGRAMA%.
       AUTHOR.     AUTOR.

      *================================================================*
      *                 P R I M E   I N F O R M A T I C A              *
      *----------------------------------------------------------------*
      *    PROGRAMA....:  %VAR1MODELOPROGRAMA%                                     *
      *    PROGRAMADOR.:  AUTOR                             -  PRIME   *
      *    ANALISTA....:  ANALISTA                          -  PRIME   *
      *    DATA........:  %VAR2MODELODATA%                                   *
      *----------------------------------------------------------------*
      *    OBJETIVO....:  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  *
      *                   XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  *
      *----------------------------------------------------------------*
      *    ARQUIVOS....:                                               *
      *                DDNAME           I/O           INCLUDE/BOOK     *
      *                %VAR3MODELOARQENT1%          I              I#BOOK01       *
      *                %VAR4MODELOARQENT2%          I              I#BOOK02       *
      *                %VAR5MODELOARQSAI1%          O              I#BOOK03       *
      *----------------------------------------------------------------*
      *    BOOK'S......:                                               *
      *    I#BOOK01 - DESCRICAO BOOK01                                 *
      *    I#BOOK02 - DESCRICAO BOOK02                                 *
      *    I#BOOK03 - DESCRICAO BOOK03                                 *
      *    I#BRAD7C - AREA PARA TRATAMENTO DE ERRO PELA BRAD7100       *
      *----------------------------------------------------------------*
      *    MODULOS.....:                                               *
      *    BRAD7100 - TRATAMENTO DE ERRO                               *
      *================================================================*

      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*

       SPECIAL-NAMES.
           DECIMAL-POINT               IS   COMMA.

      *----------------------------------------------------------------*
       INPUT-OUTPUT                    SECTION.
      *----------------------------------------------------------------*

       FILE-CONTROL.

           SELECT %VAR3MODELOARQENT1% ASSIGN      TO   UT-S-%VAR3MODELOARQENT1%
                      FILE STATUS      IS   WRK-FS-%VAR3MODELOARQENT1%.

           SELECT %VAR4MODELOARQENT2% ASSIGN      TO   UT-S-%VAR4MODELOARQENT2%
                      FILE STATUS      IS   WRK-FS-%VAR4MODELOARQENT2%.

           SELECT %VAR5MODELOARQSAI1% ASSIGN      TO   UT-S-%VAR5MODELOARQSAI1%
                      FILE STATUS      IS   WRK-FS-%VAR5MODELOARQSAI1%.

      *================================================================*
       DATA                            DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       FILE                            SECTION.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *   INPUT:   DESCRICAO ARQUIVO                                   *
      *            ORG. SEQUENCIAL     -   LRECL   =  0999             *
      *----------------------------------------------------------------*
       FD  %VAR3MODELOARQENT1%
           RECORDING MODE IS F
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-%VAR3MODELOARQENT1%                 PIC  X(999).

      *----------------------------------------------------------------*
      *   INPUT:   DESCRICAO ARQUIVO                                   *
      *            ORG. SEQUENCIAL     -   LRECL   =  0999             *
      *----------------------------------------------------------------*
       FD  %VAR4MODELOARQENT2%
           RECORDING MODE IS F
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-%VAR4MODELOARQENT2%                 PIC  X(999).

      *----------------------------------------------------------------*
      *   OUTPUT:  DESCRICAO ARQUIVO                                   *
      *            ORG. SEQUENCIAL     -   LRECL   =   999             *
      *----------------------------------------------------------------*
       FD  %VAR5MODELOARQSAI1%
           RECORDING MODE IS F
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-%VAR5MODELOARQSAI1%                 PIC  X(999).

      *----------------------------------------------------------------*
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)        VALUE
           '*** INICIO DA WORKING-STORAGE SECTION         ****'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ACUMULADORES                       ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  ACU-LIDOS-%VAR3MODELOARQENT1%          PIC  9(009) COMP-3  VALUE ZEROS.
       77  ACU-LIDOS-%VAR4MODELOARQENT2%          PIC  9(009) COMP-3  VALUE ZEROS.
       77  ACU-GRAVA-%VAR5MODELOARQSAI1%          PIC  9(009) COMP-3  VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE AUXILIARES                         ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  WRK-BATCH                   PIC  X(008)         VALUE
           'BATCH'.

       77  WRK-MASK-ACU                PIC  ZZZ.ZZZ.Z99    VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE TESTE DE FILE-STATUS               ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  WRK-FS-%VAR3MODELOARQENT1%             PIC  X(002)         VALUE SPACES.
       77  WRK-FS-%VAR4MODELOARQENT2%             PIC  X(002)         VALUE SPACES.
       77  WRK-FS-%VAR5MODELOARQSAI1%             PIC  X(002)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE MSG ERRO FILE STATUS               ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-ERRO-FS.
           05 FILLER                   PIC  X(005)         VALUE
              'ERRO '.
           05 WRK-OPERACAO             PIC  X(013)         VALUE SPACES.
              88 WRK-ABERTURA                              VALUE
                 'NA ABERTURA'.
              88 WRK-LEITURA                               VALUE
                 'NA LEITURA'.
              88 WRK-GRAVACAO                              VALUE
                 'NA GRAVACAO'.
              88 WRK-FECHAMENTO                            VALUE
                 'NO FECHAMENTO'.
           05 FILLER                   PIC  X(012)         VALUE
              ' DO ARQUIVO '.
           05 WRK-NOME-ARQ             PIC  X(008)         VALUE SPACES.
           05 FILLER                   PIC  X(015)         VALUE
              ' FILE STATUS = '.
           05 WRK-FILE-STATUS          PIC  X(002)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE CHAVES                             ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-CHAVE-%VAR3MODELOARQENT1%.
           05 WRK-%VAR3MODELOARQENT1%-AGENCIA     PIC  9(005)         VALUE ZEROS.
           05 WRK-%VAR3MODELOARQENT1%-CONTA       PIC  9(013)         VALUE ZEROS.

       01  WRK-CHAVE-%VAR4MODELOARQENT2%.
           05 WRK-%VAR4MODELOARQENT2%-AGENCIA     PIC  9(005)         VALUE ZEROS.
           05 WRK-%VAR4MODELOARQENT2%-CONTA       PIC  9(013)         VALUE ZEROS.

       01  WRK-CHAVE-%VAR3MODELOARQENT1%-ANT      PIC  X(018)         VALUE ZEROS.
       01  WRK-CHAVE-%VAR4MODELOARQENT2%-ANT      PIC  X(018)         VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ENTRADA %VAR3MODELOARQENT1%                   ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BOOK01'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ENTRADA %VAR4MODELOARQENT2%                   ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BOOK02'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE SAIDA %VAR5MODELOARQSAI1%                     ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BOOK03'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA BRAD7100                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BRAD7C'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** FIM DA WORKING-STORAGE SECTION             ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *================================================================*
       PROCEDURE                       DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       0000-ROTINA-PRINCIPAL           SECTION.
      *----------------------------------------------------------------*

           PERFORM 1000-INICIALIZAR.

           PERFORM 2000-VERIFICAR-VAZIO.

           PERFORM 3000-PROCESSAR      UNTIL     WRK-CHAVE-%VAR3MODELOARQENT1%
                                       EQUAL     HIGH-VALUES.

           PERFORM 4000-FINALIZAR.

      *----------------------------------------------------------------*
       0000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1000-INICIALIZAR                SECTION.
      *----------------------------------------------------------------*

           INITIALIZE ERRO-AREA.

           MOVE LOW-VALUES             TO   WRK-CHAVE-%VAR3MODELOARQENT1%-ANT
                                            WRK-CHAVE-%VAR4MODELOARQENT2%-ANT.

           OPEN INPUT  %VAR3MODELOARQENT1%
                       %VAR4MODELOARQENT2%
                OUTPUT %VAR5MODELOARQSAI1%.

           SET WRK-ABERTURA            TO   TRUE.

           PERFORM 1100-TESTAR-FS.

      *----------------------------------------------------------------*
       1000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1100-TESTAR-FS                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 1110-TESTAR-FS-%VAR3MODELOARQENT1%.

           PERFORM 1120-TESTAR-FS-%VAR4MODELOARQENT2%.

           PERFORM 1130-TESTAR-FS-%VAR5MODELOARQSAI1%.

      *----------------------------------------------------------------*
       1100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1110-TESTAR-FS-%VAR3MODELOARQENT1%         SECTION.
      *----------------------------------------------------------------*

           IF (WRK-FS-%VAR3MODELOARQENT1%         NOT EQUAL '00' AND '10')
               MOVE '%VAR3MODELOARQENT1%'         TO   WRK-NOME-ARQ
               MOVE WRK-FS-%VAR3MODELOARQENT1%    TO   WRK-FILE-STATUS
               MOVE WRK-ERRO-FS        TO   ERR-TEXTO
               PERFORM 9999-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       1110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1120-TESTAR-FS-%VAR4MODELOARQENT2%         SECTION.
      *----------------------------------------------------------------*

           IF (WRK-FS-%VAR4MODELOARQENT2%         NOT EQUAL '00' AND '10')
               MOVE '%VAR4MODELOARQENT2%'         TO   WRK-NOME-ARQ
               MOVE WRK-FS-%VAR4MODELOARQENT2%    TO   WRK-FILE-STATUS
               MOVE WRK-ERRO-FS        TO   ERR-TEXTO
               PERFORM 9999-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       1120-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1130-TESTAR-FS-%VAR5MODELOARQSAI1%         SECTION.
      *----------------------------------------------------------------*

           IF (WRK-FS-%VAR5MODELOARQSAI1%         NOT EQUAL '00')
               MOVE '%VAR5MODELOARQSAI1%'         TO   WRK-NOME-ARQ
               MOVE WRK-FS-%VAR5MODELOARQSAI1%    TO   WRK-FILE-STATUS
               MOVE WRK-ERRO-FS        TO   ERR-TEXTO
               PERFORM 9999-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       1130-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2000-VERIFICAR-VAZIO            SECTION.
      *----------------------------------------------------------------*

           PERFORM 2100-LER-%VAR3MODELOARQENT1%.

           IF (ACU-LIDOS-%VAR3MODELOARQENT1%      EQUAL     ZEROS)
               DISPLAY '************ %VAR1MODELOPROGRAMA% ************'
               DISPLAY '*                                *'
               DISPLAY '*     ARQUIVO %VAR3MODELOARQENT1% VAZIO     *'
               DISPLAY '*       PROGRAMA ENCERRADO       *'
               DISPLAY '*                                *'
               DISPLAY '************ %VAR1MODELOPROGRAMA% ************'
               PERFORM 4000-FINALIZAR
           END-IF.

           PERFORM 2200-LER-%VAR4MODELOARQENT2%.

           IF (ACU-LIDOS-%VAR4MODELOARQENT2%      EQUAL     ZEROS)
               DISPLAY '************ %VAR1MODELOPROGRAMA% ************'
               DISPLAY '*                                *'
               DISPLAY '*     ARQUIVO %VAR4MODELOARQENT2% VAZIO     *'
               DISPLAY '*                                *'
               DISPLAY '************ %VAR1MODELOPROGRAMA% ************'
           END-IF.

      *----------------------------------------------------------------*
       2000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2100-LER-%VAR3MODELOARQENT1%               SECTION.
      *----------------------------------------------------------------*

           READ %VAR3MODELOARQENT1%               INTO REG-BOOK01.

           SET WRK-LEITURA             TO   TRUE.

           PERFORM 1110-TESTAR-FS-%VAR3MODELOARQENT1%.

           IF (WRK-FS-%VAR3MODELOARQENT1%         EQUAL     '10')
               MOVE HIGH-VALUES        TO   WRK-CHAVE-%VAR3MODELOARQENT1%
           ELSE
               PERFORM 2110-MONTAR-CHAVE-%VAR3MODELOARQENT1%
               PERFORM 2120-TESTAR-SEQUENCIA-%VAR3MODELOARQENT1%
               ADD 1                   TO   ACU-LIDOS-%VAR3MODELOARQENT1%
           END-IF.

      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2110-MONTAR-CHAVE-%VAR3MODELOARQENT1%      SECTION.
      *----------------------------------------------------------------*

           MOVE BOOK01-AGENCIA         TO   WRK-%VAR3MODELOARQENT1%-AGENCIA.
           MOVE BOOK01-CONTA           TO   WRK-%VAR3MODELOARQENT1%-CONTA.

      *----------------------------------------------------------------*
       2110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2120-TESTAR-SEQUENCIA-%VAR3MODELOARQENT1%  SECTION.
      *----------------------------------------------------------------*

           IF (WRK-CHAVE-%VAR3MODELOARQENT1%      LESS WRK-CHAVE-%VAR3MODELOARQENT1%-ANT)
               DISPLAY '**************** %VAR1MODELOPROGRAMA% ****************'
               DISPLAY '*                                        *'
               DISPLAY '*            ARQUIVO %VAR3MODELOARQENT1%            *'
               DISPLAY '*            FORA DE SEQUENCIA           *'
               DISPLAY '*         PROCESSAMENTO ENCERRADO        *'
               DISPLAY '* CHAVE ATU : '  WRK-CHAVE-%VAR3MODELOARQENT1%
                       '         *'
               DISPLAY '* CHAVE ANT : '  WRK-CHAVE-%VAR3MODELOARQENT1%-ANT
                       '         *'
               DISPLAY '*                                        *'
               DISPLAY '**************** %VAR1MODELOPROGRAMA% ****************'
               MOVE 'ARQUIVO %VAR3MODELOARQENT1% FORA DE SEQUENCIA'
                                       TO   ERR-TEXTO
               PERFORM 9999-TRATAR-ERRO
           ELSE
               MOVE WRK-CHAVE-%VAR3MODELOARQENT1% TO   WRK-CHAVE-%VAR3MODELOARQENT1%-ANT
           END-IF.

      *----------------------------------------------------------------*
       2120-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2200-LER-%VAR4MODELOARQENT2%               SECTION.
      *----------------------------------------------------------------*

           READ %VAR4MODELOARQENT2%               INTO REG-BOOK02.

           SET WRK-LEITURA             TO   TRUE.

           PERFORM 1120-TESTAR-FS-%VAR4MODELOARQENT2%.

           IF (WRK-FS-%VAR4MODELOARQENT2%         EQUAL     '10')
               MOVE HIGH-VALUES        TO   WRK-CHAVE-%VAR4MODELOARQENT2%
           ELSE
               PERFORM 2210-MONTAR-CHAVE-%VAR4MODELOARQENT2%
               PERFORM 2220-TESTAR-SEQUENCIA-%VAR4MODELOARQENT2%
               ADD 1                   TO   ACU-LIDOS-%VAR4MODELOARQENT2%
           END-IF.

      *----------------------------------------------------------------*
       2200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2210-MONTAR-CHAVE-%VAR4MODELOARQENT2%      SECTION.
      *----------------------------------------------------------------*

           MOVE BOOK02-AGENCIA         TO   WRK-%VAR4MODELOARQENT2%-AGENCIA.
           MOVE BOOK02-CONTA           TO   WRK-%VAR4MODELOARQENT2%-CONTA.

      *----------------------------------------------------------------*
       2210-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2220-TESTAR-SEQUENCIA-%VAR4MODELOARQENT2%  SECTION.
      *----------------------------------------------------------------*

           IF (WRK-CHAVE-%VAR4MODELOARQENT2%      LESS WRK-CHAVE-%VAR4MODELOARQENT2%-ANT)
               DISPLAY '**************** %VAR1MODELOPROGRAMA% ****************'
               DISPLAY '*                                        *'
               DISPLAY '*            ARQUIVO %VAR4MODELOARQENT2%            *'
               DISPLAY '*            FORA DE SEQUENCIA           *'
               DISPLAY '*         PROCESSAMENTO ENCERRADO        *'
               DISPLAY '* CHAVE ATU : ' WRK-CHAVE-%VAR4MODELOARQENT2%
                       '         *'
               DISPLAY '* CHAVE ANT : ' WRK-CHAVE-%VAR4MODELOARQENT2%-ANT
                       '         *'
               DISPLAY '*                                        *'
               DISPLAY '**************** %VAR1MODELOPROGRAMA% ****************'
               MOVE 'ARQUIVO %VAR4MODELOARQENT2% FORA DE SEQUENCIA'
                                       TO   ERR-TEXTO
               PERFORM 9999-TRATAR-ERRO
           ELSE
               MOVE WRK-CHAVE-%VAR4MODELOARQENT2% TO   WRK-CHAVE-%VAR4MODELOARQENT2%-ANT
           END-IF.

      *----------------------------------------------------------------*
       2220-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*

           IF (WRK-CHAVE-%VAR3MODELOARQENT1%      EQUAL     WRK-CHAVE-%VAR4MODELOARQENT2%)
               PERFORM 3100-GRAVAR-%VAR5MODELOARQSAI1%
               PERFORM 2100-LER-%VAR3MODELOARQENT1%
               PERFORM 2200-LER-%VAR4MODELOARQENT2%
           ELSE
               IF (WRK-CHAVE-%VAR3MODELOARQENT1%  GREATER   WRK-CHAVE-%VAR4MODELOARQENT2%)
                   PERFORM 2200-LER-%VAR4MODELOARQENT2%
               ELSE
                   PERFORM 2100-LER-%VAR3MODELOARQENT1%
               END-IF
           END-IF.

      *----------------------------------------------------------------*
       3000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3100-GRAVAR-%VAR5MODELOARQSAI1%            SECTION.
      *----------------------------------------------------------------*

           PERFORM 3110-MOVER-CAMPOS-%VAR5MODELOARQSAI1%.

           WRITE FD-%VAR5MODELOARQSAI1%           FROM REG-BOOK03.

           SET WRK-GRAVACAO            TO   TRUE.

           PERFORM 1130-TESTAR-FS-%VAR5MODELOARQSAI1%.

           ADD 1                       TO   ACU-GRAVA-%VAR5MODELOARQSAI1%.

      *----------------------------------------------------------------*
       3100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3110-MOVER-CAMPOS-%VAR5MODELOARQSAI1%      SECTION.
      *----------------------------------------------------------------*

           INITIALIZE REG-BOOK03.

           MOVE REG-BOOK01             TO   REG-BOOK03.

           MOVE CAMPO-BOOK02           TO   CAMPO-BOOK03.

      *----------------------------------------------------------------*
       3110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       4000-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 4100-EMITIR-TOTAIS.

           CLOSE %VAR3MODELOARQENT1%
                 %VAR4MODELOARQENT2%
                 %VAR5MODELOARQSAI1%.

           SET WRK-FECHAMENTO          TO   TRUE.

           PERFORM 1100-TESTAR-FS.

           STOP RUN.

      *----------------------------------------------------------------*
       4000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       4100-EMITIR-TOTAIS              SECTION.
      *----------------------------------------------------------------*

           DISPLAY '******************** %VAR1MODELOPROGRAMA% ********************'.
           DISPLAY '*                                                *'.

           MOVE ACU-LIDOS-%VAR3MODELOARQENT1%     TO   WRK-MASK-ACU.
           DISPLAY '* TOTAL LIDOS %VAR3MODELOARQENT1%.............: '
                      WRK-MASK-ACU ' *'.

           MOVE ACU-LIDOS-%VAR4MODELOARQENT2%     TO   WRK-MASK-ACU.
           DISPLAY '* TOTAL LIDOS %VAR4MODELOARQENT2%.............: '
                      WRK-MASK-ACU ' *'.

           MOVE ACU-GRAVA-%VAR5MODELOARQSAI1%     TO   WRK-MASK-ACU.
           DISPLAY '* TOTAL GRAVADOS %VAR5MODELOARQSAI1%..........: '
                      WRK-MASK-ACU ' *'.

           DISPLAY '*                                                *'.
           DISPLAY '******************** %VAR1MODELOPROGRAMA% ********************'.

      *----------------------------------------------------------------*
       4100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9999-TRATAR-ERRO                SECTION.
      *----------------------------------------------------------------*

           MOVE '%VAR1MODELOPROGRAMA%'             TO   ERR-PGM.
           MOVE 'APL'                  TO   ERR-TIPO-ACESSO.

           CALL 'BRAD7100'             USING     WRK-BATCH
                                                 ERRO-AREA.

           GOBACK.

      *----------------------------------------------------------------*
       9999-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
;
[MODELO Legado Relatório Ler/Gravar | ]
      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*

       PROGRAM-ID. %VAR1MODELOPROGRAMA%.
       AUTHOR.     AUTOR.

      *================================================================*
      *                 P R I M E   I N F O R M A T I C A              *
      *----------------------------------------------------------------*
      *    PROGRAMA....:  %VAR1MODELOPROGRAMA%                                     *
      *    PROGRAMADOR.:  AUTOR                             -  PRIME   *
      *    ANALISTA....:  ANALISTA                          -  PRIME   *
      *    DATA........:  %VAR2MODELODATA%                                   *
      *----------------------------------------------------------------*
      *    OBJETIVO....:  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  *
      *                   XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  *
      *----------------------------------------------------------------*
      *    ARQUIVOS....:                                               *
      *                DDNAME           I/O           INCLUDE/BOOK     *
      *                ENTRADA1          I              I#BOOK01       *
      *                RELATO01          O                 -           *
      *----------------------------------------------------------------*
      *    BOOK'S......:                                               *
      *    I#BOOK01 - DESCRICAO BOOK01                                 *
      *    I#BRAD7C - AREA PARA TRATAMENTO DE ERRO PELA BRAD7100       *
      *----------------------------------------------------------------*
      *    MODULOS.....:                                               *
      *    BRAD7100 - TRATAMENTO DE ERRO                               *
      *    BRAD7600 - OBTEM DATA E HORA CORRENTE DO SISTEMA            *
      *================================================================*

      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*

       SPECIAL-NAMES.
           DECIMAL-POINT               IS   COMMA.

      *----------------------------------------------------------------*
       INPUT-OUTPUT                    SECTION.
      *----------------------------------------------------------------*

       FILE-CONTROL.

           SELECT ENTRADA1 ASSIGN      TO   UT-S-ENTRADA1
                      FILE STATUS      IS   WRK-FS-ENTRADA1.

           SELECT RELATO01 ASSIGN      TO   UT-S-RELATO01
                      FILE STATUS      IS   WRK-FS-RELATO01.

      *================================================================*
       DATA                            DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       FILE                            SECTION.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *   INPUT:   DESCRICAO ARQUIVO                                   *
      *            ORG. SEQUENCIAL     -   LRECL   =   999             *
      *----------------------------------------------------------------*
       FD  ENTRADA1
           RECORDING MODE IS F
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-ENTRADA1                 PIC  X(999).

      *----------------------------------------------------------------*
      *   OUTPUT:  DESCRICAO ARQUIVO                                   *
      *            ORG. SEQUENCIAL     -   LRECL   =   133             *
      *----------------------------------------------------------------*
       FD  RELATO01
           RECORDING MODE IS F
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-RELATO01                 PIC  X(133).

      *----------------------------------------------------------------*
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)        VALUE
           '*** INICIO DA WORKING-STORAGE SECTION         ****'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ACUMULADORES                       ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  ACU-LIDOS-ENTRADA1          PIC  9(009) COMP-3  VALUE ZEROS.
       77  ACU-GRAVA-RELATO01          PIC  9(009) COMP-3  VALUE ZEROS.

       77  ACU-LINHAS                  PIC  9(002) COMP-3  VALUE 60.
       77  ACU-PAGINA                  PIC  9(004) COMP-3  VALUE ZEROS.

       77  ACU-SALDO                   PIC S9(012)V99
                                                   COMP-3  VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE AUXILIARES                         ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  WRK-BATCH                   PIC  X(008)         VALUE
           'BATCH'.

       77  WRK-MAX-LINHAS              PIC  9(002)         VALUE 59.

       77  WRK-MASK-ACU                PIC  ZZZ.ZZZ.Z99    VALUE ZEROS.

       01  WRK-FIM-%VAR3MODELOARQENT1%            PIC   X(001)        VALUE SPACES.
           88 WRK-FIM-%VAR3MODELOARQENT1%-S                           VALUE 'S'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE TESTE DE FILE-STATUS               ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-FS-ENTRADA1             PIC  X(002)         VALUE SPACES.
       01  WRK-FS-RELATO01             PIC  X(002)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE MSG ERRO FILE STATUS               ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-ERRO-FS.
           05 FILLER                   PIC  X(005)         VALUE
              'ERRO '.
           05 WRK-OPERACAO             PIC  X(013)         VALUE SPACES.
              88 WRK-ABERTURA                              VALUE
                 'NA ABERTURA'.
              88 WRK-LEITURA                               VALUE
                 'NA LEITURA'.
              88 WRK-GRAVACAO                              VALUE
                 'NA GRAVACAO'.
              88 WRK-FECHAMENTO                            VALUE
                 'NO FECHAMENTO'.
           05 FILLER                   PIC  X(012)         VALUE
              ' DO ARQUIVO '.
           05 WRK-NOME-ARQ             PIC  X(008)         VALUE SPACES.
           05 FILLER                   PIC  X(015)         VALUE
              ' FILE STATUS = '.
           05 WRK-FILE-STATUS          PIC  X(002)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC X(050)          VALUE
           '*** AREA DA BRAD7600                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-7600-DATA-HORA.
           05 WRK-7600-DT-JULIANA      PIC  9(005) COMP-3  VALUE ZEROS.
           05 WRK-7600-DT-AAMMDDD      PIC  9(007) COMP-3  VALUE ZEROS.
           05 WRK-7600-DT-AAAAMMDD     PIC  9(009) COMP-3  VALUE ZEROS.
           05 WRK-7600-DT-HHMMSS       PIC  9(007) COMP-3  VALUE ZEROS.
           05 WRK-7600-DT-HHMMSSSS     PIC  9(013) COMP-3  VALUE ZEROS.
           05 WRK-7600-TIMESTAMP.
              10 WRK-7600-ANO          PIC  9(004)         VALUE ZEROS.
              10 WRK-7600-MES          PIC  9(002)         VALUE ZEROS.
              10 WRK-7600-DIA          PIC  9(002)         VALUE ZEROS.
              10 WRK-7600-HORA         PIC  9(002)         VALUE ZEROS.
              10 WRK-7600-MINUTOS      PIC  9(002)         VALUE ZEROS.
              10 WRK-7600-SEGUNDOS     PIC  9(002)         VALUE ZEROS.
              10 WRK-7600-MICROSEG     PIC  9(006)         VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE CABECALHOS                         ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  CABEC1.
           05 FILLER                   PIC  X(001)         VALUE '1'.
           05 CB1-DATA                 PIC  X(010)         VALUE SPACES.
           05 FILLER                   PIC  X(004)         VALUE SPACES.
           05 FILLER                   PIC  X(043)         VALUE SPACES.
           05 FILLER                   PIC  X(017)         VALUE
              'PRIME INFORMATICA'.
           05 FILLER                   PIC  X(050)         VALUE SPACES.
           05 FILLER                   PIC  X(008)         VALUE
              '%VAR1MODELOPROGRAMA%'.

       01  CABEC2.
           05 FILLER                   PIC  X(001)         VALUE ' '.
           05 FILLER                   PIC  X(014)         VALUE SPACES.
           05 FILLER                   PIC  X(030)         VALUE SPACES.
           05 FILLER                   PIC  X(042)         VALUE
              'MODELO RELATORIO 2 ARQUIVOS DE 133 COLUNAS'.
           05 FILLER                   PIC  X(030)         VALUE SPACES.
           05 FILLER                   PIC  X(012)         VALUE
              'PAG.: '.
           05 CB2-PAG                  PIC  ZZZ9           VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE LINHAS DE DETALHE                  ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  LINDET1.
           05  FILLER                  PIC  X(001)         VALUE ' '.
           05  FILLER                  PIC  X(006)         VALUE SPACES.
           05  FILLER                  PIC  X(022)         VALUE SPACES.
           05  LD1-COD-AGE             PIC  9(003)         VALUE ZEROS.
           05  FILLER                  PIC  X(037)         VALUE SPACES.
           05  LD1-VALOR-SALDO         PIC ZZZ.ZZZ.ZZ9,99- VALUE ZEROS.
           05  FILLER                  PIC  X(043)         VALUE SPACES.
           05  FILLER                  PIC  X(006)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE LINHAS DE TOTAL                    ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  LINTOT1.
           05  FILLER                  PIC  X(001)         VALUE ' '.
           05  FILLER                  PIC  X(006)         VALUE SPACES.
           05  FILLER                  PIC  X(020)         VALUE SPACES.
           05  FILLER                  PIC  X(016)         VALUE
               'TOTAL.........: '.
           05  LT1-TOTAL               PIC ZZZ.ZZZ.ZZZ.ZZ9,99-
                                                           VALUE SPACES.
           05  FILLER                  PIC  X(069)         VALUE SPACES.
           05  FILLER                  PIC  X(006)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ENTRADA ENTRADA1                   ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BOOK01'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA BRAD7100                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BRAD7C'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** FIM DA WORKING-STORAGE SECTION             ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *================================================================*
       PROCEDURE                       DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       0000-ROTINA-PRINCIPAL           SECTION.
      *----------------------------------------------------------------*

           PERFORM 1000-INICIALIZAR.

           PERFORM 2000-VERIFICAR-VAZIO.

           PERFORM 3000-PROCESSAR      UNTIL     WRK-FIM-%VAR3MODELOARQENT1%-S.

           PERFORM 4000-FINALIZAR.

      *----------------------------------------------------------------*
       0000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1000-INICIALIZAR                SECTION.
      *----------------------------------------------------------------*

           INITIALIZE ERRO-AREA.

           OPEN INPUT  ENTRADA1
                OUTPUT RELATO01.

           SET WRK-ABERTURA            TO   TRUE.

           PERFORM 1100-TESTAR-FS.

           PERFORM 1200-OBTER-DATA.

      *----------------------------------------------------------------*
       1000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1100-TESTAR-FS                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 1110-TESTAR-FS-ENTRADA1.

           PERFORM 1120-TESTAR-FS-RELATO01.

      *----------------------------------------------------------------*
       1100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1110-TESTAR-FS-ENTRADA1         SECTION.
      *----------------------------------------------------------------*

           IF (WRK-FS-ENTRADA1         NOT EQUAL '00' AND '10')
               MOVE 'ENTRADA1'         TO   WRK-NOME-ARQ
               MOVE WRK-FS-ENTRADA1    TO   WRK-FILE-STATUS
               MOVE WRK-ERRO-FS        TO   ERR-TEXTO
               PERFORM 9999-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       1110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1120-TESTAR-FS-RELATO01         SECTION.
      *----------------------------------------------------------------*

           IF (WRK-FS-RELATO01         NOT EQUAL '00')
               MOVE 'RELATO01'         TO   WRK-NOME-ARQ
               MOVE WRK-FS-RELATO01    TO   WRK-FILE-STATUS
               MOVE WRK-ERRO-FS        TO   ERR-TEXTO
               PERFORM 9999-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       1120-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1200-OBTER-DATA                 SECTION.
      *----------------------------------------------------------------*

           CALL 'BRAD7600'             USING     WRK-7600-DATA-HORA.

           STRING WRK-7600-DIA '/'
                  WRK-7600-MES '/'
                  WRK-7600-ANO
               DELIMITED BY SIZE       INTO CB1-DATA
           END-STRING.

      *----------------------------------------------------------------*
       1200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2000-VERIFICAR-VAZIO            SECTION.
      *----------------------------------------------------------------*

           PERFORM 2100-LER-ENTRADA1.

           IF (ACU-LIDOS-ENTRADA1      EQUAL     ZEROS)
               DISPLAY '************ %VAR1MODELOPROGRAMA% ************'
               DISPLAY '*                                *'
               DISPLAY '*     ARQUIVO ENTRADA1 VAZIO     *'
               DISPLAY '*       PROGRAMA ENCERRADO       *'
               DISPLAY '*                                *'
               DISPLAY '************ %VAR1MODELOPROGRAMA% ************'
               PERFORM 4000-FINALIZAR
           END-IF.

      *----------------------------------------------------------------*
       2000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2100-LER-ENTRADA1               SECTION.
      *----------------------------------------------------------------*

           READ ENTRADA1               INTO REG-BOOK01.

           SET WRK-LEITURA             TO   TRUE.

           PERFORM 1110-TESTAR-FS-ENTRADA1.

           IF (WRK-FS-ENTRADA1         EQUAL     '10')
               SET WRK-FIM-%VAR3MODELOARQENT1%-S  TO   TRUE
           ELSE
               ADD 1                   TO   ACU-LIDOS-ENTRADA1
           END-IF.

      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 3100-IMPRIMIR-DETALHE.

           PERFORM 2100-LER-ENTRADA1.

      *----------------------------------------------------------------*
       3000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3100-IMPRIMIR-DETALHE           SECTION.
      *----------------------------------------------------------------*

           IF (ACU-LINHAS              GREATER   WRK-MAX-LINHAS)
               PERFORM 3110-IMPRIMIR-CABECALHOS
           END-IF.

           PERFORM 3120-MOVER-CAMPOS-RELATO01.

           WRITE FD-RELATO01           FROM LINDET1.
           SET WRK-GRAVACAO            TO   TRUE.
           PERFORM 1120-TESTAR-FS-RELATO01.

           ADD 1                       TO   ACU-GRAVA-RELATO01
                                            ACU-LINHAS.

      *----------------------------------------------------------------*
       3100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3110-IMPRIMIR-CABECALHOS        SECTION.
      *----------------------------------------------------------------*

           SET WRK-GRAVACAO            TO   TRUE.

           WRITE FD-RELATO01           FROM CABEC1.
           PERFORM 1120-TESTAR-FS-RELATO01.

           ADD 1                       TO   ACU-PAGINA.

           MOVE ACU-PAGINA             TO   CB2-PAG.

           WRITE FD-RELATO01           FROM CABEC2.
           PERFORM 1120-TESTAR-FS-RELATO01.

           MOVE 2                      TO   ACU-LINHAS.

      *----------------------------------------------------------------*
       3110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3120-MOVER-CAMPOS-RELATO01      SECTION.
      *----------------------------------------------------------------*

           MOVE REG-BOOK01             TO   REG-BOOK03.

           MOVE CAMPO-BOOK02           TO   CAMPO-BOOK03.

           ADD BOOK1-SALDO             TO   ACU-SALDO.

      *----------------------------------------------------------------*
       3120-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       4000-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*

           IF (ACU-LIDOS-ENTRADA1      GREATER   ZEROS)
               PERFORM 4100-IMPRIMIR-TOTAIS
           END-IF.

           PERFORM 4200-EMITIR-ESTATISTICAS.

           CLOSE ENTRADA1
                 RELATO01.

           SET WRK-FECHAMENTO          TO   TRUE.

           PERFORM 1100-TESTAR-FS.

           STOP RUN.

      *----------------------------------------------------------------*
       4000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       4100-IMPRIMIR-TOTAIS            SECTION.
      *----------------------------------------------------------------*

           IF (ACU-LINHAS              GREATER   WRK-MAX-LINHAS)
               PERFORM 3110-IMPRIMIR-CABECALHOS
           END-IF.

           SET WRK-GRAVACAO            TO   TRUE.

           MOVE ACU-SALDO              TO   LT1-TOTAL.

           WRITE FD-RELATO01           FROM LINTOT1.
           PERFORM 1120-TESTAR-FS-RELATO01.

      *----------------------------------------------------------------*
       4100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       4200-EMITIR-ESTATISTICAS        SECTION.
      *----------------------------------------------------------------*

           DISPLAY '******************** %VAR1MODELOPROGRAMA% ********************'.
           DISPLAY '*                                                *'.

           MOVE ACU-LIDOS-ENTRADA1     TO   WRK-MASK-ACU.
           DISPLAY '* TOTAL LIDOS ENTRADA1.............: '
                      WRK-MASK-ACU ' *'.

           MOVE ACU-GRAVA-RELATO01     TO   WRK-MASK-ACU.
           DISPLAY '* TOTAL GRAVADOS RELATO01..........: '
                      WRK-MASK-ACU ' *'.

           DISPLAY '*                                                *'.
           DISPLAY '******************** %VAR1MODELOPROGRAMA% ********************'.

      *----------------------------------------------------------------*
       4200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9999-TRATAR-ERRO                SECTION.
      *----------------------------------------------------------------*

           MOVE '%VAR1MODELOPROGRAMA%'             TO   ERR-PGM.
           MOVE 'APL'                  TO   ERR-TIPO-ACESSO.

           CALL 'BRAD7100'             USING     WRK-BATCH
                                                 ERRO-AREA.

           GOBACK.

      *----------------------------------------------------------------*
       9999-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
;
[MODELO Legado c/ Checkpoint/Restart (CKRS0100) | ]
      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*

       PROGRAM-ID. %VAR1MODELOPROGRAMA%.
       AUTHOR.     AUTOR.

      *================================================================*
      *                 P R I M E   I N F O R M A T I C A              *
      *----------------------------------------------------------------*
      *    PROGRAMA....:  %VAR1MODELOPROGRAMA%                                     *
      *    PROGRAMADOR.:  AUTOR                             -  PRIME   *
      *    ANALISTA....:  ANALISTA                          -  PRIME   *
      *    DATA........:  %VAR2MODELODATA%                                   *
      *----------------------------------------------------------------*
      *    OBJETIVO....:  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  *
      *                   XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  *
      *----------------------------------------------------------------*
      *    ARQUIVOS....:                                               *
      *                DDNAME           I/O           INCLUDE/BOOK     *
      *                %VAR3MODELOARQENT1%          I              I#BOOK01       *
      *                %VAR4MODELOARQENT2%          I              I#BOOK02       *
      *                %VAR5MODELOARQSAI1%          O              I#BOOK03       *
      *----------------------------------------------------------------*
      *    BOOK'S......:                                               *
      *    I#BOOK01 - DESCRICAO BOOK01                                 *
      *    I#BOOK02 - DESCRICAO BOOK02                                 *
      *    I#BOOK03 - DESCRICAO BOOK03                                 *
      *    I#CKRS01 - AREA DE CONTROLE DE COMMIT/RESTART               *
      *    I#BRAD7C - AREA PARA TRATAMENTO DE ERRO PELA BRAD7100       *
      *----------------------------------------------------------------*
      *    MODULOS.....:                                               *
      *    CKRS1000 - CONEXAO COM O DB2                                *
      *    CKRS0100 - TRATAMENTO DE COMMIT/RESTART                     *
      *    BRAD7100 - TRATAMENTO DE ERRO                               *
      *================================================================*

      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*

       SPECIAL-NAMES.
           DECIMAL-POINT               IS   COMMA.

      *----------------------------------------------------------------*
       INPUT-OUTPUT                    SECTION.
      *----------------------------------------------------------------*

       FILE-CONTROL.

           SELECT %VAR3MODELOARQENT1% ASSIGN      TO   UT-S-%VAR3MODELOARQENT1%
                      FILE STATUS      IS   WRK-FS-%VAR3MODELOARQENT1%.

           SELECT %VAR4MODELOARQENT2% ASSIGN      TO   UT-S-%VAR4MODELOARQENT2%
                      FILE STATUS      IS   WRK-FS-%VAR4MODELOARQENT2%.

           SELECT %VAR5MODELOARQSAI1% ASSIGN      TO   UT-S-%VAR5MODELOARQSAI1%
                      FILE STATUS      IS   WRK-FS-%VAR5MODELOARQSAI1%.

      *================================================================*
       DATA                            DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       FILE                            SECTION.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *   INPUT:   DESCRICAO ARQUIVO                                   *
      *            ORG. SEQUENCIAL     -   LRECL   =   999             *
      *----------------------------------------------------------------*
       FD  %VAR3MODELOARQENT1%
           RECORDING MODE IS F
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-%VAR3MODELOARQENT1%                 PIC  X(999).

      *----------------------------------------------------------------*
      *   INPUT:   DESCRICAO ARQUIVO                                   *
      *            ORG. SEQUENCIAL     -   LRECL   =   999             *
      *----------------------------------------------------------------*
       FD  %VAR4MODELOARQENT2%
           RECORDING MODE IS F
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-%VAR4MODELOARQENT2%                 PIC  X(999).

      *----------------------------------------------------------------*
      *   OUTPUT:  DESCRICAO ARQUIVO                                   *
      *            ORG. SEQUENCIAL     -   LRECL   =   999             *
      *----------------------------------------------------------------*
       FD  %VAR5MODELOARQSAI1%
           RECORDING MODE IS F
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-%VAR5MODELOARQSAI1%                 PIC  X(999).

      *----------------------------------------------------------------*
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)        VALUE
           '*** INICIO DA WORKING-STORAGE SECTION         ****'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ACUMULADORES                       ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  ACU-LIDOS-%VAR3MODELOARQENT1%          PIC  9(009) COMP-3  VALUE ZEROS.
       77  ACU-LIDOS-%VAR4MODELOARQENT2%          PIC  9(009) COMP-3  VALUE ZEROS.
       77  ACU-GRAVA-%VAR5MODELOARQSAI1%          PIC  9(009) COMP-3  VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE AUXILIARES                         ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  WRK-BATCH                   PIC  X(008)         VALUE
           'BATCH'.

       77  WRK-MASK-ACU                PIC  ZZZ.ZZZ.Z99    VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       77  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE TESTE DE FILE-STATUS               ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       77  WRK-FS-%VAR3MODELOARQENT1%             PIC  X(002)         VALUE SPACES.
       77  WRK-FS-%VAR4MODELOARQENT2%             PIC  X(002)         VALUE SPACES.
       77  WRK-FS-%VAR5MODELOARQSAI1%             PIC  X(002)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE MSG ERRO FILE STATUS               ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-ERRO-FS.
           05 FILLER                   PIC  X(005)         VALUE
              'ERRO '.
           05 WRK-OPERACAO             PIC  X(013)         VALUE SPACES.
              88 WRK-ABERTURA                              VALUE
                 'NA ABERTURA'.
              88 WRK-LEITURA                               VALUE
                 'NA LEITURA'.
              88 WRK-GRAVACAO                              VALUE
                 'NA GRAVACAO'.
              88 WRK-FECHAMENTO                            VALUE
                 'NO FECHAMENTO'.
           05 FILLER                   PIC  X(012)         VALUE
              ' DO ARQUIVO '.
           05 WRK-NOME-ARQ             PIC  X(008)         VALUE SPACES.
           05 FILLER                   PIC  X(015)         VALUE
              ' FILE STATUS = '.
           05 WRK-FILE-STATUS          PIC  X(002)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE MENSAGEM DE ERRO DE MODULOS        ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-ERRO-MODULO.
           05 FILLER                   PIC  X(026)         VALUE
              'ERRO NA CHAMADA DO MODULO '.
           05 WRK-MODULO               PIC  X(008)         VALUE SPACES.
           05 FILLER                   PIC  X(017)         VALUE
              ' - FILE STATUS = '.
           05 WRK-COD-RETORNO          PIC  X(002)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE CHAVES                             ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-CHAVE-%VAR3MODELOARQENT1%.
           05 WRK-%VAR3MODELOARQENT1%-AGENCIA     PIC  9(005)         VALUE ZEROS.
           05 WRK-%VAR3MODELOARQENT1%-CONTA       PIC  9(013)         VALUE ZEROS.

       01  WRK-CHAVE-%VAR4MODELOARQENT2%.
           05 WRK-%VAR4MODELOARQENT2%-AGENCIA     PIC  9(005)         VALUE ZEROS.
           05 WRK-%VAR4MODELOARQENT2%-CONTA       PIC  9(013)         VALUE ZEROS.

       01  WRK-CHAVE-%VAR3MODELOARQENT1%-ANT      PIC  X(018)         VALUE ZEROS.
       01  WRK-CHAVE-%VAR4MODELOARQENT2%-ANT      PIC  X(018)         VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA UTILIZADA PARA EFETUAR RESTART        ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-AREA-RESTART.
           05 WRK-AR-LDS-%VAR3MODELOARQENT1%      PIC  9(009) COMP-3  VALUE ZEROS.
           05 WRK-AR-LDS-%VAR4MODELOARQENT2%      PIC  9(009) COMP-3  VALUE ZEROS.
           05 WRK-AR-GRV-%VAR5MODELOARQSAI1%      PIC  9(009) COMP-3  VALUE ZEROS.
           05 WRK-AR-CH-%VAR3MODELOARQENT1%       PIC  X(018)         VALUE SPACES.
           05 WRK-AR-CH-%VAR3MODELOARQENT1%-ANT   PIC  X(018)         VALUE SPACES.
           05 WRK-AR-CH-%VAR4MODELOARQENT2%       PIC  X(018)         VALUE SPACES.
           05 WRK-AR-CH-%VAR4MODELOARQENT2%-ANT   PIC  X(018)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ENTRADA %VAR3MODELOARQENT1%                   ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BOOK01'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ENTRADA %VAR4MODELOARQENT2%                   ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BOOK02'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE SAIDA %VAR5MODELOARQSAI1%                     ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BOOK03'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DO MODULO DE COMMIT/RESTART           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#CKRS01'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DA BRAD7100                           ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#BRAD7C'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DB2                                   ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

           EXEC SQL
                INCLUDE SQLCA
           END-EXEC.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** FIM DA WORKING-STORAGE SECTION             ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *================================================================*
       PROCEDURE                       DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       0000-ROTINA-PRINCIPAL           SECTION.
      *----------------------------------------------------------------*

           PERFORM 1000-INICIALIZAR.

           PERFORM 2000-VERIFICAR-VAZIO-RESTART.

           PERFORM 3000-PROCESSAR      UNTIL     WRK-CHAVE-%VAR3MODELOARQENT1%
                                       EQUAL     HIGH-VALUES.

           PERFORM 4000-FINALIZAR.

      *----------------------------------------------------------------*
       0000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1000-INICIALIZAR                SECTION.
      *----------------------------------------------------------------*

           PERFORM 5100-INICIALIZAR-CKRS.

           INITIALIZE ERRO-AREA.

           MOVE LOW-VALUES             TO   WRK-CHAVE-%VAR3MODELOARQENT1%-ANT
                                            WRK-CHAVE-%VAR4MODELOARQENT2%-ANT.

           OPEN INPUT  %VAR3MODELOARQENT1%
                       %VAR4MODELOARQENT2%
                OUTPUT %VAR5MODELOARQSAI1%.

           SET WRK-ABERTURA            TO   TRUE.

           PERFORM 1200-TESTAR-FS.

      *----------------------------------------------------------------*
       1000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1200-TESTAR-FS                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 1210-TESTAR-FS-%VAR3MODELOARQENT1%.

           PERFORM 1220-TESTAR-FS-%VAR4MODELOARQENT2%.

           PERFORM 1230-TESTAR-FS-%VAR5MODELOARQSAI1%.

      *----------------------------------------------------------------*
       1200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1210-TESTAR-FS-%VAR3MODELOARQENT1%         SECTION.
      *----------------------------------------------------------------*

           IF (WRK-FS-%VAR3MODELOARQENT1%         NOT EQUAL '00' AND '10')
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE '%VAR3MODELOARQENT1%'         TO   WRK-NOME-ARQ
               MOVE WRK-FS-%VAR3MODELOARQENT1%    TO   WRK-FILE-STATUS
               MOVE WRK-ERRO-FS        TO   ERR-TEXTO
               PERFORM 9999-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       1210-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1220-TESTAR-FS-%VAR4MODELOARQENT2%         SECTION.
      *----------------------------------------------------------------*

           IF (WRK-FS-%VAR4MODELOARQENT2%         NOT EQUAL '00' AND '10')
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE '%VAR4MODELOARQENT2%'         TO   WRK-NOME-ARQ
               MOVE WRK-FS-%VAR4MODELOARQENT2%    TO   WRK-FILE-STATUS
               MOVE WRK-ERRO-FS        TO   ERR-TEXTO
               PERFORM 9999-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       1220-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1230-TESTAR-FS-%VAR5MODELOARQSAI1%         SECTION.
      *----------------------------------------------------------------*

           IF (WRK-FS-%VAR5MODELOARQSAI1%         NOT EQUAL '00')
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               MOVE '%VAR5MODELOARQSAI1%'         TO   WRK-NOME-ARQ
               MOVE WRK-FS-%VAR5MODELOARQSAI1%    TO   WRK-FILE-STATUS
               MOVE WRK-ERRO-FS        TO   ERR-TEXTO
               PERFORM 9999-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       1230-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2000-VERIFICAR-VAZIO-RESTART    SECTION.
      *----------------------------------------------------------------*

           IF (CK01-RESTART)
               PERFORM 2100-LER-%VAR3MODELOARQENT1%
               IF (ACU-LIDOS-%VAR4MODELOARQENT2%  EQUAL     ZEROS)
                   PERFORM 2200-LER-%VAR4MODELOARQENT2%
               END-IF
           ELSE
               PERFORM 2100-LER-%VAR3MODELOARQENT1%
               IF (ACU-LIDOS-%VAR3MODELOARQENT1%  EQUAL     ZEROS)
                   DISPLAY '************ %VAR1MODELOPROGRAMA% ************'
                   DISPLAY '*                                *'
                   DISPLAY '*     ARQUIVO %VAR3MODELOARQENT1% VAZIO     *'
                   DISPLAY '*       PROGRAMA ENCERRADO       *'
                   DISPLAY '*                                *'
                   DISPLAY '************ %VAR1MODELOPROGRAMA% ************'
                   PERFORM 4000-FINALIZAR
               END-IF
               PERFORM 2200-LER-%VAR4MODELOARQENT2%
               IF (ACU-LIDOS-%VAR4MODELOARQENT2%  EQUAL     ZEROS)
                   DISPLAY '************ %VAR1MODELOPROGRAMA% ************'
                   DISPLAY '*                                *'
                   DISPLAY '*     ARQUIVO %VAR4MODELOARQENT2% VAZIO     *'
                   DISPLAY '*                                *'
                   DISPLAY '************ %VAR1MODELOPROGRAMA% ************'
               END-IF
           END-IF.

      *----------------------------------------------------------------*
       2000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2100-LER-%VAR3MODELOARQENT1%               SECTION.
      *----------------------------------------------------------------*

           READ %VAR3MODELOARQENT1%               INTO REG-BOOK01.

           SET WRK-LEITURA             TO   TRUE.

           PERFORM 1210-TESTAR-FS-%VAR3MODELOARQENT1%.

           IF (WRK-FS-%VAR3MODELOARQENT1%         EQUAL     '10')
               MOVE HIGH-VALUES        TO   WRK-CHAVE-%VAR3MODELOARQENT1%
           ELSE
               PERFORM 2110-MONTAR-CHAVE-%VAR3MODELOARQENT1%
               PERFORM 2120-TESTAR-SEQUENCIA-%VAR3MODELOARQENT1%
               ADD 1                   TO   ACU-LIDOS-%VAR3MODELOARQENT1%
           END-IF.

      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2110-MONTAR-CHAVE-%VAR3MODELOARQENT1%      SECTION.
      *----------------------------------------------------------------*

           MOVE BOOK01-AGENCIA         TO   WRK-%VAR3MODELOARQENT1%-AGENCIA.
           MOVE BOOK01-CONTA           TO   WRK-%VAR3MODELOARQENT1%-CONTA.

      *----------------------------------------------------------------*
       2110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2120-TESTAR-SEQUENCIA-%VAR3MODELOARQENT1%  SECTION.
      *----------------------------------------------------------------*

           IF (WRK-CHAVE-%VAR3MODELOARQENT1%      LESS WRK-CHAVE-%VAR3MODELOARQENT1%-ANT)
               DISPLAY '**************** %VAR1MODELOPROGRAMA% ****************'
               DISPLAY '*                                        *'
               DISPLAY '*            ARQUIVO %VAR3MODELOARQENT1%            *'
               DISPLAY '*            FORA DE SEQUENCIA           *'
               DISPLAY '*         PROCESSAMENTO ENCERRADO        *'
               DISPLAY '* CHAVE ATU : '  WRK-CHAVE-%VAR3MODELOARQENT1%
                       '         *'
               DISPLAY '* CHAVE ANT : '  WRK-CHAVE-%VAR3MODELOARQENT1%-ANT
                       '         *'
               DISPLAY '*                                        *'
               DISPLAY '**************** %VAR1MODELOPROGRAMA% ****************'
               MOVE 'ARQUIVO %VAR3MODELOARQENT1% FORA DE SEQUENCIA'
                                       TO   ERR-TEXTO
               PERFORM 9999-TRATAR-ERRO
           ELSE
               MOVE WRK-CHAVE-%VAR3MODELOARQENT1% TO   WRK-CHAVE-%VAR3MODELOARQENT1%-ANT
           END-IF.

      *----------------------------------------------------------------*
       2120-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2200-LER-%VAR4MODELOARQENT2%               SECTION.
      *----------------------------------------------------------------*

           READ %VAR4MODELOARQENT2%               INTO REG-BOOK02.

           SET WRK-LEITURA             TO   TRUE.

           PERFORM 1220-TESTAR-FS-%VAR4MODELOARQENT2%.

           IF (WRK-FS-%VAR4MODELOARQENT2%         EQUAL     '10')
               MOVE HIGH-VALUES         TO   WRK-CHAVE-%VAR4MODELOARQENT2%
           ELSE
               PERFORM 2210-MONTAR-CHAVE-%VAR4MODELOARQENT2%
               PERFORM 2220-TESTAR-SEQUENCIA-%VAR4MODELOARQENT2%
               ADD 1                   TO   ACU-LIDOS-%VAR4MODELOARQENT2%
           END-IF.

      *----------------------------------------------------------------*
       2200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2210-MONTAR-CHAVE-%VAR4MODELOARQENT2%      SECTION.
      *----------------------------------------------------------------*

           MOVE BOOK02-AGENCIA         TO   WRK-%VAR4MODELOARQENT2%-AGENCIA.
           MOVE BOOK02-CONTA           TO   WRK-%VAR4MODELOARQENT2%-CONTA.

      *----------------------------------------------------------------*
       2210-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2220-TESTAR-SEQUENCIA-%VAR4MODELOARQENT2%  SECTION.
      *----------------------------------------------------------------*

           IF (WRK-CHAVE-%VAR4MODELOARQENT2%      LESS WRK-CHAVE-%VAR4MODELOARQENT2%-ANT)
               DISPLAY '**************** %VAR1MODELOPROGRAMA% ****************'
               DISPLAY '*                                        *'
               DISPLAY '*            ARQUIVO %VAR4MODELOARQENT2%            *'
               DISPLAY '*            FORA DE SEQUENCIA           *'
               DISPLAY '*         PROCESSAMENTO ENCERRADO        *'
               DISPLAY '* CHAVE ATU : ' WRK-CHAVE-%VAR4MODELOARQENT2%
                       '         *'
               DISPLAY '* CHAVE ANT : ' WRK-CHAVE-%VAR4MODELOARQENT2%-ANT
                       '         *'
               DISPLAY '*                                        *'
               DISPLAY '**************** %VAR1MODELOPROGRAMA% ****************'
               MOVE 'ARQUIVO %VAR4MODELOARQENT2% FORA DE SEQUENCIA'
                                       TO   ERR-TEXTO
               PERFORM 9999-TRATAR-ERRO
           ELSE
               MOVE WRK-CHAVE-%VAR4MODELOARQENT2% TO   WRK-CHAVE-%VAR4MODELOARQENT2%-ANT
           END-IF.

      *----------------------------------------------------------------*
       2220-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*

           IF (WRK-CHAVE-%VAR3MODELOARQENT1%      EQUAL     WRK-CHAVE-%VAR4MODELOARQENT2%)
               PERFORM 3100-GRAVAR-%VAR5MODELOARQSAI1%
               PERFORM 2100-LER-%VAR3MODELOARQENT1%
               PERFORM 2200-LER-%VAR4MODELOARQENT2%
           ELSE
               IF (WRK-CHAVE-%VAR3MODELOARQENT1%  GREATER   WRK-CHAVE-%VAR4MODELOARQENT2%)
                   PERFORM 2200-LER-%VAR4MODELOARQENT2%
               ELSE
                   PERFORM 2100-LER-%VAR3MODELOARQENT1%
               END-IF
           END-IF.

      *----------------------------------------------------------------*
       3000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3100-GRAVAR-%VAR5MODELOARQSAI1%            SECTION.
      *----------------------------------------------------------------*

           PERFORM 3110-MOVER-CAMPOS-%VAR5MODELOARQSAI1%.

           WRITE FD-%VAR5MODELOARQSAI1%           FROM REG-BOOK03.

           SET WRK-GRAVACAO            TO   TRUE.

           PERFORM 1230-TESTAR-FS-%VAR5MODELOARQSAI1%.

           ADD 1                       TO   ACU-GRAVA-%VAR5MODELOARQSAI1%.

           PERFORM 5200-ATUALIZAR-CHECKPOINT.

      *----------------------------------------------------------------*
       3100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3110-MOVER-CAMPOS-%VAR5MODELOARQSAI1%      SECTION.
      *----------------------------------------------------------------*

           INITIALIZE REG-BOOK03.

           MOVE REG-BOOK01             TO   REG-BOOK03.

           MOVE CAMPO-BOOK02           TO   CAMPO-BOOK03.

      *----------------------------------------------------------------*
       3110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       4000-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 4100-EMITIR-TOTAIS.

           CLOSE %VAR3MODELOARQENT1%
                 %VAR4MODELOARQENT2%
                 %VAR5MODELOARQSAI1%.

           SET WRK-FECHAMENTO          TO   TRUE.

           PERFORM 1200-TESTAR-FS.

           PERFORM 5300-FINALIZAR-CKRS.

           STOP RUN.

      *----------------------------------------------------------------*
       4000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       4100-EMITIR-TOTAIS              SECTION.
      *----------------------------------------------------------------*

           DISPLAY '******************** %VAR1MODELOPROGRAMA% ********************'.
           DISPLAY '*                                                *'.

           MOVE ACU-LIDOS-%VAR3MODELOARQENT1%     TO   WRK-MASK-ACU.
           DISPLAY '* TOTAL LIDOS %VAR3MODELOARQENT1%.............: '
                      WRK-MASK-ACU ' *'.

           MOVE ACU-LIDOS-%VAR4MODELOARQENT2%     TO   WRK-MASK-ACU.
           DISPLAY '* TOTAL LIDOS %VAR4MODELOARQENT2%.............: '
                      WRK-MASK-ACU ' *'.

           MOVE ACU-GRAVA-%VAR5MODELOARQSAI1%     TO   WRK-MASK-ACU.
           DISPLAY '* TOTAL GRAVADOS %VAR5MODELOARQSAI1%..........: '
                      WRK-MASK-ACU ' *'.

           DISPLAY '*                                                *'.
           DISPLAY '******************** %VAR1MODELOPROGRAMA% ********************'.

      *----------------------------------------------------------------*
       4100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       5100-INICIALIZAR-CKRS           SECTION.
      *----------------------------------------------------------------*

           CALL 'CKRS1000'.

           INITIALIZE CKRS01-INTERFACE
                      WRK-AREA-RESTART.

           SET CK01-INICIALIZAR        TO   TRUE.

           MOVE SPACES                 TO   CK01-PLAN.
           MOVE 'DB2'                  TO   CK01-ID-DB2.
           MOVE WRK-AREA-RESTART       TO   CK01-AREA-RESTART.
           MOVE LENGTH                 OF   WRK-AREA-RESTART
                                       TO   CK01-TAM-AREA-RESTART.

           PERFORM 5900-CHAMAR-CKRS.

           IF (CK01-RESTART)
               PERFORM 5110-RECUPERAR-PONTO-RESTART
           END-IF.

      *----------------------------------------------------------------*
       5100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *  VALORIZA CAMPOS DE TRABALHO COM OS OBTIDOS NO RESTART         *
      *----------------------------------------------------------------*
       5110-RECUPERAR-PONTO-RESTART    SECTION.
      *----------------------------------------------------------------*

           MOVE CK01-AREA-RESTART(1:CK01-TAM-AREA-RESTART)
                                       TO   WRK-AREA-RESTART.
           MOVE WRK-AR-LDS-ARQUIVO1    TO   ACU-LIDOS-ARQUIVO1.
           MOVE WRK-AR-LDS-ARQUIVO2    TO   ACU-LIDOS-ARQUIVO2.
           MOVE WRK-AR-GRV-ARQUIVO3    TO   ACU-GRAVA-ARQUIVO3.
           MOVE WRK-AR-CH-ARQUIVO1     TO   WRK-CHAVE-ARQUIVO1.
           MOVE WRK-AR-CH-ARQUIVO1-ANT TO   WRK-CHAVE-ARQUIVO1-ANT.
           MOVE WRK-AR-CH-ARQUIVO2     TO   WRK-CHAVE-ARQUIVO2.
           MOVE WRK-AR-CH-ARQUIVO2-ANT TO   WRK-CHAVE-ARQUIVO2-ANT.

           DISPLAY '****************** PROG9999 ******************'.
           DISPLAY '*                                            *'.
           DISPLAY '*              EFETUADO RESTART              *'.
           DISPLAY '*                                            *'.
           DISPLAY '* ACU-LIDOS-ARQUIVO1     = ' ACU-LIDOS-ARQUIVO1
                   '         *'.
           DISPLAY '* ACU-LIDOS-ARQUIVO2     = ' ACU-LIDOS-ARQUIVO2
                   '         *'.
           DISPLAY '* ACU-GRAVA-ARQUIVO3     = ' ACU-GRAVA-ARQUIVO3
                   '         *'.
           DISPLAY '* WRK-CHAVE-ARQUIVO1     = ' WRK-CHAVE-ARQUIVO1
                   '*'.
           DISPLAY '* WRK-CHAVE-ARQUIVO1-ANT = '
                   WRK-CHAVE-ARQUIVO1-ANT '*'.
           DISPLAY '* WRK-CHAVE-ARQUIVO2     = ' WRK-CHAVE-ARQUIVO2
                   '*'.
           DISPLAY '* WRK-CHAVE-ARQUIVO2-ANT = '
                   WRK-CHAVE-ARQUIVO2-ANT '*'.
           DISPLAY '*                                            *'.
           DISPLAY '****************** PROG9999 ******************'.

      *----------------------------------------------------------------*
       5110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       5200-ATUALIZAR-CHECKPOINT       SECTION.
      *----------------------------------------------------------------*

           INITIALIZE CKRS01-INTERFACE.

           SET CK01-CHECKPOINT         TO   TRUE.

           MOVE 'DB2'                  TO   CK01-ID-DB2.

           MOVE ACU-LIDOS-%VAR3MODELOARQENT1%     TO   WRK-AR-LDS-%VAR3MODELOARQENT1%.
           MOVE ACU-LIDOS-%VAR4MODELOARQENT2%     TO   WRK-AR-LDS-%VAR4MODELOARQENT2%.
           MOVE ACU-GRAVA-%VAR5MODELOARQSAI1%     TO   WRK-AR-GRV-%VAR5MODELOARQSAI1%.

           MOVE WRK-CHAVE-%VAR3MODELOARQENT1%     TO   WRK-AR-CH-%VAR3MODELOARQENT1%.
           MOVE WRK-CHAVE-%VAR3MODELOARQENT1%-ANT TO   WRK-AR-CH-%VAR3MODELOARQENT1%-ANT.
           MOVE WRK-CHAVE-%VAR4MODELOARQENT2%     TO   WRK-AR-CH-%VAR4MODELOARQENT2%.
           MOVE WRK-CHAVE-%VAR4MODELOARQENT2%-ANT TO   WRK-AR-CH-%VAR4MODELOARQENT2%-ANT.

           MOVE WRK-AREA-RESTART       TO   CK01-AREA-RESTART.
           MOVE LENGTH                 OF   WRK-AREA-RESTART
                                       TO   CK01-TAM-AREA-RESTART.

           PERFORM 5900-CHAMAR-CKRS.

      *----------------------------------------------------------------*
       5200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       5300-FINALIZAR-CKRS             SECTION.
      *----------------------------------------------------------------*

           INITIALIZE CKRS01-INTERFACE.

           SET CK01-FINALIZAR          TO   TRUE.

           MOVE 'DB2'                  TO   CK01-ID-DB2.

           PERFORM 5900-CHAMAR-CKRS.

      *----------------------------------------------------------------*
       5300-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       5900-CHAMAR-CKRS                SECTION.
      *----------------------------------------------------------------*

           MOVE 'CKRS0100'             TO   WRK-MODULO.

           CALL WRK-MODULO             USING     CKRS01-INTERFACE.

           IF (CK01-CODIGO-RETORNO     NOT EQUAL ZEROS)
               DISPLAY '****************** %VAR1MODELOPROGRAMA% ******************'
               DISPLAY '*                                            *'
               DISPLAY '*          ERRO NA CHAMADA DO MODULO         *'
               DISPLAY '*             CKRS0100 (RESTART)             *'
               DISPLAY '*                                            *'
               DISPLAY '*               RETORNO =   '
                       CK01-CODIGO-RETORNO '               *'
               DISPLAY '*                                            *'
               DISPLAY '*           PROCESSAMENTO ENCERRADO          *'
               DISPLAY '*                                            *'
               DISPLAY '****************** %VAR1MODELOPROGRAMA% ******************'
               MOVE 'APL'              TO   ERR-TIPO-ACESSO
               STRING CK01-CODIGO-RETORNO
                   DELIMITED BY SIZE   INTO WRK-COD-RETORNO
               END-STRING
               MOVE WRK-ERRO-MODULO    TO   ERR-TEXTO
               PERFORM 9999-TRATAR-ERRO
           END-IF.

      *----------------------------------------------------------------*
       5900-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9999-TRATAR-ERRO                SECTION.
      *----------------------------------------------------------------*

           MOVE '%VAR1MODELOPROGRAMA%'             TO   ERR-PGM.

           CALL 'BRAD7100'             USING     WRK-BATCH
                                                 ERRO-AREA
                                                 SQLCA.

           GOBACK.

      *----------------------------------------------------------------*
       9999-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
;
[MODELO Mapa CICS (BMS) | ]
*=====================================================================*
*                   P R I M E  I N F O R M A T I C A                  *
*---------------------------------------------------------------------*
*    MAPA........:  %VAR0MODELOMAPA%   	                                       *
*    PROGRAMA....:  %VAR1MODELOPROGRAMA%                                          *
*    PROGRAMADOR.:  XXXXXXXXXXXXXXXXXXX                     -  PRIME  *
*    ANALISTA....:  XXXXXXXXXXXXXXXXXXX                     -  PRIME  *
*    DATA........:  %VAR2MODELODATA%                                        *
*---------------------------------------------------------------------*
*    OBJETIVO....:  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  *
*=====================================================================*
%VAR0MODELOMAPA% DFHMSD LANG=COBOL,                                             -
               MODE=INOUT,                                             -
               STORAGE=AUTO,                                           -
               TIOAPFX=YES,                                            -
               TYPE=&&SYSPARM
%VAR0MODELOMAPA% DFHMDI SIZE=(24,80)
*---------------------------------------------------------------------*
* LINHA 01                                                            *
*---------------------------------------------------------------------*
DATA    DFHMDF ATTRB=(FSET,NORM,PROT),                                 -
               LENGTH=11,                                              -
               POS=(01,01),                                            -
               INITIAL='DD/MMM/AAAA'
HORA    DFHMDF ATTRB=(FSET,NORM,PROT),                                 -
               LENGTH=5,                                               -
               POS=(01,13),                                            -
               INITIAL='HH:MM'
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=20,                                              -
               POS=(01,32),                                            -
               INITIAL='ORGANIZACAO BRADESCO'
CICS    DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=08,                                              -
               POS=(01,66)
        DFHMDF ATTRB=(ASKIP),                                          -
               LENGTH=04,                                              -
               POS=(01,76),                                            -
               INITIAL='TRAN'
*---------------------------------------------------------------------*
* LINHA 02                                                            *
*---------------------------------------------------------------------*
        DFHMDF ATTRB=(FSET,NORM,PROT),                                 -
               LENGTH=08,                                              -
               POS=(02,01),                                            -
               INITIAL='SISTEMA:'
        DFHMDF ATTRB=(FSET,BRT,PROT),                                  -
               LENGTH=21,                                              -
               POS=(02,10),                                            -
               INITIAL='ATUALIZACAO DE SALDOS'
        DFHMDF ATTRB=(FSET,NORM,PROT),                                 -
               LENGTH=07,                                              -
               POS=(02,42),                                            -
               INITIAL='FUNCAO:'
        DFHMDF ATTRB=(FSET,BRT,PROT),                                  -
               LENGTH=30,                                              -
               POS=(02,50),                                            -
               INITIAL='INCLUSAO LIMITE DEPOSITO CONTA'
*---------------------------------------------------------------------*
* LINHA 05                                                            *
*---------------------------------------------------------------------*
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=29,                                              -
               POS=(05,01),                                            -
               INITIAL='AGENCIA ....................:'
CDAGEN  DFHMDF ATTRB=(FSET,NORM,UNPROT,IC),                            -
               LENGTH=05,                                              -
               POS=(05,31)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=01,                                              -
               POS=(05,37),                                            -
               INITIAL='-'
NMAGEN  DFHMDF ATTRB=(FSET,NORM,ASKIP),                                -
               LENGTH=40,                                              -
               POS=(05,39)
*---------------------------------------------------------------------*
* LINHA 06                                                            *
*---------------------------------------------------------------------*
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=29,                                              -
               POS=(06,01),                                            -
               INITIAL='CONTA CORRENTE .............:'
CCTACOR DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -
               LENGTH=13,                                              -
               POS=(06,31)
DIGCTAC DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -
               LENGTH=01,                                              -
               POS=(06,45)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=01,                                              -
               POS=(06,47),                                            -
               INITIAL='-'
NMCLI   DFHMDF ATTRB=(FSET,NORM,ASKIP),                                -
               LENGTH=30,                                              -
               POS=(06,49)
*---------------------------------------------------------------------*
* LINHA 08                                                            *
*---------------------------------------------------------------------*
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=29,                                              -
               POS=(08,01),                                            -
               INITIAL='AGENCIA DE RELACIONAMENTO ..:'
CAGENRE DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -
               LENGTH=05,                                              -
               POS=(08,31)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=01,                                              -
               POS=(08,37),                                            -
               INITIAL='-'
NMAGENR DFHMDF ATTRB=(FSET,NORM,ASKIP),                                -
               LENGTH=40,                                              -
               POS=(08,39)
*---------------------------------------------------------------------*
* LINHA 09                                                            *
*---------------------------------------------------------------------*
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=29,                                              -
               POS=(09,01),                                            -
               INITIAL='PACB .......................:'
CPACB   DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -
               LENGTH=03,                                              -
               POS=(09,31)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=02,                                              -
               POS=(09,35),                                            -
               INITIAL='-'
NMPACB  DFHMDF ATTRB=(FSET,NORM,ASKIP),                                -
               LENGTH=40,                                              -
               POS=(09,39)
*---------------------------------------------------------------------*
* LINHA 11                                                            *
*---------------------------------------------------------------------*
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=29,                                              -
               POS=(11,01),                                            -
               INITIAL='LIMITE .....................:'
LIMITE  DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -
               LENGTH=04,                                              -
               POS=(11,31)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=00,                                              -
               POS=(11,36)
*---------------------------------------------------------------------*
* LINHA 22                                                            *
*---------------------------------------------------------------------*
MENSAG  DFHMDF ATTRB=(ASKIP,BRT,FSET),                                 -
               LENGTH=79,                                              -
               POS=(22,01)
*---------------------------------------------------------------------*
* LINHA 23                                                            *
*---------------------------------------------------------------------*
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=79,                                              -
               POS=(23,01),                                            -
               INITIAL='------------------------------------------------
               --------------------------------'
*---------------------------------------------------------------------*
* LINHA 24                                                            *
*---------------------------------------------------------------------*
        DFHMDF ATTRB=(ASKIP,BRT),                                      -
               LENGTH=05,                                              -
               POS=(24,01),                                            -
               INITIAL='PFS.:'
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=20,                                              -
               POS=(24,07),                                            -
               INITIAL='3=RETORNA, CLEAR=FIM'
        DFHMSD TYPE=FINAL
        END
;