PARA QUE OS DISPLAYS DE UM PROGRAMA SEJAM MOSTRADOS NO ROSCOE QUANDO O PROCESSAMENTO FOR FINALIZADO,
E NAO NO EVT4, É NECESSÁRIO INCLUIR A LINHA A SEGUIR NO JOB DE EXECUÇÃO DO PROGRAMA:

//OUT1     OUTPUT JESDS=ALL,DEST=ANYLOCAL,CLASS=T

EX:

//DC71R00P JOB 'CBFI,4150,BN,CBFI6005',MSGCLASS=Z,CLASS=E
//*   TIME=1                                             
//JOBLIB   DD DSN=AV.BIBGERTT,DISP=SHR                   
//         DD DSN=AV.BIBGERAL,DISP=SHR                   
//         DD DSN=DB2A2.R2.DSNLOAD,DISP=SHR              
//         DD DSN=SYS1.CEE.SCEERUN,DISP=SHR              
//OUT1     OUTPUT JESDS=ALL,DEST=ANYLOCAL,CLASS=T        
//*                                                      
//STEP1    EXEC PGM=GIPS2213                             


E PARA VER OS DISPLAYS GERADOS, APÓS EXECUTAR O PROGRAMA, EXECUTAR O SEGUINTE COMANDO:

A J NOMEJOB NUMEROJOB

PF5 ALTERNA ENTRE AS ESTATISTICAS GERADAS.

